{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hey",
                "How are you",
                "Is anyone there?",
                "Hello",
                "Good day"
            ],
            "responses": [
                "Hey :-)",
                "Hello, thanks for visiting",
                "Hi there, what can I do for you?",
                "Hi there, how can I help?"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "See you later",
                "Goodbye"
            ],
            "responses": [
                "See you later, thanks for visiting",
                "Have a nice day",
                "Bye! Come back again soon."
            ]
        },
        {
            "tag": "thanks",
            "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
            "responses": ["Happy to help!", "Any time!", "My pleasure"]
        },
        {
            "tag": "items",
            "patterns": [
              "tell me about this app",
              "What kinds of technology used?",
              "What is this?",
              "What are you?"
            ],
            "responses": [
              "This is a chatbot called Admission ChatBUt: Your Admission Guide.",
              "Hey there! This is a web application that aids students in there admission for Bicol University."
            ]
        },        
        {
            "tag": "funny",
            "patterns": [
              "Tell me a joke!",
              "Tell me something funny!",
              "Do you know a joke?"
            ],
            "responses": [
              "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
              "What did the buffalo say when his son left for college? Bison."
            ]
        },
        {
            "tag": "form",
            "patterns": [
                "Where should I go to obtain the BUCET application form?",
                "What is the location for acquiring the BUCET application form?",
                "Could you direct me to where I can pick up the BUCET application form?",
                "Where can I find the BUCET application form?",
                "What's the designated place to get the BUCET application form?",
                "Can you guide me on where to secure the BUCET application form?",
                "In which office can I obtain the BUCET application form?",
                "Where is the distribution point for the BUCET application form?",
                "What's the specific location to collect the BUCET application form?",
                "Could you inform me about where I can access the BUCET application form?",
                "Where do I need to go to fetch the BUCET application form?",
                "Can you tell me the exact place to procure the BUCET application form?",
                "What is the venue for obtaining the BUCET application form?",
                "Where am I supposed to go to get the BUCET application form?",
                "Do you know where I can get my hands on the BUCET application form?",
                "Could you point me in the right direction to get the BUCET application form?",
                "Where do applicants go to receive the BUCET application form?",
                "What's the location for picking up the BUCET application form?",
                "Where should I head to acquire the BUCET application form?",
                "Can you provide information on where I can procure the BUCET application form?",
                "Where is the designated spot for obtaining the BUCET application form?",
                "Do you know the place where I can obtain the BUCET application form?",
                "Where can I retrieve the BUCET application form?",
                "Could you advise me on the location to obtain the BUCET application form?",
                "What's the address for obtaining the BUCET application form?",
                "Where can I go to pick up the BUCET application form?",
                "Can you direct me to the office where I can obtain the BUCET application form?",
                "What's the specific office for acquiring the BUCET application form?",
                "Where do I need to visit to get the BUCET application form?",
                "Could you let me know the location where I can get the BUCET application form?",
                "Where is the official place to obtain the BUCET application form?",
                "Where can I find the BUCET application form on campus?",
                "Where is the official place to obtain the BUCET application form?",
                "What's the official office for distributing the BUCET application form?",
                "Can you tell me where the BUCET application forms are available?",
                "Where should I go on campus to get the BUCET application form?",
                "What's the designated building for obtaining the BUCET application form?",
                "Where can I go within the university to acquire the BUCET application form?"
            ],
            "responses": [
                "Begin your application journey by browsing: https://buao.bicol-u.edu.ph",
                "Gain access to the application portal by clicking: https://buao.bicol-u.edu.ph",
                "Take the first step in your application by navigating to: https://buao.bicol-u.edu.ph",
                "Apply easily by clicking: https://buao.bicol-u.edu.ph",
                "Access the application link via direct browsing: https://buao.bicol-u.edu.ph",
                "Apply now by going to: https://buao.bicol-u.edu.ph",
                "Initiate your application process by clicking: https://buao.bicol-u.edu.ph",
                "Access the application form by visiting: https://buao.bicol-u.edu.ph",
                "Begin your application journey by accessing: https://buao.bicol-u.edu.ph",
                "Start your application journey by visiting: https://buao.bicol-u.edu.ph",
                "Apply conveniently by browsing: https://buao.bicol-u.edu.ph",
                "Take the initiative to apply by clicking: https://buao.bicol-u.edu.ph",
                "Begin your application process by navigating to: https://buao.bicol-u.edu.ph",
                "Access the application portal by opening: https://buao.bicol-u.edu.ph",
                "Start your application journey by clicking: https://buao.bicol-u.edu.ph",
                "Begin your application process by visiting: https://buao.bicol-u.edu.ph",
                "Apply now by browsing: https://buao.bicol-u.edu.ph",
                "Gain access to the application portal by navigating to: https://buao.bicol-u.edu.ph",
                "Initiate your application by clicking: https://buao.bicol-u.edu.ph",
                "Access the application form easily via direct visit: https://buao.bicol-u.edu.ph",
                "Apply now by accessing: https://buao.bicol-u.edu.ph"
            ]
        },
        {
            "tag": "reschedule",
            "patterns": [
                "Could you provide instructions on rescheduling my appointment date?",
                "What's the proper procedure for changing my appointment date?",
                "Can you inform me about the protocol for rescheduling my appointment date?",
                "How can I adjust my appointment date to a different time?",
                "What is the correct way to modify my appointment date?",
                "Could you explain the steps involved in rescheduling my appointment date?",
                "Is there a specific process for changing my appointment date?",
                "What do I need to do to reschedule my appointment date?",
                "Can you walk me through the steps to reschedule my appointment date?",
                "How can I make adjustments to my scheduled appointment date?",
                "What's the recommended method for rescheduling my appointment date?",
                "Can you provide guidance on the proper way to change my appointment date?",
                "What is the official procedure for rescheduling an appointment date?",
                "How do I formally request a change in my appointment date?",
                "Could you outline the steps for rescheduling my appointment date?",
                "Is there a specific form or process for altering my appointment date?",
                "How do I initiate the process of changing my appointment date?",
                "What documentation or information do I need to provide to reschedule my appointment date?",
                "Could you inform me of the proper channels to go through for rescheduling my appointment date?",
                "How can I officially request a reschedule for my appointment date?",
                "What's the formal way to request a change in my appointment date?",
                "Can you explain the official policy for rescheduling appointment dates?",
                "Is there a specific department or contact I should reach out to for rescheduling my appointment date?",
                "How do I navigate the system to reschedule my appointment date?",
                "What options are available for me to reschedule my appointment date?",
                "How do I access the rescheduling feature for my appointment date?",
                "Can you explain the online process for rescheduling my appointment date?",
                "What is the preferred method for rescheduling an appointment date?",
                "What is the recommended communication method for rescheduling an appointment date?",
                "How do I inform the relevant authorities about my intention to change my appointment date?",
                "Can you advise me on the best way to communicate my need to reschedule my appointment date?",
                "How do I officially notify the organization about my desire to change my appointment date?",
                "Can you guide me on the proper communication channels for rescheduling my appointment date?",
                "What's the appropriate way to inform the concerned parties about my need to change my appointment date?"
            ],
            "responses": [
                "To change your appointment date, simply click on the link provided: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Rescheduling made simple: access the link here: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "If you need to reschedule your appointment date, visit: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "You can change your appointment date by navigating to: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Want to change the date? Click here: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Adjust your appointment date by following this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Need to reschedule your appointment? Visit the link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Reschedule your appointment date by accessing this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Change your appointment date easily: visit this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "For appointment date changes, click here: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "To change your appointment date, visit this webpage: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Reschedule your appointment by visiting this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Adjust your appointment date easily: click here: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Want to change your appointment date? Go here: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Need to reschedule? Click on this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Reschedule your appointment date by accessing this webpage: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Change your appointment date easily: visit: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "For appointment date changes, visit this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "To change your appointment date, click here: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Reschedule your appointment by following this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Adjust your appointment date easily: visit the provided link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Want to change the date? Click on this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Need to reschedule your appointment? Go to: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Reschedule your appointment date by clicking here: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Change your appointment date easily: access this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "For appointment date changes, visit this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "To change your appointment date, click here: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Reschedule your appointment by following this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Adjust your appointment date easily: visit the provided link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Want to change the date? Click on this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Need to reschedule your appointment? Go to: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Reschedule your appointment date by clicking here: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Change your appointment date easily: access this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "For appointment date changes, visit: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "To change your appointment date, click the link provided: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Reschedule your appointment by visiting this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Adjust your appointment date easily: click here: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Want to change your appointment date? Go to: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Need to reschedule? Click on this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Reschedule your appointment date by navigating to: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Change your appointment date easily: visit this webpage: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "For appointment date changes, click here: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php"
            ]
        },
        {
            "tag": "retrieve",
            "patterns": [
                "How can I access and retrieve the BUCET application form online?",
                "What is the correct way to download and retrieve the BUCET application form?",
                "Could you explain the steps involved in retrieving the BUCET application form?",
                "Is there a specific website or platform for retrieving the BUCET application form?",
                "What do I need to do to retrieve the BUCET application form?",
                "Can you walk me through the process to retrieve the BUCET application form?",
                "How can I make sure I retrieve the most updated version of the BUCET application form?",
                "What is the official procedure for obtaining and retrieving the BUCET application form?",
                "How do I formally request and retrieve the BUCET application form?",
                "Could you outline the steps for retrieving the BUCET application form?",
                "Is there a specific link or download page for retrieving the BUCET application form?",
                "What is the standard protocol for retrieving the BUCET application form?",
                "Can you tell me the steps involved in obtaining and retrieving the BUCET application form?",
                "How do I initiate the process of retrieving the BUCET application form?",
                "What documentation or information do I need to provide to retrieve the BUCET application form?",
                "Could you inform me of the proper channels to go through for retrieving the BUCET application form?",
                "How can I officially request to retrieve the BUCET application form?",
                "What's the formal way to request and retrieve the BUCET application form?",
                "Can you explain the official policy for obtaining and retrieving the BUCET application form?",
                "Is there a specific department or contact I should reach out to for retrieving the BUCET application form?",
                "How do I navigate the system to retrieve the BUCET application form?",
                "Can you guide me on using the online platform to obtain and retrieve the BUCET application form?",
                "How can I utilize the online portal to obtain and retrieve the BUCET application form?",
                "Can you provide instructions on retrieving the BUCET application form through the website?",
                "What options are available for me to download and retrieve the BUCET application form?",
                "How do I access the retrieval feature for the BUCET application form?",
                "What is the preferred method for downloading and retrieving the BUCET application form?",
                "Can you advise me on the best way to communicate my need to obtain and retrieve the BUCET application form?",
                "How do I officially notify the organization about my desire to obtain and retrieve the BUCET application form?",
                "How do I ensure that I retrieve the correct and official BUCET application form?",
                "Can you guide me on the proper communication channels for downloading and retrieving the BUCET application form?",
                "What's the appropriate way to inform the concerned parties about my need to obtain and retrieve the BUCET application form?",
                "Can you provide information on the response time after submitting a request to obtain and retrieve the BUCET application form?",
                "What is the recommended communication method for downloading and retrieving the BUCET application form?",
                "Can you advise me on where to process my application form retrieval request?",
                "Where can i get or retrieve my BUCET application form?"
            ],
            "responses": [
                "Use the link to find and download your application form: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Access and download your application form via link visit: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Obtain your application form by clicking on this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Visit the link to find and retrieve your application form: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Retrieve your application form by visiting: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Click the link provided to find and download your application form: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Discover your application form by clicking on this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Find and download your application form via link visit: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Locate your application form by visiting: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Visit the link to discover your application form for download: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Retrieve your application form by clicking on the link provided: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Visit the provided link to find and download your application form: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Access and download your application form via link visitation: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Obtain your application form by clicking this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Visit the link to find and retrieve your application form: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Retrieve your application form by visiting: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Click the link provided to find and download your application form: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Discover your application form by clicking on this link: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Find and download your application form via link visit: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Locate your application form by visiting: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Visit the link to discover your application form for download: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Retrieve your application form by clicking on the link provided: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php",
                "Visit the provided link to find and download your application form: https://buao.bicol-u.edu.ph/bucet_online/retrieve.php"
            ]
        },
        {
            "tag": "edit",
            "patterns": [
                "Could you provide instructions on how to modify the online-submitted picture?",
                "What is the correct way to edit the photo I submitted online?",
                "Can you inform me about the protocol for making changes to the online-submitted picture?",
                "How can I access and edit the picture I uploaded online?",
                "What is the proper procedure for editing the online-submitted picture?",
                "Could you explain the steps involved in editing the picture I submitted online?",
                "Is there a specific tool or feature for editing the picture after online submission?",
                "What do I need to do to edit the picture I submitted online?",
                "Can you walk me through the process to edit the online-submitted picture?",
                "How can I make sure I edit the correct version of the online-submitted picture?",
                "What's the recommended method for editing the picture after online submission?",
                "Can you provide guidance on the proper way to modify the online-submitted picture?",
                "What is the official procedure for editing the picture submitted online?",
                "How do I formally request and edit the picture I submitted online?",
                "Could you outline the steps for editing the online-submitted picture?",
                "Is there a specific link or section for editing the picture after online submission?",
                "What is the standard protocol for editing the picture submitted online?",
                "Can you tell me the steps involved in making changes to the online-submitted picture?",
                "How do I initiate the process of editing the picture I submitted online?",
                "What documentation or information do I need to provide to edit the online-submitted picture?",
                "Could you inform me of the proper channels to go through for editing the online-submitted picture?",
                "How can I officially request to edit the picture I submitted online?",
                "What's the formal way to request and edit the online-submitted picture?",
                "Can you explain the official policy for editing the picture submitted online?",
                "Is there a specific department or contact I should reach out to for editing the online-submitted picture?",
                "How do I navigate the system to edit the online-submitted picture?",
                "Can you guide me on using the online platform to edit the picture I submitted?",
                "What are the steps to follow when using the online system to modify the online-submitted picture?",
                "How can I utilize the online portal to edit the picture I submitted?",
                "Can you provide instructions on editing the online-submitted picture through the website?",
                "What options are available for me to make changes to the picture after online submission?",
                "How do I access the editing feature for the online-submitted picture?",
                "Can you explain the online process for editing the picture submitted online?",
                "What is the preferred method for modifying the picture after online submission?",
                "How do I inform the relevant authorities about my intention to edit the online-submitted picture?"
            ],
            "responses": [
                "To update your picture, simply click on the link provided: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Picture adjustments made simple: access the link here: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "If you need to update your picture, visit: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "You can change or re-upload your picture by navigating to: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Want to change or re-upload? Click here: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Need to change or re-upload? Click on this link: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Change or re-upload your picture by navigating to: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Adjust or re-upload your picture easily: click here: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Want to change or re-upload? Go to: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Need to change or re-upload? Click on this link: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Change or re-upload your picture by navigating to: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Adjust or re-upload your picture easily: click here: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Want to change or re-upload? Go to: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Need to change or re-upload? Click on this link: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Change or re-upload your picture by navigating to: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Adjust or re-upload your picture easily: click here: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Want to change or re-upload? Go to: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Need to change or re-upload? Click on this link: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Change or re-upload your picture by navigating to: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Adjust or re-upload your picture easily: click here: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Want to change or re-upload? Go to: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php",
                "Need to change or re-upload? Click on this link: https://buao.bicol-u.edu.ph/bucet_online/edit_pic.php"
            ]
        },
        {
            "tag": "deadline",
            "patterns": [
                "When is the final date for turning in all necessary documents?",
                "Could you specify the deadline for the submission of all required documents?",
                "What is the last day for submitting all the necessary documentary requirements?",
                "Can you inform me about the timeline for submitting all the required documents?",
                "When is the cutoff for the submission of all documentary requirements?",
                "Could you let me know the final date by which I need to submit all required documents?",
                "When is the last day for turning in all the documentary requirements?",
                "Can you provide details on the closing date for submitting all required documents?",
                "What is the designated deadline for the submission of all necessary documents?",
                "Could you specify the final deadline for the submission of all documentary requirements?",
                "When is the last possible date for submitting all required documents?",
                "What is the closing date for the submission of all required documents?",
                "Could you let me know the final deadline for completing all necessary documents?",
                "When is the last day for turning in all the documentary requirements?",
                "Can you provide details on the closing date for submitting all required documents?",
                "What is the specified deadline for the submission of all necessary documents?",
                "Could you specify the last date by which I need to submit all required documents?",
                "What is the final deadline for the submission of all documentary requirements?",
                "When is the closing date for turning in all necessary documents?",
                "Can you inform me about the last day for submitting all required documents?",
                "When is the last possible date for submitting all required doucments?",
                "I need to know the deadline for submitting all the necessary documentary materials.",
                "Can you tell me when all the documentary requirements must be met?",
                "When is the final day for providing all the necessary documentary details?",
                "Can you provide me with the deadline for providing all the documentary needs?",
                "When is the final day for submitting all the documentary demands?",
                "What is the last date for submitting all the documentary needs?",
                "I need to know the deadline for submitting all the documentary information."
            ],
            "responses": [
                "A week before the examination day per test center",
                "Pass it on a week before the examination day per test center",
                "A week before the examination day per test center is the deadline for submitting the requirements.", 
                "It's due is on a week before the examination day per test center",
                "The deadline is a week before the examination day per test center"
            ]
        },
        {
            "tag": "fee",
            "patterns": [
                "Can you inform me about the processing fee for the BUCET application?",
                "What is the cost of the BUCET application fee?",
                "Can you provide information on the amount for the BUCET application fee?",
                "How much do I need to pay for the BUCET application fee?",
                "Could you specify the exact fee for the BUCET application?",
                "What is the required payment for the BUCET application fee?",
                "Can you inform me about the total amount for the BUCET application fee?",
                "How much money should I prepare for the BUCET application fee?",
                "What is the fee structure for the BUCET application?",
                "Could you let me know the precise amount of the BUCET application fee?",
                "Can you provide details on the cost of the BUCET application fee?",
                "What is the specific amount that needs to be paid as the BUCET application fee?",
                "How do I find out the current BUCET application fee?",
                "What is the standard fee amount for the BUCET application?",
                "Could you specify the fee structure and payment details for the BUCET application?",
                "What is the official amount set for the BUCET application fee?",
                "Can you provide information on any additional charges associated with the BUCET application fee?",
                "How much is the non-refundable BUCET application fee?",
                "Could you let me know if there are any installment options for the BUCET application fee?",
                "How much is the BUCET application fee for candidates from economically disadvantaged backgrounds?",
                "Can you inform me about any changes in the BUCET application fee for the upcoming academic year?",
                "What is the policy regarding the BUCET application fee for transfer students?"
            ],
            "responses": [
                "The PHP 250.00 registration fee is not applicable to Filipino freshmen applicants under R.A. NO. 10931.",
                "Filipino freshmen applicants are granted a waiver for the PHP 250.00 registration fee as per R.A. NO. 10931.",
                "The PHP 250.00 registration fee is waived for Filipino freshmen applicants, as mandated by R.A. NO. 10931.",
                "Pursuant to R.A. NO. 10931, Filipino freshmen applicants are excused from paying the PHP 250.00 registration fee.",
                "Under the guidelines of R.A. NO. 10931, Filipino freshmen applicants do not have to pay the PHP 250.00 registration fee.",
                "The PHP 250.00 registration fee is waived for Filipino freshmen applicants in accordance with R.A. NO. 10931.",
                "Filipino freshmen applicants are eligible for a waiver of the PHP 250.00 registration fee as stipulated by R.A. NO. 10931.",
                "Pursuant to R.A. NO. 10931, Filipino freshmen applicants are relieved from the PHP 250.00 registration fee.",
                "Under R.A. NO. 10931, Filipino freshmen applicants are entitled to exemption from the PHP 250.00 registration fee.",
                "The PHP 250.00 registration fee is not required for Filipino freshmen applicants under R.A. NO. 10931.",
                "Pursuant to R.A. NO. 10931, Filipino freshmen applicants are granted a waiver for the PHP 250.00 registration fee.",
                "Filipino freshmen applicants are exempt from the PHP 250.00 registration fee under the provisions of R.A. NO. 10931.",
                "In accordance with R.A. NO. 10931, Filipino freshmen applicants are not charged the PHP 250.00 registration fee.",
                "Pursuant to R.A. NO. 10931, Filipino freshmen applicants are excused from the PHP 250.00 registration fee.",
                "The PHP 250.00 registration fee is waived for Filipino freshmen applicants, as per R.A. NO. 10931.",
                "Filipino freshmen applicants are relieved from paying the PHP 250.00 registration fee under the guidelines of R.A. NO. 10931.",
                "Pursuant to R.A. NO. 10931, Filipino freshmen applicants are eligible for exemption from the PHP 250.00 registration fee.",
                "Under R.A. NO. 10931, Filipino freshmen applicants do not need to pay the PHP 250.00 registration fee.",
                "The PHP 250.00 registration fee is waived for Filipino freshmen applicants as mandated by R.A. NO. 10931.",
                "Pursuant to R.A. NO. 10931, Filipino freshmen applicants are granted a waiver of the PHP 250.00 registration fee.",
                "Filipino freshmen applicants are exempted from the PHP 250.00 registration fee under R.A. NO. 10931.",
                "In compliance with R.A. NO. 10931, the PHP 250.00 registration fee is waived for Filipino freshmen applicants."
            ]
        },
        {
            "tag": "authorized personnel",
            "patterns": [
                "Is there a designated person who can handle the submission of my BUCET application documents?",
                "Are there specific guidelines on who can submit my BUCET application requirements for me?",
                "Can a family member or friend be authorized to submit my BUCET application materials?",
                "What is the protocol for designating a representative to submit my BUCET application requirements?",
                "Are there restrictions on who can physically submit my BUCET application documents?",
                "Can an agent or proxy submit my BUCET application requirements for me?",
                "Is there a formal process for delegating someone to submit my BUCET application documents?",
                "Are there limitations on who is allowed to submit my BUCET application requirements?",
                "Can I authorize a third party to submit my BUCET application materials?",
                "What documentation or authorization is required if someone else is to submit my BUCET application requirements?",
                "Is there a specific form or letter required to authorize someone to submit my BUCET application documents?",
                "Are there restrictions on who can submit my BUCET application requirements if I am unable to do so myself?",
                "What are the criteria for designating a representative to submit my BUCET application materials?",
                "Can a school official or counselor be authorized to submit my BUCET application requirements?",
                "Can a legal guardian or relative submit my BUCET application requirements on my behalf?",
                "Is there a formal process for appointing a proxy to submit my BUCET application documents?",
                "Can a sibling or family friend be designated to submit my BUCET application requirements?",
                "Are there any limitations on who can submit my BUCET application requirements if I am unavailable?",
                "What is the policy on delegating the submission of BUCET application documents to someone else?",
                "Can a school official, such as a teacher or counselor, submit my BUCET application requirements?",
                "Are there specific criteria for authorizing someone to submit my BUCET application documents?",
                "Can a classmate or peer be designated to submit my BUCET application requirements?",
                "What is the procedure for appointing a representative to submit my BUCET application documents?",
                "Are there any restrictions on who can physically submit my BUCET application requirements to the admissions office?",
                "Can a family member or legal representative submit my BUCET application materials on my behalf?",
                "Is there a specific authorization process for someone else to submit my BUCET application requirements?",
                "Can a school official or administrator submit my BUCET application requirements for me?",
                "What are the guidelines for designating someone to submit my BUCET application documents in my absence?",
                "Can a designated agent or representative submit my BUCET application requirements if I am unable to do so?"
            ],
            "responses": [
                "You have the option of having any representative submit your complete BUCET requirements.",
                "Submission of your complete BUCET requirements is allowed by any representative with proper authorization.",
                "Any representative who is duly is permitted to submit your entire BUCET requirements.",
                "You can authorize any representative to submit your complete BUCET requirements.",
                "Submission of your complete BUCET requirements is open to any authorized representative."
            ]
        },
        {
            "tag": "reapply",
            "patterns": [
                "Can I reapply if I made errors in filling out my initial application form?",
                "If I made mistakes on my application form, can I submit a new one?",
                "Is there a process for reapplying if errors were made in the initial application form?",
                "Can I submit a corrected application form after making mistakes in the first one?",
                "Is reapplying an option if I filled out my application form incorrectly?",
                "What steps should I take if I want to reapply due to errors in my application form?",
                "Can I start a new application if I mistakenly filled out the initial one?",
                "Is there a procedure for reapplying after mistakenly completing the application form?",
                "If I made errors on my application form, can I submit a revised application?",
                "Can I apply again if I filled out my application form incorrectly the first time?",
                "Is reapplying allowed if I made mistakes on my initial application form?",
                "What is the protocol for submitting a new application if errors were made in the first one?",
                "Can I correct my application by reapplying if I made mistakes?",
                "If I filled out my application form mistakenly, can I start a fresh application?",
                "Is there an option to reapply if there are errors in my initial application form?",
                "Can I rectify mistakes by reapplying with a new and correct application form?",
                "What are the procedures for submitting a new application due to errors in the initial one?",
                "If I make errors in my application form, can I reapply with the correct information?",
                "Can I start the application process again if I mistakenly filled out the form?",
                "Is reapplying an option for correcting mistakes made in the initial application form?",
                "Can I submit a new application form if there are errors in the one I initially filled out?",
                "What steps should I follow if I want to reapply due to errors in my application form?",
                "Can I correct my mistakes by reapplying with a new and accurate application form?",
                "Is there a process for reapplying if errors are discovered in the initial application form?",
                "If I filled out my application form incorrectly, can I submit a new one with the correct information?",
                "Can I start the application process if I mistakenly filled out the initial form?",
                "Is reapplying the proper procedure for correcting mistakes on the initial application form?",
                "Can I submit a revised application if I made errors on the initial form?",
                "If I mistakenly filled out my application form, what steps should I take to reapply?"
            ],
            "responses": [
                "Do not re-apply \nIf any changes are needed, please print out your application form and make adjustments with correction tape, using a blue ballpen.",
                "Do not re-apply \nIn the event of any alterations, it's recommended to print your application form and make corrections using correction tape, ensuring to use a blue ballpen.",
                "Do not re-apply \nIf you would like to make any changes, please print out your application form and edit it with correction tape, using a blue ballpen.",
                "Do not re-apply \nShould you wish to modify any information, it is advised to print your application form and adjust it with correction tape, making sure to use a blue ballpen.",
                "Do not re-apply \nIn case of any required modifications, it's recommended to print your application form and make changes with correction tape, employing a blue ballpen.",
                "Do not re-apply \nIf you need to make any changes, please print out your application form and amend it with correction tape, using a blue ballpen.",
                "Do not re-apply \nIf you would like to make changes, print out your application form and edit it with a correction tape and use a blue ballpen",
                "Do not re-apply \nShould any adjustments be necessary, kindly print your application form and make edits with correction tape, ensuring to use a blue ballpen.",
                "Do not re-apply \nIf any alterations are required, it is advised to print your application form and apply corrections with correction tape, making use of a blue ballpen.",
                "Do not re-apply \nIn the event of any changes, it's recommended to print your application form and modify it with correction tape, ensuring to use a blue ballpen.",
                "Do not re-apply \nShould you wish to make any modifications, kindly print your application form and edit it with correction tape, making sure to use a blue ballpen.",
                "Do not re-apply \nIf adjustments are required, please print out your application form and make corrections with correction tape, using a blue ballpen.",
                "Do not re-apply \nIn case of any required adjustments, it is advisable to print your application form and adjust it with correction tape, employing a blue ballpen.",
                "Do not re-apply \nIf you need to modify any details, please print out your application form and make changes with correction tape, using a blue ballpen.",
                "Do not re-apply \nShould any alterations be needed, kindly print your application form and apply corrections using correction tape, ensuring to use a blue ballpen.",
                "Do not re-apply \nIn the event that changes are required, it's recommended to print your application form and amend it with correction tape, making use of a blue ballpen.",
                "Do not re-apply \nIf any adjustments are necessary, please print out your application form and make edits with correction tape, using a blue ballpen.",
                "Do not re-apply \nShould you wish to edit any information, it is advised to print your application form and modify it with correction tape, ensuring to use a blue ballpen.",
                "Do not re-apply \nIn case any changes need to be made, kindly print your application form and adjust it with correction tape, employing a blue ballpen.",
                "Do not re-apply \nIf any modifications are necessary, please print out your application form and make corrections with correction tape, using a blue ballpen.",
                "Do not re-apply \nShould you need to make any adjustments, it's recommended to print your application form and edit it with correction tape, making sure to use a blue ballpen.",
                "Do not re-apply \nIn the event that adjustments are required, it is advisable to print your application form and make changes using correction tape, ensuring to use a blue ballpen.",
                "Do not re-apply \nIf you need to modify any details, kindly print out your application form and adjust it with correction tape, making use of a blue ballpen.",    
                "Do not re-apply \nShould any alterations be necessary, please print your application form and apply corrections using correction tape, ensuring to use a blue ballpen.",
                "Do not re-apply \nIn case of any changes, it's recommended to print your application form and amend it with correction tape, using a blue ballpen.",
                "Do not re-apply \nIf any adjustments are needed, please print out your application form and make edits with correction tape, making use of a blue ballpen.",
                "Do not re-apply \nShould you wish to modify any information, kindly print your application form and edit it with correction tape, ensuring to use a blue ballpen.",
                "Do not re-apply \nIn case any alterations need to be made, it is advised to print your application form and adjust it with correction tape, employing a blue ballpen.",
                "Do not re-apply \nIf any modifications are required, please print out your application form and make corrections with correction tape, using a blue ballpen.",
                "Do not re-apply \nShould you need to make any changes, it's recommended to print your application form and amend it with correction tape, making sure to use a blue ballpen."
            ]
        },
        {
            "tag": "correcting",
            "patterns": [
                "Can you guide me on the process of correcting mistakes in my improperly filled-out application form?",
                "How do I go about fixing errors in an application form that was inaccurately completed?",
                "What is the proper procedure for correcting a mistakenly filled application form?",
                "Could you provide instructions on how to amend an application form that was completed incorrectly?",
                "What measures can I take to correct a wrongly filled application form?",
                "Is there a specific protocol for rectifying errors in an incorrectly completed application form?",
                "How can I access and correct information in an application form that was wrongly filled?",
                "What documentation or information do I need to provide to correct a wrongly completed application form?",
                "Can you walk me through the steps to correct a mistakenly filled application form?",
                "What's the recommended method for fixing errors in an application form that was inaccurately filled?",
                "Can you provide guidance on the proper way to amend a wrongly completed application form?",
                "Is there a formal process for correcting an application form that was filled out incorrectly?",
                "How do I initiate the process of correcting a wrongly completed application form?",
                "Could you inform me about the timeline and requirements for correcting errors in my application form?",
                "What is the official procedure for correcting mistakes in an application form that was inaccurately filled?",
                "Can you explain the official policy for amending an application form that was filled out incorrectly?",
                "Is there a specific department or contact I should reach out to for correcting a wrongly completed application form?",
                "How do I formally request to correct information in an application form that was filled out incorrectly?",
                "Can you specify the deadline for correcting errors in an application form that was wrongly completed?",
                "What are the consequences of submitting an application form with incorrect information, and how can I rectify it?",
                "How soon can I expect a confirmation after submitting a request to correct a wrongly completed application form?",
                "Can you provide information on any fees associated with correcting errors in an application form?",
                "Is there an online platform or system where I can digitally correct a wrongly filled application form?",
                "How do I confirm that the corrections I made to my application form have been successfully processed?",
                "Can you inform me about the appeal process in case my request to correct a wrongly completed application form is denied?",
                "Are there specific hours or days when corrections to a wrongly filled application form can be processed?",
                "How does the correction process for an incorrectly filled application form differ for international applicants?",
                "Can you guide me on the steps to follow if I realize errors in my application form after submission?",
                "What additional documentation may be required to support the correction of errors in my wrongly completed application form?"
            ],
            "responses": [
                "To correct, follow the procedure below.\n 1. Print your application form. Use legal size (8.5X 13) bond paper for printing the form.\n 2. To remove errors, use correction tape. Write neatly the correct using a blue ballpen.\n 3. Add your initials or signature next to the updated information.\n Note: Do not use pdf editor",
                "To fix the application form, follow the procedure below.\n 1. Print your application form. Use legal size (8.5X 13) bond paper for printing the form.\n 2. To remove errors, use correction tape. Write neatly the correct using a blue ballpen.\n 3. Add your initials or signature next to the updated information.\n Note: Do not use pdf editor",
                "For the correction, follow the procedure below.\n 1. Print your application form. Use legal size (8.5X 13) bond paper for printing the form.\n 2. To remove errors, use correction tape. Write neatly the correct using a blue ballpen.\n 3. Add your initials or signature next to the updated information.\n Note: Do not use pdf editor"
            ]
        },
        {
            "tag": "submit",
            "patterns": [
                "Where can I find detailed information on the submission process for my BUCET application requirements?",
                "What are the steps for submitting my BUCET application requirements?",
                "Can you guide me on the process of submitting my BUCET application documents?",
                "How should I go about sending in my BUCET application requirements?",
                "What is the recommended method for submitting my BUCET application documents?",
                "Could you explain the procedure for turning in my BUCET application requirements?",
                "Is there a specific portal or platform for submitting my BUCET application documents?",
                "Can you provide instructions on the proper way to submit my BUCET application requirements?",
                "What documentation do I need to prepare before submitting my BUCET application?",
                "How do I initiate the submission of my BUCET application requirements?",
                "Are there any specific formats or guidelines for submitting my BUCET application documents?",
                "Can you inform me about the deadline for submitting my BUCET application requirements?",
                "What is the official protocol for the submission of BUCET application documents?",
                "Are there any specific locations where I can drop off my BUCET application requirements?",
                "Can you guide me on using the online platform for submitting my BUCET application documents?",
                "What options are available for mailing or couriering my BUCET application documents?",
                "Are there any specific labels or identifiers needed when submitting my BUCET application requirements?",
                "Can you provide information on any additional steps required after submitting my BUCET application documents?",
                "What documents are mandatory for submission with my BUCET application?",
                "Can you specify the address for mailing or dropping off my BUCET application documents?",
                "What is the recommended timeframe for submitting my BUCET application requirements?",
                "Are there any specific formats or file types preferred for electronic submission of my BUCET application documents?",
                "How do I handle the submission of confidential or sealed documents for my BUCET application?",
                "Can you guide me on any additional steps required for submitting BUCET application requirements during the pandemic?"
            ],
            "responses": [
                "You can choose any on the options below\n Option 1: Submit your BUCET application requirements to your High School Counselor or to any authorized school representative.\n Option 2: Submit your BUCET application requirements to the Bicol University Admissions Office (ONSITE) during your appointed submissions date.\n Option 3: Mail your BUCET application documents through any courier service available in your locality",
                "Choose what's more convenient to you\n Option 1: Submit your BUCET application requirements to your High School Counselor or to any authorized school representative.\n Option 2: Submit your BUCET application requirements to the Bicol University Admissions Office (ONSITE) during your appointed submissions date.\n Option 3: Mail your BUCET application documents through any courier service available in your locality",
                "Here's the option you can make\n Option 1: Submit your BUCET application requirements to your High School Counselor or to any authorized school representative.\n Option 2: Submit your BUCET application requirements to the Bicol University Admissions Office (ONSITE) during your appointed submissions date.\n Option 3: Mail your BUCET application documents through any courier service available in your locality",
                "Here's the list you can do\n Option 1: Submit your BUCET application requirements to your High School Counselor or to any authorized school representative.\n Option 2: Submit your BUCET application requirements to the Bicol University Admissions Office (ONSITE) during your appointed submissions date.\n Option 3: Mail your BUCET application documents through any courier service available in your locality",
                "To submit, you can choose what's the best for you\n Option 1: Submit your BUCET application requirements to your High School Counselor or to any authorized school representative.\n Option 2: Submit your BUCET application requirements to the Bicol University Admissions Office (ONSITE) during your appointed submissions date.\n Option 3: Mail your BUCET application documents through any courier service available in your locality"
            ]
        },
        {
            "tag": "claim",
            "patterns": [
                "Can you guide me on how to retrieve and claim my BUCET test permit?",
                "How can I go about obtaining and claiming my BUCET test permit?",
                "What steps do I need to follow to claim my BUCET test permit?",
                "Could you provide instructions on how to secure and claim my BUCET test permit?",
                "What is the correct way to claim my BUCET test permit?",
                "Can you inform me about the protocol for claiming the BUCET test permit?",
                "How do I access and claim my BUCET test permit online?",
                "What is the proper procedure for claiming my BUCET test permit?",
                "Could you explain the steps involved in claiming my BUCET test permit?",
                "Is there a specific website or platform for claiming the BUCET test permit?",
                "What do I need to do to claim my BUCET test permit?",
                "Can you walk me through the process to claim my BUCET test permit?",
                "What's the recommended method for claiming my BUCET test permit?",
                "Can you provide guidance on the proper way to claim the BUCET test permit?",
                "What is the official procedure for claiming the BUCET test permit?",
                "How do I formally request and claim my BUCET test permit?",
                "Could you outline the steps for claiming the BUCET test permit?",
                "Is there a specific link or section for claiming the BUCET test permit?",
                "What is the standard protocol for claiming the BUCET test permit?",
                "Can you tell me the steps involved in claiming the BUCET test permit?",
                "How do I initiate the process of claiming my BUCET test permit?",
                "What documentation or information do I need to provide to claim the BUCET test permit?",
                "Could you inform me of the proper channels to go through for claiming my BUCET test permit?",
                "How can I officially request to claim my BUCET test permit?",
                "What's the formal way to request and claim the BUCET test permit?",
                "Can you explain the official policy for claiming the BUCET test permit?",
                "Is there a specific department or contact I should reach out to for claiming my BUCET test permit?",
                "How do I navigate the system to claim my BUCET test permit?"
            ],
            "responses": [
                "You can choose any on the options below\n Option 1:   Claim your test permit from your High School Counselor or authorized school representative.\n Option 2: BU Admissions office (Onsite during appointment date)\n Option 3:  Your temporary test permit will be emailed to you at your official email address indicated in the form.",
                "Choose what's more convenient to you\n Option 1:   Claim your test permit from your High School Counselor or authorized school representative.\n Option 2: BU Admissions office (Onsite during appointment date)\n Option 3:  Your temporary test permit will be emailed to you at your official email address indicated in the form.",
                "Here's the ways you can do\n Option 1:   Claim your test permit from your High School Counselor or authorized school representative.\n Option 2: BU Admissions office (Onsite during appointment date)\n Option 3:  Your temporary test permit will be emailed to you at your official email address indicated in the form.",
                "Here's the list you can choose\n Option 1:   Claim your test permit from your High School Counselor or authorized school representative.\n Option 2: BU Admissions office (Onsite during appointment date)\n Option 3:  Your temporary test permit will be emailed to you at your official email address indicated in the form.",
                "To claim, you have three optionsyou can choose what's the best for you\n Option 1:   Claim your test permit from your High School Counselor or authorized school representative.\n Option 2: BU Admissions office (Onsite during appointment date)\n Option 3:  Your temporary test permit will be emailed to you at your official email address indicated in the form."
            ]
        },
        {
            "tag": "appointment",
            "patterns": [
                "What is the protocol regarding my appointment date if I opt for either option 1 or option 3?",
                "Should I maintain my original appointment date if I choose either option 1 or option 3?",
                "Do I need to follow through with my scheduled appointment date when selecting option 1 or option 3?",
                "Is it necessary to adhere to the initially provided appointment date if I go with option 1 or option 3?",
                "What is the recommendation regarding my appointment date if I decide on option 1 or option 3?",
                "Should I stick to my original appointment date if I pick either option 1 or option 3?",
                "How does choosing option 1 or option 3 affect my obligation to the initial appointment date?",
                "If I opt for either option 1 or option 3, does that mean I have to keep my first appointment date?",
                "Does choosing option 1 or option 3 alter my commitment to the initially assigned appointment date?",
                "What is the guidance regarding the appointment date if I select either option 1 or option 3?",
                "Should I reconsider my initially scheduled appointment date if I go with option 1 or option 3?",
                "Does either option 1 or option 3 influence the requirement to follow the original appointment date?",
                "What implications does choosing option 1 or option 3 have on my adherence to the scheduled appointment date?",
                "If I choose option 1 or option 3, do I still need to honor my first appointment date?",
                "How does my decision between option 1 or option 3 impact the adherence to the initial appointment date?",
                "Should I adjust my plans for the initially scheduled appointment date if I choose either option 1 or option 3?",
                "Does the choice between option 1 or option 3 necessitate a change in my originally assigned appointment date?",
                "If I go with either option 1 or option 3, do I need to reschedule my initially set appointment date?",
                "Should I consider altering my originally assigned appointment date if I select either option 1 or option 3?",
                "How does the decision between option 1 or option 3 affect my commitment to the initially scheduled appointment date?",
                "Should I keep my original appointment date if I choose either option 1 or option 3?",
                "Does selecting either option 1 or option 3 imply a modification of my initially assigned appointment date?",
                "How does the choice between option 1 or option 3 impact my obligation to the scheduled appointment date?",
                "Should I reconsider the timing of my initial appointment date if I go with either option 1 or option 3?",
                "Does choosing either option 1 or option 3 require me to adhere to the initially provided appointment date?",
                "If I select option 1 or option 3, is it advisable to stick to my originally scheduled appointment date?",
                "How does the decision between option 1 or option 3 influence my commitment to the initially assigned appointment date?",
                "Should I maintain my initially scheduled appointment date if I opt for either option 1 or option 3?"
            ],
            "responses": [
                "No need, But make sure to verify that your application requirements have been submitted to the admissions office before the scheduled deadline for the test center.",
                "No need, But ensure that your application requirements have been received and processed by the admissions office before the scheduled deadline for the test center.",
                "No need, But confirm with certainty that your application requirements have reached the admissions office before the scheduled deadline for the test center.",
                "No need, But ensure that your application requirements have been successfully delivered to the admissions office before the scheduled deadline for the test center.",
                "No need, But double-check and ensure that your application requirements have reached the admissions office before the scheduled deadline for the test center.",
                "No need, But it is crucial to ensure that your application requirements have been received and acknowledged by the admissions office before the scheduled deadline for the test center.",
                "No need, But verify that your application requirements have been acknowledged and recorded by the admissions office before the scheduled deadline for the test center.",
                "No need, But check to ensure that your application requirements have been duly received and processed by the admissions office before the scheduled deadline for the test center.",
                "No need, But it is essential to verify that your application requirements have been duly acknowledged and processed by the admissions office before the scheduled deadline for the test center.",
                "No need, But confirm that your application requirements have been properly received and documented by the admissions office before the scheduled deadline for the test center.",
                "No need, But ensure with certainty that your application requirements have been duly received and documented by the admissions office before the scheduled deadline for the test center.",
                "No need, But make sure to confirm that your application requirements have been properly received and accounted for by the admissions office before the scheduled deadline for the test center.",
                "No need, But double-check to ensure that your application requirements have been properly received and accounted for by the admissions office before the scheduled deadline for the test center.",
                "No need, But it is crucial to double-check and confirm that your application requirements have been properly received and documented by the admissions office before the scheduled deadline for the test center.",
                "No need, But ensure that your application requirements have been properly received and recorded by the admissions office before the scheduled deadline for the test center.",
                "No need, But verify with certainty that your application requirements have been properly received and recorded by the admissions office before the scheduled deadline for the test center.",
                "No need, But make sure to double-check and confirm that your application requirements have been properly received and processed by the admissions office before the scheduled deadline for the test center.",
                "No need, But it is essential to verify with certainty that your application requirements have been properly received and processed by the admissions office before the scheduled deadline for the test center.",
                "No need, But confirm that your application requirements have been properly received and acknowledged by the admissions office before the scheduled deadline for the test center.",
                "No need, But ensure with certainty that your application requirements have been properly received and acknowledged by the admissions office before the scheduled deadline for the test center.",
                "No need, But make sure to verify that your application requirements have been properly received and acknowledged by the admissions office before the scheduled deadline for the test center.",
                "No need, But double-check and confirm that your application requirements have been properly received and acknowledged by the admissions office before the scheduled deadline for the test center.",
                "No need, But it is crucial to ensure that your application requirements have been properly received and acknowledged by the admissions office before the scheduled deadline for the test center.",
                "No need, But verify that your application requirements have been properly received and processed by the admissions office before the scheduled deadline for the test center.",
                "No need, But ensure with certainty that your application requirements have been properly received and processed by the admissions office before the scheduled deadline for the test center.",
                "No need, But make sure to double-check and confirm that your application requirements have been properly received and processed by the admissions office before the scheduled deadline for the test center.",
                "No need, But it is essential to verify with certainty that your application requirements have been properly received and processed by the admissions office before the scheduled deadline for the test center.",
                "No need, But confirm that your application requirements have been properly received and documented by the admissions office before the scheduled deadline for the test center."
            ]
        },
        {
            "tag": "follow",
            "patterns": [
                "Is there a recommended course of action if my appointment date extends beyond the test center's scheduled deadline?",
                "Should I still follow my appointment date even if it surpasses the test center's deadline?",
                "What steps can I take if my appointment date is already past the scheduled deadline for the test center?",
                "Is it acceptable to keep my appointment date even if it is beyond the test center's designated deadline?",
                "What is the protocol for individuals whose appointment date has exceeded the test center's deadline?",
                "How should I proceed if my appointment date is after the specified deadline for the test center?",
                "Should I reschedule my appointment if it falls beyond the scheduled deadline for the test center?",
                "Is there flexibility for individuals whose appointment dates extend beyond the test center's deadline?",
                "What options do I have if my appointment date is already beyond the test center's scheduled deadline?",
                "Is it mandatory to reschedule my appointment if it surpasses the test center's deadline?",
                "How does the test center handle appointment dates that go beyond the scheduled deadline?",
                "Should I contact the test center if my appointment date is after their designated deadline?",
                "What consequences might arise if I choose to follow my appointment date beyond the test center's deadline?",
                "Is there a grace period for individuals with appointment dates that exceed the test center's deadline?",
                "Should I expect any issues if I stick to my appointment date after the test center's deadline?",
                "How does the test center manage cases where appointment dates extend beyond the deadline?",
                "Should I seek assistance from the test center if my appointment date falls after their deadline?",
                "What is the recommended action for individuals with appointment dates that surpass the test center's deadline?",
                "Should I be concerned about following my appointment date if it's already beyond the test center's deadline?",
                "How can I address the situation if my appointment date exceeds the test center's scheduled deadline?",
                "Is there a procedure in place for individuals whose appointment dates fall after the test center's deadline?",
                "Should I consider rescheduling my appointment if it extends beyond the test center's designated deadline?",
                "What guidance does the test center provide for individuals with appointment dates that surpass their deadline?",
                "Should I notify the test center if my appointment date is already past their scheduled deadline?",
                "Is there a process for individuals with appointment dates that go beyond the test center's deadline?",
                "Should I anticipate any complications if I adhere to my appointment date beyond the test center's deadline?",
                "How does the test center handle situations where appointment dates are after their deadline?",
                "Should I contact the test center's support for guidance if my appointment date falls beyond their deadline?"
            ],
            "responses": [
                "No need, But ensure with certainty that your application requirements have been properly received and documented by the admissions office before the scheduled deadline for the test center.",
                "No need, But double-check that your application requirements reach the admissions office before the test center's deadline.",
                "No need, But confirm that your application materials have been delivered to the admissions office prior to the test center's deadline.",
                "No need, But guarantee your application requirements are in the possession of the admissions office before the test center's deadline.",
                "No need, But assure that your application documents are in the hands of the admissions office prior to the test center's deadline.",
                "No need, But be sure your application requirements have reached the admissions office prior to the test center's deadline.",
                "No need, But ensure the admissions office has received your application materials before the test center's deadline.",
                "No need, But validate that your application requirements have been submitted to the admissions office before the test center's deadline.",
                "No need, But confirm your application materials have been delivered to the admissions office before the test center's deadline.",
                "No need, But make sure your application requirements are received by the admissions office prior to the test center's deadline.",
                "No need, But guarantee your application documents are in the possession of the admissions office before the test center's deadline.",
                "No need, But double-check your application materials are submitted to the admissions office before the test center's deadline.",
                "No need, But verify your application requirements have reached the admissions office prior to the test center's deadline.",
                "No need, But ensure your application documents are in the hands of the admissions office before the test center's deadline.",
                "No need, But confirm your application materials have been delivered to the admissions office before the test center's deadline.",
                "No need, But assure your application requirements have been received by the admissions office before the test center's deadline.",
                "No need, But make certain the admissions office has received your application materials before the test center's deadline.",
                "No need, But guarantee that your application requirements have reached the admissions office before the test center's deadline.",
                "No need, But be sure your application documents are submitted to the admissions office before the test center's deadline.",
                "No need, But validate your application requirements are in the possession of the admissions office before the test center's deadline.",
                "No need, But confirm that your application materials have been received by the admissions office before the test center's deadline.",
                "No need, But ensure your application requirements have been delivered to the admissions office before the test center's deadline.",
                "No need, But double-check your application materials have reached the admissions office before the test center's deadline.",
                "No need, But verify that your application documents are submitted to the admissions office before the test center's deadline.",
                "No need, But guarantee your application requirements are in the hands of the admissions office before the test center's deadline.",
                "No need, But assure your application materials have been received by the admissions office before the test center's deadline.",
                "No need, But make certain your application requirements have been delivered to the admissions office before the test center's deadline.",
                "No need, But be sure the admissions office has received your application materials before the test center's deadline.",
                "No need, But confirm your application requirements are submitted to the admissions office before the test center's deadline."
            ]
        },
        {
            "tag": "address",
            "patterns": [
                "Could you provide me with the street address of the BU admissions office?",
                "What is the location address of the BU admissions office?",
                "Do you have the specific address for the BU admissions office?",
                "Where should I go to visit the BU admissions office, and what is the address?",
                "Can you share the official mailing address for the BU admissions office?",
                "What is the exact street address of the BU admissions office?",
                "Where is the BU admissions office situated, and what is its address?",
                "Could you direct me to the BU admissions office and provide the address?",
                "What is the physical location and address of the BU admissions office?",
                "Can you provide details on the address of the BU admissions office for in-person inquiries?",
                "Where can I find the official address of the BU admissions office online?",
                "Could you share the address for sending documents to the BU admissions office?",
                "What is the street and mailing address for the BU admissions office?",
                "Where should I direct mail or correspondence for the BU admissions office, and what is the address?",
                "Can you provide the official address for contacting the BU admissions office?",
                "What is the address for scheduling an appointment at the BU admissions office?",
                "Where is the BU admissions office located, and what is its address for visitors?",
                "Could you share the precise address of the BU admissions office for navigation purposes?",
                "What is the address I should use when sending any communication to the BU admissions office?",
                "Where can I locate the BU admissions office, and what is its specific address?",
                "Can you provide me with the exact physical address of the BU admissions office for GPS navigation?",
                "What is the mailing address for official documents to be sent to the BU admissions office?",
                "Where should I send my application materials, and what is the address of the BU admissions office?",
                "Could you direct me to the BU admissions office and provide the address for reference?",
                "What is the street address for the BU admissions office, and where is it situated on campus?",
                "Where can I find the contact information, including the address, for the BU admissions office?",
                "What is the specific address for the BU admissions office, and how can I reach it?",
                "Can you provide the physical address for the BU admissions office for any in-person visits?",
                "Where is the BU admissions office located, and what is the official street address?"
            ],
            "responses": [
                "BU Admission office is located on Bicol University-Main Campus Gate 4, Ground Admissions Office Legazpi City, Albay, 4500",
                "The address of the BU Admission Office is in Bicol University-Main Campus Gate 4, Ground Admissions Office Legazpi City, Albay, 4500",
                "Bicol University-Main Campus Gate 4, Ground Admissions Office Legazpi City, Albay, 4500"
            ]
        },
        {
            "tag": "format",
            "patterns": [
                "Can you clarify the correct picture format for the required submission?",
                "I'm unsure about the acceptable picture format, could you provide guidance?",
                "Could you inform me of the standard picture format that is acceptable?",
                "What is the prescribed image format for the submission in question?",
                "Is there a specific file type that is considered the correct picture format?",
                "Can you outline the preferred picture format for the intended purpose?",
                "I would appreciate clarification on the correct picture format for this requirement."
            ],
            "responses": [
                "The format must be:\n Recent 2x2\n Unedited or Unfiltere4d studio-taken\n In white background\n With Signature\n With name tag",
                "Format of the picture must be:\n Recent 2x2\n Unedited or Unfiltere4d studio-taken\n In white background\n With Signature\n With name tag"
            ]
        },
        {
            "tag": "mailing stamp",
            "patterns": [
                "What locations offer mailing stamps for sale?",
                "At which stores or outlets can I buy postage stamps?",
                "Where is the nearest place to buy mailing stamps?",
                "What are the options for obtaining postage stamps for mailing?",
                "In which establishments can I find and purchase mailing stamps?",
                "Where do I go to get postage stamps for sending mail?",",",
                "What stores or vendors sell postage stamps for mailing purposes?",
                "At which post offices or postal outlets can I buy mailing stamps?",
                "Where should I visit to purchase stamps for mailing?",
                "What nearby locations provide mailing stamps for sale?",
                "In which sections of the city can I find places selling postage stamps?",
                "Where do I need to go to buy stamps for sending letters?",
                "What specific stores in town sell mailing stamps?",
                "Where can I find a reliable source to buy postage stamps?",
                "Which local businesses or retailers offer postage stamps for sale?",
                "Where do I need to visit within the mall to purchase mailing stamps?",
                "Where in the neighborhood can I go to purchase stamps for mailing?",
                "What are the designated areas in the post office for buying mailing stamps?",
                "Where do I locate stamp vending machines for purchasing postage stamps?",
                "What are the available options for buying mailing stamps in my area?",
                "Where can I buy postage stamps during weekends or after regular business hours?",
                "What convenience stores or gas stations sell postage stamps?",
                "In which sections of the supermarket can I find and purchase postage stamps?",
                "Where do I inquire about purchasing bulk postage stamps for business purposes?",
                "What's the best place to buy international mailing stamps?",
                "Where can I find the most affordable options for buying mailing stamps?",
                "What are the operating hours of the post office where I can buy mailing stamps?",
                "Where do I go in the city center to purchase stamps for mailing purposes?"
            ],
            "responses": [
                "Attain your postage stamp at the post office",
                "Get your postage stamp from the post office",
                "Obtain your mailing stamp from the post office",
                "Secure your mailing stamp at the post office",
                "Collect your mailing stamp at the post office",
                "Gather your mailing stamp from the post office",
                "Obtain your postage stamp conveniently from the post office",
                "Secure your postage stamp easily at the post office",
                "Collect your postage stamp swiftly at the post office"
                
            ]
        },
        {
            "tag": "exceed",
            "patterns": [
                "What is the maximum acceptable value for the mailing stamp in Philippine pesos?",
                "Are there any restrictions on the mailing stamp amount, and is exceeding Php 50.00 acceptable?",
                "Is it permissible to use a mailing stamp with a value greater than Php 50.00?",
                "What is the approved limit for the mailing stamp cost, and can it be more than Php 50.00?",
                " Are there any consequences if the mailing stamp used exceeds the value of Php 50.00?",
                "Can we use a mailing stamp that costs more than Php 50.00, or is it against the guidelines?",
                "Is there flexibility regarding the mailing stamp value, and can it be higher than Php 50.00?",
                "What are the regulations concerning the mailing stamp amount, and is it acceptable to exceed Php 50.00?",
                "Could you clarify if there's a specific limit on the mailing stamp cost, especially in relation to Php 50.00?",
                "Is there any provision for using a mailing stamp worth more than Php 50.00 in your guidelines?",
                "Are there any implications if we choose a mailing stamp that surpasses the Php 50.00 limit?",
                "Can you provide information on whether the mailing stamp value is flexible and can exceed Php 50.00?",
                "What is the official stance on using a mailing stamp with a value greater than Php 50.00?",
                "Is it within the rules to have a mailing stamp costing more than Php 50.00, or are there restrictions?",
                "Could you elaborate on the mailing stamp regulations, specifically regarding values beyond Php 50.00?",
                "Is there a penalty or issue associated with using a mailing stamp that exceeds Php 50.00 in value?",
                "What considerations should be taken into account when deciding on a mailing stamp value exceeding Php 50.00?",
                "Can you clarify the mailing stamp policy and whether it permits values higher than Php 50.00?",
                "Are there any exceptions or allowances for using a mailing stamp worth more than Php 50.00?",
                "What are the consequences if we mistakenly use a mailing stamp with a value exceeding Php 50.00?",
                "Is there a process for obtaining approval to use a mailing stamp valued above Php 50.00?",
                "Can you provide guidance on the proper procedure if the mailing stamp needed exceeds Php 50.00?",
                "Are there any specific scenarios where using a mailing stamp exceeding Php 50.00 is allowed?",
                "Is there a review process or waiver for situations where using a mailing stamp over Php 50.00 is necessary?",
                "Could you explain the rationale behind the Php 50.00 limit for mailing stamps and any potential exceptions?",
                "Are there any upcoming changes to the mailing stamp policy that might affect the Php 50.00 limit?",
                "Can you confirm if the Php 50.00 limit for mailing stamps is a strict requirement or subject to change?",
                "What is the procedure for seeking approval to use a mailing stamp valued higher than Php 50.00?"
            ],
            "responses": [
                "The mailing stamp's cost could exceed Php. 50, but it won't be below Php. 50.00.",
                "The price of the mailing stamp may be higher than Php. 50, but it will not be less than Php. 50.00.",
                "The mailing stamp might cost more than Php. 50, but it won't be below Php. 50.00.",
                "The cost of the mailing stamp could exceed Php. 50, but it won't be lower than Php. 50.00.",
                "The price of the mailing stamp may surpass Php. 50, but it won't fall under Php. 50.00.",
                "The mailing stamp might be more than Php. 50, but it won't be less than Php. 50.00."
            ]
        },
        {
            "tag": "paste",
            "patterns": [
                "How should I properly paste the Php 50.00 mailing stamp on the envelope?",
                "Can you guide me on the appropriate way to attach the Php 50.00 mailing stamp?",
                "What are the steps to follow when pasting the Php 50.00 mailing stamp?",
                "Could you provide instructions on the precise placement of the Php 50.00 mailing stamp?",
                "What is the recommended technique for adhering the Php 50.00 mailing stamp to the envelope?",
                "How do I ensure the secure and proper attachment of the Php 50.00 mailing stamp?",
                "Can you explain the correct orientation for pasting the Php 50.00 mailing stamp?",
                "What adhesive should I use when affixing the Php 50.00 mailing stamp to the envelope?",
                "How can I avoid common mistakes when pasting the Php 50.00 mailing stamp?",
                "Is there a specific area on the envelope where I should paste the Php 50.00 mailing stamp?",
                "What considerations should I keep in mind while pasting the Php 50.00 mailing stamp?",
                "Can you demonstrate the proper technique for pasting the Php 50.00 mailing stamp?",
                "Are there any guidelines or regulations for pasting the Php 50.00 mailing stamp?",
                "How do I handle the Php 50.00 mailing stamp to ensure it stays securely attached?",
                "Can you provide tips on preventing the Php 50.00 mailing stamp from peeling off?",
                "What precautions should I take to avoid damaging the Php 50.00 mailing stamp during the pasting process?",
                "Is there a specific timeframe within which I should paste the Php 50.00 mailing stamp before sending the mail?",
                "How do I handle the Php 50.00 mailing stamp to prevent it from getting damaged or torn?",
                "Can you recommend the best practices for pasting the Php 50.00 mailing stamp on different types of envelopes?",
                "What is the significance of the placement of the Php 50.00 mailing stamp on the envelope?",
                "How can I make sure that the Php 50.00 mailing stamp is securely attached and won't fall off during transit?",
                "Are there any specific requirements or regulations for pasting the Php 50.00 mailing stamp on official documents?",
                "Can you provide guidance on the angle and alignment when pasting the Php 50.00 mailing stamp?",
                "What steps should I take if the Php 50.00 mailing stamp is not sticking properly to the envelope?",
                "Is there a recommended distance from the edge of the envelope for pasting the Php 50.00 mailing stamp?",
                "How do I handle the Php 50.00 mailing stamp to avoid smudging or damage during the pasting process?",
                "Can you advise on the proper storage conditions for the Php 50.00 mailing stamp before pasting it?",
                "What should I do if I accidentally place the Php 50.00 mailing stamp in the wrong position on the envelope?",
                "How can I verify that the Php 50.00 mailing stamp is affixed securely and meets postal requirements?"
            ],
            "responses": [
                " Affix it onto the upper right corner of the long-sized window mailing envelope.",
                "Place it firmly on the upper-right corner of the long-sized window mailing envelope.",
                "Stick it securely to the upper right-hand corner of the long-sized window mailing envelope.",
                "Adhere it firmly to the top right corner of the long-sized window mailing envelope.",
                "Position it securely at the upper right corner of the long-sized window mailing envelope.",
                "Attach it securely to the upper right-hand corner of the long-sized window mailing envelope.",
                "Affix it firmly to the top right-hand corner of the long-sized window mailing envelope.",
                "Place it securely in the upper right corner of the long-sized window mailing envelope.",
                "Stick it firmly in the upper-right corner of the long-sized window mailing envelope.",
                "Adhere it securely in the upper right-hand corner of the long-sized window mailing envelope.",
                "Position it firmly at the top right corner of the long-sized window mailing envelope.",
                "Attach it securely at the upper right corner of the long-sized window mailing envelope.",
                "Affix it securely onto the upper right corner of the long-sized window mailing envelope.",
                "Place it securely on the upper-right corner of the long-sized window mailing envelope.",
                "Stick it firmly to the upper right-hand corner of the long-sized window mailing envelope.",
                "Adhere it securely to the top right corner of the long-sized window mailing envelope.",
                "Position it firmly in the upper right-hand corner of the long-sized window mailing envelope.",
                "Attach it securely to the top right corner of the long-sized window mailing envelope.",
                "Affix it securely in the upper-right corner of the long-sized window mailing envelope.",
                "Place it securely onto the upper right corner of the long-sized window mailing envelope.",
                "Stick it firmly in the upper right-hand corner of the long-sized window mailing envelope.",
                "Adhere it securely at the top right corner of the long-sized window mailing envelope.",
                "Position it firmly on the upper right corner of the long-sized window mailing envelope.",
                "Attach it securely at the upper right-hand corner of the long-sized window mailing envelope.",
                "Affix it securely to the top right-hand corner of the long-sized window mailing envelope.",
                "Place it securely in the upper-right corner of the long-sized window mailing envelope.",
                "Stick it firmly onto the upper right corner of the long-sized window mailing envelope.",
                "Adhere it securely to the upper right-hand corner of the long-sized window mailing envelope.",
                "Position it firmly at the top right-hand corner of the long-sized window mailing envelope."
            ]
        },
        {
            "tag": "ofw",
            "patterns": [
                "In the case of my parent being an overseas Filipino worker (OFW), what specific documents should I submit?",
                "How does the submission process differ when parents are overseas Filipino workers (OFWs)?",
                "Are there additional forms or paperwork needed if my parents are working abroad as OFWs?",
                "What proof or verification is needed if my parent is an overseas Filipino worker (OFW)?",
                "Do I need to provide any special documents if my parent is employed as an overseas Filipino worker (OFW)?",
                "Is there a specific set of requirements for applicants with parents who are overseas Filipino workers (OFWs)?",
                "How do I navigate the application process if my parent is an overseas Filipino worker (OFW)?",
                "Are there supplementary materials or documents needed for applicants with OFW parents?",
                "What additional information is necessary for applicants with parents currently working overseas as OFWs?",
                "Could you outline the specific steps or documents required for applicants with OFW parents?",
                "In the context of having an OFW parent, what specific paperwork should be included in my submission?",
                "Are there any unique requirements or considerations for applicants with parents who are overseas Filipino workers (OFWs)?",
                "How should I handle the application process if one or both of my parents are overseas Filipino workers (OFWs)?",
                "What supporting documents must I include if my parent is an overseas Filipino worker (OFW)?",
                "Do I need to provide extra information or documentation if my parents are OFWs?",
                "What specific details or proofs should I include in my application if my parent is currently working abroad as an OFW?",
                "How does the application process differ for individuals with parents employed as overseas Filipino workers (OFWs)?",
                "Are there any exemptions or special provisions for applicants with parents who are OFWs?",
                "What is the protocol for submitting required documents if my parent is an overseas Filipino worker (OFW)?",
                "Are there any specific forms or paperwork designed for applicants with OFW parents?",
                "How should I address the application process considering my parent is an overseas Filipino worker (OFW)?",
                "Are there additional steps or requirements for individuals with at least one parent working abroad as an OFW?",
                "What would be the necessary documents for proof if my parent is an overseas Filipino worker (OFW)?",
                "Do I need to provide any specific information regarding my parent's overseas employment in my application?",
                "How does the application process take into account the overseas employment status of one or both parents as OFWs?",
                "Are there any considerations for applicants with parents working abroad, particularly as OFWs?",
                "What documents are essential to submit if my parent is an overseas Filipino worker (OFW)?",
                "How should I complete my application if my parents are both overseas Filipino workers (OFWs)?",
                "Are there any specific guidelines or requirements for applicants with parents who are currently working overseas as OFWs?"
            ],
            "responses": [
                "Your parents' certificate of contract is required for processing.",
                "Make sure to submit your parents' certificate of contract.",
                "Please ensure the certificate of contract from your parents is submitted.",
                "Don't forget to submit the certificate of contract from your parents.",
                "Kindly provide the certificate of contract signed by your parents.",
                "Your parents' certificate of contract must be submitted.",
                "Please submit the required certificate of contract from your parents.",
                "Ensure your parents' certificate of contract is included in your submission.",
                "We need the certificate of contract from your parents for processing.",
                "Don't forget to include your parents' certificate of contract.",
                "Your parents' certificate of contract is necessary for your application.",
                "Please ensure your parents' certificate of contract is submitted.",
                "Submit the certificate of contract from your parents, please.",
                "It's essential to include your parents' certificate of contract.",
                "Your parents' certificate of contract is a required document.",
                "Make sure your parents' certificate of contract is included in your submission.",
                "Please submit your parents' signed certificate of contract.",
                "Don't forget to include the certificate of contract from your parents.",
                "Kindly ensure your parents' certificate of contract is submitted.",
                "Your parents' certificate of contract is a necessary submission.",
                "Make sure your parents' signed certificate of contract is included.",
                "Submit your parents' certificate of contract along with your application.",
                "It's important to provide your parents' certificate of contract.",
                "Ensure your parents' certificate of contract is included with your submission.",
                "Please don't forget to include your parents' signed certificate of contract.",
                "Remember to submit your parents' certificate of contract.",
                "Please submit the required certificate of contract signed by your parents.",
                "Ensure the certificate of contract from your parents is submitted.",
                "It's necessary to submit your parents' certificate of contract"
            ]
        },
        {
            "tag": "4P's certificate",
            "patterns": [
                "What purpose does a 4P's certificate serve, and is it mandatory?",
                "Could you explain the significance of securing a 4P's certificate?",
                "In what situations would it be advisable to have a 4P's certificate?",
                "Is the acquisition of a 4P's certificate a requirement for specific programs or services?",
                "What benefits come with holding a 4P's certificate?",
                "Are there any consequences or limitations if we don't secure a 4P's certificate?",
                "How does having a 4P's certificate impact eligibility for certain assistance programs?",
                "What criteria determine whether an individual or household needs a 4P's certificate?",
                "Can you clarify the eligibility conditions that necessitate obtaining a 4P's certificate?",
                "Is the process of obtaining a 4P's certificate complex, and what are the steps involved?",
                "Does the need for a 4P's certificate vary depending on the region or locality?",
                "Are there specific programs or initiatives where a 4P's certificate is mandatory?",
                "What rights or privileges does a 4P's certificate grant to individuals or families?",
                "Can you provide information on any exemptions from the requirement of obtaining a 4P's certificate?",
                "Is the acquisition of a 4P's certificate time-sensitive, and if so, what is the timeframe?",
                "How does the absence of a 4P's certificate affect access to social services or government programs?",
                "Can you clarify the documentation or qualifications necessary to secure a 4P's certificate?",
                "Are there any fees associated with obtaining or renewing a 4P's certificate?",
                "Does the need for a 4P's certificate change based on changes in financial circumstances?",
                "What specific government initiatives or policies mandate the possession of a 4P's certificate?",
                "How frequently is it required to renew a 4P's certificate, and what is the renewal process?",
                "Is there a difference in the requirements for obtaining a 4P's certificate for individuals and families?",
                "Can you elaborate on the role of a 4P's certificate in the context of social welfare programs?",
                "How does having a 4P's certificate impact eligibility for educational assistance programs?",
                "Are there any alternative documents or proofs that can be used in lieu of a 4P's certificate?",
                "Does the necessity for a 4P's certificate vary based on the demographic or household composition?",
                "What steps should one take if there is uncertainty about the need for a 4P's certificate?",
                "Can you provide information on any recent changes in policies related to the 4P's certificate?",
                "How does ha`ving a 4P's certificate contribute to community development and welfare initiatives?"
            ],
            "responses": [
                "DSWD Regional Offices will provide BU Admissions with a copy, including the names of SHS Students who are recipients of the 4Ps program.",
                "BU Admissions will be provided with a copy by DSWD Regional Offices, containing the names of SHS Students enrolled in the 4Ps program.",
                "A copy, encompassing the names of SHS Students who are participants in the 4Ps program, will be submitted to BU Admissions by DSWD Regional Offices.",
                "DSWD Regional Offices will transmit a copy to BU Admissions, with the names of SHS Students benefiting from the 4Ps program.",
                "BU Admissions will receive a copy from DSWD Regional Offices, comprising the names of SHS Students who are recipients of the 4Ps program.",
                "A copy, listing the names of SHS Students who are enrolled in the 4Ps program, will be submitted to BU Admissions by DSWD Regional Offices.",
                "DSWD Regional Offices will send a copy to BU Admissions, containing the names of SHS Students who are part of the 4Ps program.",
                "BU Admissions will receive a copy from DSWD Regional Offices, with the names of SHS Students who are beneficiaries of the 4Ps program.",
                "DSWD Regional Offices will provide BU Admissions with a copy, which includes the names of SHS Students who are participants in the 4Ps program.",
                "BU Admissions will be provided with a copy by DSWD Regional Offices, encompassing the names of SHS Students benefiting from the 4Ps program.",
                "A copy, including the names of SHS Students who are recipients of the 4Ps program, will be submitted to BU Admissions by DSWD Regional Offices.",
                "DSWD Regional Offices will transmit a copy to BU Admissions, comprising the names of SHS Students who are enrolled in the 4Ps program.",
                "BU Admissions will receive a copy from DSWD Regional Offices, with the names of SHS Students who are part of the 4Ps program.",
                "DSWD Regional Offices will send a copy to BU Admissions, with the names of SHS Students who are recipients of the 4Ps program.",
                "BU Admissions will receive a copy from DSWD Regional Offices, containing the names of SHS Students enrolled in the 4Ps program.",
                "A copy, containing the names of SHS Students who are participants in the 4Ps program, will be submitted to BU Admissions by DSWD Regional Offices.",
                "DSWD Regional Offices will provide BU Admissions with a copy, listing the names of SHS Students who are beneficiaries of the 4Ps program.",
                "BU Admissions will be provided with a copy by DSWD Regional Offices, including the names of SHS Students who are recipients of the 4Ps program.",
                "A copy, encompassing the names of SHS Students who are enrolled in the 4Ps program, will be submitted to BU Admissions by DSWD Regional Offices.",
                "DSWD Regional Offices will transmit a copy to BU Admissions, with the names of SHS Students who are part of the 4Ps program.",
                "BU Admissions will receive a copy from DSWD Regional Offices, comprising the names of SHS Students who are beneficiaries of the 4Ps program.",
                "DSWD Regional Offices will send a copy to BU Admissions, including the names of SHS Students who are participants in the 4Ps program.",
                "BU Admissions will receive a copy from DSWD Regional Offices, with the names of SHS Students who are recipients of the 4Ps program.",
                "A copy, containing the names of SHS Students who are enrolled in the 4Ps program, will be submitted to BU Admissions by DSWD Regional Offices.",
                "DSWD Regional Offices will provide BU Admissions with a copy, which includes the names of SHS Students who are part of the 4Ps program.",
                "BU Admissions will be provided with a copy by DSWD Regional Offices, listing the names of SHS Students who are beneficiaries of the 4Ps program.",
                "A copy, encompassing the names of SHS Students who are recipients of the 4Ps program, will be submitted to BU Admissions by DSWD Regional Offices.",
                "DSWD Regional Offices will transmit a copy to BU Admissions, including the names of SHS Students who are enrolled in the 4Ps program.",
                "BU Admissions will receive a copy from DSWD Regional Offices, with the names of SHS Students who are participants in the 4Ps program."
            ]
        },
        {
            "tag": "guardian",
            "patterns": [
                "Do I need to provide an ITR even if my parent or guardian qualifies as a senior citizen or PWD?",
                "Is there an exemption from submitting an ITR for individuals with senior citizen or PWD parents or guardians?",
                "Does the senior citizen or PWD status of my parent or guardian affect my obligation to submit an ITR?",
                "If my parent or guardian is a senior citizen or PWD, does that exempt me from the requirement to submit an ITR?",
                "Is the submission of an ITR compulsory for individuals with senior citizen or PWD parents or guardians?",
                "How does the senior citizen or PWD status of my parent or guardian impact my responsibility to submit an ITR?",
                "Is there a specific rule regarding the submission of ITR for individuals with senior citizen or PWD parents or guardians?",
                "Does the tax obligation change based on the senior citizen or PWD status of my parent or guardian?",
                "Should I submit an ITR if my parent or guardian qualifies as a senior citizen or PWD?",
                "Is there a special provision for individuals with senior citizen or PWD parents or guardians regarding ITR submission?",
                "Is the submission of an ITR mandatory even if my parent or guardian is a senior citizen or PWD?",
                "How does the senior citizen or PWD status of my parent or guardian affect my tax filing requirements?",
                "Do I need to follow the standard ITR submission procedure if my parent or guardian is a senior citizen or PWD?",
                "Are there any specific guidelines for individuals with senior citizen or PWD parents or guardians regarding ITR submission?",
                "Can I claim an exemption from ITR submission if my parent or guardian qualifies as a senior citizen or PWD?",
                "Does the tax department provide any concessions for individuals with senior citizen or PWD parents or guardians regarding ITR?",
                "Is the submission of an ITR influenced by the senior citizen or PWD status of my parent or guardian?",
                "Do individuals with senior citizen or PWD parents or guardians have any special considerations regarding ITR submission?",
                "Is there a different process for ITR submission for individuals with senior citizen or PWD parents or guardians?",
                "Should I seek professional advice on ITR submission if my parent or guardian is a senior citizen or PWD?",
                "Can I be exempted from submitting an ITR if my parent or guardian is classified as a senior citizen or PWD?",
                "Is there a specific age or disability threshold that determines the need for ITR submission for individuals with senior citizen or PWD parents or guardians?",
                "How does the senior citizen or PWD status of my parent or guardian impact my tax liabilities and ITR requirements?",
                "Do I need to follow standard tax filing procedures if my parent or guardian is a senior citizen or PWD?",
                "Is there a provision for individuals with senior citizen or PWD parents or guardians to request a waiver of ITR submission?",
                "How can the senior citizen or PWD status of my parent or guardian be factored into the ITR submission process?",
                "Can I claim any tax benefits or exemptions based on the senior citizen or PWD status of my parent or guardian?",
                "Are there any specific forms or documentation required for ITR submission if my parent or guardian is a senior citizen or PWD?",
                "Does the senior citizen or PWD status of my parent or guardian exempt me from any tax-related obligations, including ITR submission?"
            ],
            "responses": [
                "Remember to provide your guardian's tax exemption certificate.",
                "Don't forget to submit your guardian's certificate of tax exemption.",
                "Make sure your guardian's tax exemption certificate is included.",
                "Please ensure your guardian's certificate of tax exemption is included.",
                "Submit your guardian's tax exemption certificate along with your application.",
                "Your guardian's tax exemption certificate is a required document.",
                "Make sure to submit your guardian's tax exemption certificate.",
                "Please don't forget to provide your guardian's tax exemption certificate.",
                "Remember to submit your guardian's tax exemption certificate.",
                "Please ensure your guardian's certificate of tax exemption is submitted.",
                "Your guardian's certificate of tax exemption must be included in your submission.",
                "Please ensure your guardian's tax exemption certificate is included.",
                "Submit your guardian's certificate of tax exemption along with your application.",
                "Your guardian's tax exemption certificate must be included in your submission.",
                "Remember to ensure your guardian's certificate of tax exemption is submitted.",
                "Your guardian's certificate of tax exemption is necessary for your application.",
                "Make sure your guardian's certificate of tax exemption is included in your submission.",
                "Please don't forget to ensure your guardian's tax exemption certificate is submitted.",
                "Remember to include your guardian's tax exemption certificate in your submission.",
                "Your guardian's tax exemption certificate is required for your application.",
                "Ensure your guardian's certificate of tax exemption is included with your submission.",
                "Please ensure your guardian's tax exemption certificate is included in your submission.",
                "Make sure your guardian's tax exemption certificate is submitted.",
                "Don't forget to ensure your guardian's certificate of tax exemption is included.",
                "Your guardian's tax exemption certificate must be submitted.",
                "Please don't forget to include your guardian's certificate of tax exemption.",
                "Your guardian's certificate of tax exemption is necessary for submission.",
                "Make sure your guardian's certificate of tax exemption is submitted."
            ]
        },
        {
            "tag": "concerns",
            "patterns": [
                "Where is the appropriate point of contact for addressing BUCET-related issues?",
                "To which department should I address my concerns about BUCET?",
                "What is the official avenue for raising concerns about BUCET?",
                "Where can I find information on how to address BUCET-related issues?",
                "To whom should I direct my grievances or concerns about BUCET?",
                "What office is responsible for handling concerns related to BUCET?",
                "Where is the customer service center for BUCET concerns located?",
                "Can you provide details on the helpdesk or support system for BUCET concerns?",
                "What is the email address for submitting concerns about BUCET?",
                "Where can I find the contact information for addressing BUCET concerns?",
                "To whom should I send an email regarding my BUCET-related questions?",
                "What is the official helpline or hotline for addressing urgent BUCET concerns?",
                "Where can I access the online support portal for BUCET-related queries?",
                "Can you guide me on how to reach the BUCET support team for concerns?",
                "What is the official website or platform for addressing BUCET concerns?",
                "To whom should I direct my concerns for a timely response regarding BUCET?",
                "Where can I find the FAQ section for addressing common BUCET concerns?",
                "Can you provide information on the hours of operation for addressing BUCET concerns?",
                "What is the physical address of the office where I can address BUCET concerns?",
                "Where can I submit a formal complaint or feedback about BUCET concerns?",
                "To whom should I escalate unresolved concerns about BUCET?",
                "What is the process for raising concerns through the official BUCET channels?",
                "Where can I attend in-person appointments to discuss BUCET concerns?",
                "Can you guide me on how to utilize the online chat support for addressing BUCET concerns?",
                "What is the official mailing address for sending written concerns about BUCET?",
                "Where can I find the official social media channels for addressing BUCET concerns?",
                "To whom should I address concerns if I encounter technical issues with the BUCET application?",
                "What is the protocol for addressing concerns related to BUCET accommodations?",
                "Where can I access the self-help resources for addressing common BUCET concerns?",
                "Can you provide information on the turnaround time for addressing submitted BUCET concerns?",
                "What is the expected response time for addressing concerns raised about BUCET?",
                "Where can I find the BUCET ombudsman's contact information for addressing concerns?",
                "To whom should I report concerns about the conduct of BUCET examinations?",
                "What is the protocol for addressing concerns related to the BUCET admission process?",
                "Where can I find the official documentation outlining the procedure for addressing BUCET concerns?",
                "Can you guide me on how to request a meeting to discuss specific concerns about BUCET?",
                "What is the official protocol for addressing concerns raised during the BUCET interview process?",
                "Where can I find the resources for self-resolution of minor BUCET concerns?",
                "To whom should I direct concerns about discrepancies in the BUCET score reporting?",
                "What is the official avenue for addressing concerns related to BUCET eligibility criteria?",
                "Can you provide information on the BUCET student support services available for addressing concerns?",
                "Where can I find the official BUCET grievance policy for addressing concerns?",
                "To whom should I reach out for concerns regarding the BUCET examination schedule?"
            ],
            "responses": [
                "You can email the BUAO.BUCET@GMAIL.COM or call at (052)742-5099",
                "To address your concerns, you may contact the BUAO.BUCET@GMAIL.COM or call at (052)742-5099",
                "For reaching out your concerns, you may email the BUAO.BUCET@GMAIL.COM or call at (052)742-5099"
            ]
        },
        {
            "tag": "purpose",
            "patterns": [
                "Is the 40 pesos stamp needed for mailing?",
                "Do I need the 40 pesos mailing stamp for this?",
                "Is the 40 pesos postage stamp a must?",
                "Is the 40 pesos stamp essential for mailing?",
                "Should I affix the 40 pesos postage stamp?",
                "Is the 40 pesos stamp required for mailing?",
                "Must the 40 pesos mailing stamp be used?",
                "Do I have to include the 40 pesos postage stamp?",
                "Is the 40 pesos stamp crucial for mailing?",
                "Is the 40 pesos mailing stamp compulsory?",
                "Should the 40 pesos postage stamp be attached?",
                "Is the 40 pesos stamp mandatory for mailing?",
                "Is the 40 pesos mailing stamp a necessity?",
                "Is the 40 pesos postage stamp indispensable?",
                "Is the 40 pesos stamp necessary for mailing?",
                "Must I use the 40 pesos mailing stamp?",
                "Is the 40 pesos postage stamp required?",
                "Do I need to affix the 40 pesos mailing stamp?",
                "Is the 40 pesos stamp compulsory for mailing?",
                "Should I include the 40 pesos mailing stamp?",
                "Is the 40 pesos postage stamp mandatory for mailing?",
                "Is the 40 pesos stamp essential?",
                "Do I have to use the 40 pesos mailing stamp?",
                "Is the 40 pesos postage stamp a requirement for mailing?",
                "Is the 40 pesos stamp needed?",
                "Should I affix the 40 pesos mailing stamp for this?",
                "Is the 40 pesos postage stamp a must for mailing?",
                "Must the 40 pesos mailing stamp be attached?",
                "Is the 40 pesos mailing stamp indispensable?",
                "Should the 40 pesos postage stamp be used?",
                "Is the 40 pesos stamp necessary for mailing?",
                "Is the 40 pesos postage stamp compulsory?",
                "Must I use the 40 pesos mailing stamp?",
                "Is the 40 pesos postage stamp indispensable?",
                "Is the 40 pesos mailing stamp a necessity?",
                "Is the 40 pesos stamp mandatory for mailing?",
                "Should the 40 pesos postage stamp be attached?",
                "Is the 40 pesos mailing stamp compulsory?",
                "Do I need to include the 40 pesos postage stamp?",
                "Must the 40 pesos mailing stamp be used?",
                "Is the 40 pesos stamp required for mailing?",
                "Should I affix the 40 pesos postage stamp?",
                "Is the 40 pesos stamp essential for mailing?"
            ],
            "responses": [
                "The University Registrar notes that the intention is to send the request letter for Form 137 from the student's prior academic institution.",
                "As per the University Registrar, the objective is to mail the request letter for Form 137 from the student's former educational establishment.",
                "According to the University Registrar, it is intended for mailing the request letter for Form 137 from the student's previous academic institution.",
                "The University Registrar clarifies that it is for mailing the request letter for Form 137 from the student's former educational institution.",
                "It is conveyed by the University Registrar that the purpose is to mail the request letter for Form 137 from the student's prior school.",
                "According to the University Registrar, the intention is to send the request letter for Form 137 from the student's previous academic establishment.",
                "The University Registrar states that it is for mailing the request letter for Form 137 from the student's previous academic institution.",
                "As stated by the University Registrar, the objective is to mail the request letter for Form 137 from the student's prior educational establishment.",
                "According to the University Registrar, it is meant for mailing the request letter for Form 137 from the student's previous educational institution.",
                "The University Registrar mentions that it is for mailing the request letter for Form 137 from the student's prior academic establishment.",
                "As per the University Registrar, the purpose is to mail the request letter for Form 137 from the student's former academic institution.",
                "According to the University Registrar, it is for mailing the request letter for Form 137 from the student's prior academic institution."
            ]
        },
        {
            "tag": "more than",
            "patterns": [
                "Is there any restriction on the postage stamp costing more than 40 pesos?",
                "Can the mailing stamp's value surpass 40 pesos without consequences?",
                "Is it permissible for the postage stamp to surpass the 40 pesos limit?",
                "Would it be acceptable for the mailing stamp to exceed 40 pesos?",
                "Is there any objection to the postage stamp being priced at more than 40 pesos?",
                "Can the postage stamp's value be higher than 40 pesos without any trouble?",
                "Is it within the rules for the mailing stamp to be valued over 40 pesos?",
                "Can the postage stamp exceed 40 pesos in value without issue?",
                "Is it acceptable for the mailing stamp to be more than 40 pesos?",
                "Would it be alright for the postage stamp to surpass the 40 pesos threshold?",
                "Can the mailing stamp's value go beyond 40 pesos without trouble?",
                "Is it permissible for the postage stamp to be priced at more than 40 pesos?",
                "Would it be acceptable if the mailing stamp exceeded the 40 pesos limit?",
                "Is it acceptable for the mailing stamp to cost more than 40 pesos?",
                "Can the postage stamp's value be higher than 40 pesos without any concern?",
                "Can the postage stamp go beyond 40 pesos in value without any trouble?",
                "Is it permissible for the mailing stamp to surpass the 40 pesos limit?",
                "Would it be alright for the postage stamp to be over 40 pesos in value?",
                "Can the mailing stamp's value surpass 40 pesos without any issue?",
                "Is it acceptable for the postage stamp to exceed the 40 pesos threshold?",
                "Is there a concern with the postage stamp being priced at more than 40 pesos?",
                "Can the postage stamp's value go beyond 40 pesos without any objection?",
                "Is it within the rules for the mailing stamp to be more than 40 pesos?",
                "Can the postage stamp's value exceed 40 pesos without any issue?",
                "Is it permissible for the mailing stamp to go over the 40 pesos limit?",
                "Would there be any objection to the postage stamp being more than 40 pesos?",
                "Is there any issue if the mailing stamp's value surpasses 40 pesos?",
                "Can the postage stamp be priced at more than 40 pesos without any problem?",
                "Is it acceptable for the mailing stamp to surpass the 40 pesos limit?",
                "Can the postage stamp's value be higher than 40 pesos without any issue?",
                "Is it within the rules for the mailing stamp to be valued at more than 40 pesos?",
                "Can the postage stamp exceed 40 pesos in value without any trouble?",
                "Is it permissible for the mailing stamp to be priced at more than 40 pesos?",
                "Can the postage stamp's value be higher than 40 pesos without any concern?",
                "Can the postage stamp go beyond 40 pesos in value without any trouble?",
                "Is it permissible for the mailing stamp to surpass the 40 pesos limit?",
                "Would it be alright for the postage stamp to be over 40 pesos in value?",
                "Can the mailing stamp's value surpass 40 pesos without any issue?",
                "Is it acceptable for the postage stamp to exceed the 40 pesos threshold?",
                "Can the postage stamp's value go beyond 40 pesos without any objection?",
                "Is it within the rules for the mailing stamp to be more than 40 pesos?",
                "Can the postage stamp's value exceed 40 pesos without any issue?",
                "Is it permissible for the mailing stamp to go over the 40 pesos limit?",
                "Can the postage stamp be priced at more than 40 pesos without any problem?",
                "Is it acceptable for the mailing stamp to surpass the 40 pesos limit?",
                "Can the postage stamp's value be higher than 40 pesos without any issue?",
                "Can the postage stamp exceed 40 pesos in value without any trouble?",
                "Is it permissible for the mailing stamp to be priced at more than 40 pesos?",
                "Would there be any issue with the postage stamp being valued above 40 pesos?",
                "Can the postage stamp's value be higher than 40 pesos without any concern?",
                "Can the postage stamp go beyond 40 pesos in value without any trouble?",
                "Is it permissible for the mailing stamp to surpass the 40 pesos limit?",
                "Would it be alright for the postage stamp to be over 40 pesos in value?",
                "Is it okay if our mailing stamp is more than Php 50.00?",
                "Is it acceptable if our mailing stamp exceeds the value of Php 50.00?",
                "Is there a problem if the mailing stamp used is more than Php 50.00 in value?",
                "Can we use a mailing stamp with a denomination exceeding Php 50.00?",
                "Is it permissible to affix a mailing stamp that is valued higher than Php 50.00?",
                "Are there any restrictions if our mailing stamp has a value exceeding Php 50.00?",
                "Could you clarify whether using a mailing stamp over Php 50.00 is allowed?",
                "Is it within the rules to use a mailing stamp with a value greater than Php 50.00?",
                "Would it be acceptable if the mailing stamp we use is more than Php 50.00?",
                "Is it permissible to use a mailing stamp with a value greater than Php 50.00?",
                "Can we use a mailing stamp that costs more than Php 50.00, or is it against the guidelines?",
                "Is there flexibility regarding the mailing stamp value, and can it be higher than Php 50.00?",
                "What are the regulations concerning the mailing stamp amount, and is it acceptable to exceed Php 50.00?",
                "Is it within the rules to have a mailing stamp costing more than Php 50.00, or are there restrictions?",
                "Can you confirm if the Php 50.00 limit for mailing stamps is a strict requirement or subject to change?"
            ],
            "responses": [
                "Affirmative, the postage stamp is allowed to be over 40 pesos, but it must not be less than 40 pesos.",
                "Yes, the mailing stamp can exceed 40 pesos in value, but it must not be lower than 40 pesos.",
                "Indeed, the postage stamp's price can surpass 40 pesos, as long as it remains at or above 40 pesos.",
                "Absolutely, the mailing stamp's value can be higher than 40 pesos, but it cannot be less than 40 pesos.",
                "Correct, the postage stamp's cost may surpass 40 pesos, provided it does not fall below 40 pesos.",
                "Yes, the mailing stamp can be valued at more than 40 pesos, but it cannot be less than 40 pesos.",
                "Affirmative, the postage stamp's price can exceed 40 pesos, but it should not be less than 40 pesos.",
                "Indeed, the mailing stamp's value may go beyond 40 pesos, but it should not be lower than 40 pesos.",
                "Yes, the postage stamp can be priced higher than 40 pesos, but it must not be less than 40 pesos.",
                "Correct, the mailing stamp's cost can be greater than 40 pesos, but it should not be less than 40 pesos.",
                "Absolutely, the postage stamp's value can surpass 40 pesos, provided it does not drop below 40 pesos.",
                "Affirmative, the mailing stamp can exceed 40 pesos in value, but it should not be less than 40 pesos.",
                "Yes, the postage stamp's price may go over 40 pesos, but it must not be less than 40 pesos.",
                "Indeed, the mailing stamp can be valued at more than 40 pesos, but it cannot be lower than 40 pesos."
            ]
        },
        {
            "tag": "less than",
            "patterns": [
                "Is it fine if the mailing stamp is below 40 pesos?",
                "Would it be alright if the postage doesn't meet the 40 pesos threshold?",
                "Is it permissible for the mailing stamp to be under 40 pesos?",
                "Can the postage be less than 40 pesos and still be acceptable?",
                "Is it within the limits if the mailing stamp is less than 40 pesos?",
                "Would it be acceptable for the postage to be under 40 pesos?",
                "Is it okay if the mailing stamp value is less than 40 pesos?",
                "Can the postage stamp value fall short of 40 pesos?",
                "Is it fine if the postage stamp doesn't reach 40 pesos?",
                "Would it be alright for the mailing stamp to be less than 40 pesos?",
                "Is it permissible for the postage stamp to be less than 40 pesos?",
                "Can the mailing stamp amount be below 40 pesos?",
                "Is it within the acceptable range if the postage falls short of 40 pesos?",
                "Would it be acceptable if the postage stamp falls under 40 pesos?",
                "Is it okay if the mailing stamp is less than 40 pesos?",
                "Can the postage stamp value be less than 40 pesos?",
                "Is it fine if the postage doesn't reach the 40 pesos threshold?",
                "Would it be alright for the mailing stamp to be under 40 pesos?",
                "Is it permissible for the postage to be less than 40 pesos?",
                "Can the mailing stamp value fall short of 40 pesos?",
                "Is it within the acceptable range if the postage is under 40 pesos?",
                "Would it be acceptable for the postage stamp to be less than 40 pesos?",
                "Is it okay if the mailing stamp doesn't meet the 40 pesos threshold?",
                "Can the postage stamp amount be less than 40 pesos?",
                "Is it fine if the mailing stamp is below 40 pesos?",
                "Would it be alright for the postage stamp to be under 40 pesos?",
                "Is it permissible for the mailing stamp to be less than 40 pesos?",
                "Can the postage stamp value be lower than 40 pesos?",
                "Is it okay if the postage doesn't reach 40 pesos?",
                "Would it be acceptable if the mailing stamp is less than 40 pesos?",
                "Is it within the acceptable limit if the postage falls short of 40 pesos?",
                "Can the mailing stamp value be below 40 pesos?",
                "Is it fine if the postage stamp is less than 40 pesos?",
                "Would it be alright for the mailing stamp to be less than 40 pesos?",
                "Is it permissible for the postage stamp to fall short of 40 pesos?",
                "Can the postage be below 40 pesos and still be acceptable?",
                "Is it within the limits if the mailing stamp is less than 40 pesos?",
                "Would it be acceptable for the postage to be under 40 pesos?",
                "Is it okay if the mailing stamp amount is less than 40 pesos?",
                "Can the postage stamp value be lower than 40 pesos?",
                "Is it fine if the postage doesn't reach 40 pesos?",
                "Would it be alright for the mailing stamp to be below 40 pesos?",
                "Is it permissible for the postage stamp to be less than 40 pesos?",
                "Can the mailing stamp value fall short of 40 pesos?",
                "Is it within the acceptable range if the postage is under 40 pesos?",
                "Would it be acceptable if the postage stamp falls under 40 pesos?",
                "Is it okay if the mailing stamp is less than 40 pesos?",
                "Can the postage stamp value be less than 40 pesos?",
                "Is it fine if the postage doesn't reach the 40 pesos threshold?",
                "Would it be alright for the mailing stamp to be under 40 pesos?",
                "Is it permissible for the postage to be less than 40 pesos?",
                "Can the mailing stamp value fall short of 40 pesos?",
                "Is it within the acceptable range if the postage is under 40 pesos?",
                "Would it be acceptable for the postage stamp to be less than 40 pesos?",
                "Is it okay if the mailing stamp doesn't meet the 40 pesos threshold?",
                "Can the postage stamp amount be less than 40 pesos?",
                "Is it fine if the mailing stamp is below 40 pesos?",
                "Is it permissible for the mailing stamp to be less than 40 pesos?",
                "Can the postage stamp value be lower than 40 pesos?",
                "Is it okay if the postage doesn't reach 40 pesos?",
                "Is it within the acceptable limit if the postage falls short of 40 pesos?",
                "Can the mailing stamp value be below 40 pesos?",
                "Is it fine if the postage stamp is less than 40 pesos?"
            ],
            "responses": [
                "The postage cost should be 40 pesos, either precisely 40 pesos or greater.",
                "The price of the mailing stamp should be 40 pesos, a total of 40 pesos or higher.",
                "The postage fee must amount to 40 pesos, totaling either 40 pesos or more.",
                "The mailing stamp should cost 40 pesos, totaling either 40 pesos or surpassing it.",
                "The postage cost needs to be 40 pesos, either precisely 40 pesos or more than this amount.",
                "The price of the mailing stamp should be 40 pesos, totaling either 40 pesos or exceeding this sum.",
                "The postage fee should be 40 pesos, either exactly 40 pesos or higher than this amount.",
                "The cost of the mailing stamp should amount to 40 pesos, totaling either 40 pesos or greater.",
                "The mailing stamp should be priced at 40 pesos, a sum totaling either 40 pesos or more.",
                "The postage cost should be 40 pesos, either precisely 40 pesos or exceeding this amount.",
                "The price of the mailing stamp should be 40 pesos, a total of 40 pesos or more.",
                "The postage fee must amount to 40 pesos, totaling either 40 pesos or surpassing this amount.",
                "The mailing stamp should cost 40 pesos, totaling either 40 pesos or more than this sum."
            ]
        },
        {
            "tag": "medical",
            "patterns": [
                "Should the mailed/couriered documents include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
                "Is it required to enclose the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when sending documents via mail or courier?",
                "Do we have to send the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier when submitting the requirements?",
                "Must we incorporate the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the mailed/couriered materials?",
                "Is it mandatory to submit the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier service?",
                "Should the package sent by mail/courier contain the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
                "Do we need to dispatch the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier along with other requirements?",
                "Is including the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the mailed/couriered documents a prerequisite?",
                "Is there a requirement to attach the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when sending documents by mail or courier?",
                "Should the package sent through mail/courier encompass the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
                "Is it compulsory to enclose the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the submitted documents via mail or courier?",
                "Do we need to send the Chest X-ray film, Hepa B Screening Result, and Medical Certificate by mail or courier as part of the submission?",
                "Must the documents sent through mail/courier include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
                "Is there a requirement to include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when sending materials via mail or courier?",
                "Should the submission through mail/courier consist of the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
                "Do we need to attach the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when submitting documents via mail or courier service?",
                "Is it necessary to dispatch the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier along with the other requirements?",
                "Should the mailed/couriered documents include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
                "Is it required to enclose the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when sending documents via mail or courier?",
                "Do we have to send the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier when submitting the requirements?",
                "Must we incorporate the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the mailed/couriered materials?",
                "Is it mandatory to submit the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier service?",
                "Should the package sent by mail/courier contain the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
                "Do we need to dispatch the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier along with other requirements?",
                "Is including the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the mailed/couriered documents a prerequisite?",
                "Is there a requirement to attach the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when sending documents by mail or courier?",
                "Should the package sent through mail/courier encompass the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
                "Is it compulsory to enclose the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the submitted documents via mail or courier?",
                "Do we need to send the Chest X-ray film, Hepa B Screening Result, and Medical Certificate by mail or courier as part of the submission?",
                "Must the documents sent through mail/courier include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
                "Is there a requirement to include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when sending materials via mail or courier?",
                "Do we need to attach the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when submitting documents through mail or courier?",
                "Is it necessary to include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the package sent via mail or courier?",
                "Should the mailed/couriered documents include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
                "Do we have to send the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier when submitting the requirements?",
                "Must we incorporate the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the materials sent via mail or courier?",
                "Is including the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the mailed/couriered documents mandatory?",
                "Should the package sent by mail/courier contain the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
                "Do we need to dispatch the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier along with other requirements?",
                "Is there a requirement to attach the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when sending documents by mail or courier?",
                "Should the submission through mail/courier consist of the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
                "Do we need to attach the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when submitting documents via mail or courier service?",
                "Is it necessary to dispatch the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier along with the other requirements?",
                "Should the mailed/couriered documents include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
                "Is it required to enclose the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when sending documents via mail or courier?",
                "Do we have to send the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier when submitting the requirements?",
                "Must we incorporate the Chest X-ray film, Hepa B Screening Result, and Medical Certificates in the mailed/couriered materials?"
            ],
            "responses": [
                "As per the new Administrative Order from the University President, the requirement of a Medical Certificate for enrollment will be temporarily suspended, recognizing the current situation and adherence to the guidelines of the Inter-Agency Task Force for the Management of the Emerging Infectious Disease (IAFT-MEID).",
                "The recent Administrative Order issued by the University President specifies that the necessity of a Medical Certificate for enrollment will be temporarily lifted, taking into account the prevailing circumstances and compliance with the protocols of the Inter-Agency Task Force for the Management of the Emerging Infectious Disease (IAFT-MEID).",
                "In line with the recent Administrative Order by the University President, the inclusion of a Medical Certificate as part of the enrollment requirements will be temporarily waived, considering the current situation and adherence to the guidelines of the Inter-Agency Task Force for the Management of the Emerging Infectious Disease (IAFT-MEID).",
                "The University President's recent Administrative Order indicates that the requirement for a Medical Certificate for enrollment will be temporarily suspended, acknowledging the ongoing circumstances and compliance with the directives of the Inter-Agency Task Force for the Management of the Emerging Infectious Disease (IAFT-MEID).",
                "As outlined in the latest Administrative Order by the University President, the necessity of a Medical Certificate for enrollment will be temporarily exempted, considering the present situation and adherence to the regulations of the Inter-Agency Task Force for the Management of the Emerging Infectious Disease (IAFT-MEID).",
                "Per the recent Administrative Order issued by the University President, the inclusion of a Medical Certificate as part of the enrollment requirements will be temporarily disregarded, recognizing the current situation and compliance with the guidelines of the Inter-Agency Task Force for the Management of the Emerging Infectious Disease (IAFT-MEID).",
                "According to the new Administrative Order from the University President, the requirement of a Medical Certificate for enrollment will be temporarily waived, considering the prevailing circumstances and adherence to the policies of the Inter-Agency Task Force for the Management of the Emerging Infectious Disease (IAFT-MEID).",
                "As per the recent Administrative Order issued by the University President, the necessity of a Medical Certificate for enrollment will be temporarily suspended, recognizing the current situation and adherence to the directives of the Inter-Agency Task Force for the Management of the Emerging Infectious Disease (IAFT-MEID).",
                "The University President's recent Administrative Order specifies that the requirement for a Medical Certificate for enrollment will be temporarily lifted, considering the ongoing circumstances and compliance with the protocols of the Inter-Agency Task Force for the Management of the Emerging Infectious Disease (IAFT-MEID).",
                "In line with the recent Administrative Order by the University President, the inclusion of a Medical Certificate as part of the enrollment requirements will be temporarily waived, considering the current situation and adherence to the guidelines of the Inter-Agency Task Force for the Management of the Emerging Infectious Disease (IAFT-MEID).",
                "The University President's recent Administrative Order indicates that the requirement for a Medical Certificate for enrollment will be temporarily suspended, acknowledging the prevailing circumstances and compliance with the directives of the Inter-Agency Task Force for the Management of the Emerging Infectious Disease (IAFT-MEID).",
                "As outlined in the latest Administrative Order by the University President, the necessity of a Medical Certificate for enrollment will be temporarily exempted, recognizing the current situation and adherence to the regulations of the Inter-Agency Task Force for the Management of the Emerging Infectious Disease (IAFT-MEID)."
            ]
        },
        {
            "tag": "requirements",
            "patterns": [
                "List the necessary documents for online verification.",
                "Detail the mandatory online submission lineup.",
                "Describe the online document prerequisites.",
                "Specify the documents required for online processing.",
                "Provide a checklist of online application documents.",
                "Clarify the documents essential for online procedures.",
                "Discuss the online submission document requirements.",
                "Enumerate the essential online document compilation.",
                "What paperwork must be submitted online?",
                "State the mandatory online document lineup.",
                "Clarify the documents expected for online transactions.",
                "Outline the online submission document criteria.",
                "Mention the requisite documents for online validation.",
                "Share the necessary online documentation details.",
                "Elaborate on the documents needed for online verification.",
                "Specify the online submission document prerequisites.",
                "Provide a comprehensive list of online submission documents.",
                "Enumerate the necessary paperwork for online transactions.",
                "What documents are compulsory for online submission?",
                "Discuss the essential online document requirements.",
                "List the documents to be submitted online.",
                "Detail the mandatory online document compilation.",
                "What documents should be uploaded online?",
                "Clarify the online submission document prerequisites.",
                "Outline the documents essential for online processing.",
                "Enumerate the online document requirements.",
                "Provide a checklist of online application documents.",
                "Describe the documents needed for online verification.",
                "Mention the necessary documents for online validation.",
                "Elaborate on the essential online document compilation.",
                "What paperwork is required for online submission?",
                "State the mandatory online document criteria.",
                "Clarify the documents expected for online transactions.",
                "Outline the online submission document prerequisites.",
                "Specify the requisite documents for online processing.",
                "Enumerate the documents to be submitted online.",
                "What documents are needed for online submission?",
                "Share the necessary online documentation details.",
                "List the documents necessary for online verification.",
                "Detail the mandatory online submission paperwork.",
                "Describe the online document prerequisites.",
                "Specify the documents required for online procedures.",
                "Provide a checklist of online application documents.",
                "Clarify the documents essential for online transactions.",
                "Discuss the online submission document requirements.",
                "Enumerate the essential online document lineup.",
                "What paperwork must be submitted online?",
                "State the mandatory online document lineup.",
                "Clarify the documents expected for online transactions.",
                "Outline the online submission document criteria.",
                "Mention the requisite documents for online validation.",
                "Share the necessary online documentation details.",
                "Elaborate on the documents needed for online verification.",
                "Specify the online submission document prerequisites.",
                "Provide a comprehensive list of online submission documents.",
                "Enumerate the necessary paperwork for online transactions.",
                "What documents are compulsory for online submission?",
                "Discuss the essential online document requirements.",
                "List the documents to be submitted online.",
                "Detail the mandatory online document compilation.",
                "What documents should be uploaded online?",
                "State the mandatory online document lineup.",
                "Specify the documents expected for online procedures.",
                "Clarify the online submission document prerequisites.",
                "Outline the documents essential for online processing.",
                "Enumerate the online document requirements.",
                "Share the requisite online documentation criteria.",
                "Provide a checklist of online application documents.",
                "Describe the documents needed for online verification.",
                "Discuss the online submission document lineup.",
                "Mention the necessary documents for online validation.",
                "Elaborate on the essential online document compilation.",
                "What paperwork is required for online submission?",
                "State the mandatory online document criteria.",
                "Clarify the documents expected for online transactions.",
                "Outline the online submission document prerequisites.",
                "Enumerate the documents to be submitted online.",
                "What documents are needed for online submission?",
                "Share the necessary online documentation details.",
                "List the documents necessary for online verification.",
                "Detail the mandatory online submission paperwork.",
                "Describe the online document prerequisites.",
                "Specify the documents required for online procedures.",
                "Provide a checklist of online application documents.",
                "Clarify the documents essential for online transactions.",
                "Discuss the online submission document requirements.",
                "Clarify the documents expected for online transactions."
            ],
            "responses": [
                "Documents to be passed through scanned copy:\n 1. BUCET Result\n 2. SHS Report Card\n 3. Medical Certificate (only to those who can provide now)\n 4. Birth Certificate\n 5. 2 pcs of 2x2 picture",
                "Documents to be submitted in digital form:\n 1. BUCET Result\n 2. SHS Report Card\n 3. Medical Certificate (only to those who can provide now)\n 4. Birth Certificate\n 5. 2 pcs of 2x2 picture",
                "List of documents to be passed in digital/scanned form:\n 1. BUCET Result\n 2. SHS Report Card\n 3. Medical Certificate (only to those who can provide now)\n 4. Birth Certificate\n 5. 2 pcs of 2x2 picture"
            ]
        },
        {
            "tag": "satellite",
            "patterns": [
                "Will there be dropboxes in satellite campuses of Bicol University?",
                "Is it anticipated that there will be dropboxes at Bicol University's satellite campuses?",
                "Will dropboxes be available at the satellite campuses of Bicol University?",
                "Are dropboxes expected to be present in Bicol University's satellite campuses?",
                "Will Bicol University have dropboxes at its satellite campuses?",
                "Are dropboxes going to be installed at Bicol University's satellite campuses?",
                "Can we expect dropboxes at Bicol University's satellite campuses?",
                "Will there be designated dropboxes at the satellite campuses of Bicol University?",
                "Are there plans to implement dropboxes in Bicol University's satellite campuses?",
                "Will drop-off points be established at Bicol University's satellite campuses?",
                "Is the provision of dropboxes being considered for Bicol University's satellite campuses?",
                "Will there be dropbox facilities in Bicol University's satellite campuses?",
                "Are dropboxes part of the infrastructure plan for Bicol University's satellite campuses?",
                "Can students anticipate having dropboxes at Bicol University's satellite campuses?",
                "Is there an initiative to install dropboxes in Bicol University's satellite campuses?",
                "Will Bicol University extend dropbox services to its satellite campuses?",
                "Are there any discussions about implementing dropboxes at Bicol University's satellite campuses?",
                "Will dropboxes be incorporated into the facilities of Bicol University's satellite campuses?",
                "Is there a plan to introduce dropboxes at Bicol University's satellite campuses?",
                "Will there be secure dropboxes available at Bicol University's satellite campuses?",
                "Are drop-off points under consideration for Bicol University's satellite campuses?",
                "Will students have access to dropboxes at Bicol University's satellite campuses?",
                "Are there plans to set up dropboxes in Bicol University's satellite campuses?",
                "Will dropbox services be extended to Bicol University's satellite campuses?",
                "Can we expect to find dropboxes at the satellite campuses of Bicol University?",
                "Will there be a provision for dropboxes in Bicol University's satellite campuses?",
                "Are there plans to establish drop-off locations in Bicol University's satellite campuses?",
                "Will Bicol University implement a system of dropboxes in its satellite campuses?",
                "Is there a proposal to introduce dropboxes at Bicol University's satellite campuses?",
                "Will there be designated areas for dropboxes in Bicol University's satellite campuses?",
                "Are there any considerations for installing dropboxes at Bicol University's satellite campuses?",
                "Will Bicol University include dropbox facilities in its satellite campuses?",
                "Are there plans to incorporate drop-off points in Bicol University's satellite campuses?",
                "Will there be drop-off services available at the satellite campuses of Bicol University?",
                "Is the installation of dropboxes being discussed for Bicol University's satellite campuses?",
                "Will there be designated drop-off points at Bicol University's satellite campuses?",
                "Are there plans to introduce dropbox systems at Bicol University's satellite campuses?",
                "Will Bicol University establish drop-off locations at its satellite campuses?",
                "Is the provision of dropboxes part of the development plan for Bicol University's satellite campuses?",
                "Will there be dropbox amenities at the satellite campuses of Bicol University?",
                "Are there any proposals to set up dropboxes in Bicol University's satellite campuses?",
                "Will there be a rollout of dropbox services at Bicol University's satellite campuses?",
                "Is there a plan to implement dropboxes for Bicol University's satellite campuses?",
                "Will there be drop-off points for students at Bicol University's satellite campuses?",
                "Are there any intentions to provide dropboxes at Bicol University's satellite campuses?",
                "Will drop-off facilities be included in the infrastructure of Bicol University's satellite campuses?",
                "Is there a proposal to establish dropboxes at Bicol University's satellite campuses?",
                "Will there be a system of drop-off points at the satellite campuses of Bicol University?",
                "Are there plans to incorporate dropboxes into the satellite campuses of Bicol University?",
                "Will drop-off services be part of the amenities at Bicol University's satellite campuses?",
                "Is there an initiative to install dropboxes at Bicol University's satellite campuses?",
                "Will there be secure drop-off locations at the satellite campuses of Bicol University?",
                "Are there any considerations for implementing dropboxes in Bicol University's satellite campuses?",
                "Will Bicol University include dropbox facilities in its satellite campus planning?",
                "Are there any plans to set up drop-off points in Bicol University's satellite campuses?",
                "Will there be designated areas for dropboxes in the satellite campuses of Bicol University?",
                "Are there discussions about the implementation of dropboxes at Bicol University's satellite campuses?",
                "Will Bicol University extend dropbox services to its satellite campuses?",
                "Is there a plan to introduce dropboxes at Bicol University's satellite campuses?",
                "Will there be secure dropboxes available at Bicol University's satellite campuses?",
                "Are drop-off points under consideration for Bicol University's satellite campuses?",
                "Will students have access to dropboxes at Bicol University's satellite campuses?",
                "Are there plans to set up dropboxes in Bicol University's satellite campuses?",
                "Will dropbox services be extended to Bicol University's satellite campuses?",
                "Can we expect to find dropboxes at the satellite campuses of Bicol University?",
                "Will there be a provision for dropboxes in Bicol University's satellite campuses?",
                "Are there plans to establish drop-off locations in Bicol University's satellite campuses?",
                "Will Bicol University implement a system of dropboxes in its satellite campuses?",
                "Is there a proposal to introduce dropboxes at Bicol University's satellite campuses?",
                "Will there be designated areas for dropboxes in Bicol University's satellite campuses?",
                "Are there any considerations for installing dropboxes at Bicol University's satellite campuses?",
                "Will Bicol University include dropbox facilities in its satellite campuses?",
                "Are there plans to incorporate drop-off points in Bicol University's satellite campuses?",
                "Will there be drop-off services available at the satellite campuses of Bicol University?",
                "Is the installation of dropboxes being discussed for Bicol University's satellite campuses?",
                "Will there be designated drop-off points at Bicol University's satellite campuses?",
                "Are there plans to introduce dropbox systems at Bicol University's satellite campuses?",
                "Will Bicol University establish drop-off locations at its satellite campuses?",
                "Is the provision of dropboxes part of the development plan for Bicol University's satellite campuses?",
                "Will there be dropbox amenities at the satellite campuses of Bicol University?",
                "Are there any proposals to set up dropboxes in Bicol University's satellite campuses?",
                "Will there be a rollout of dropbox services at Bicol University's satellite campuses?",
                "Is there a plan to implement dropboxes for Bicol University's satellite campuses?",
                "Will there be drop-off points for students at Bicol University's satellite campuses?",
                "Are there any intentions to provide dropboxes at Bicol University's satellite campuses?",
                "Will drop-off facilities be included in the infrastructure of Bicol University's satellite campuses?",
                "Is there a proposal to establish dropboxes at Bicol University's satellite campuses?"
            ],
            "responses": [
                "Yes, there will be available dropboxes in satellite campuses of Bicol University.",
                "Yes, drop-off points will be provided at the satellite campuses of Bicol University.",
                "Indeed, dropboxes will be accessible at the satellite campuses of Bicol University.",
                "Certainly, there will be designated drop-off locations at Bicol University's satellite campuses.",
                "Absolutely, dropboxes will be installed at the satellite campuses of Bicol University.",
                "Without a doubt, there will be drop-off facilities at Bicol University's satellite campuses.",
                "Certainly, dropboxes will be set up at the satellite campuses of Bicol University.",
                "It is confirmed that drop-off points will be available at Bicol University's satellite campuses.",
                "Indeed, dropboxes will be present at the satellite campuses of Bicol University.",
                "Without question, drop-off boxes will be placed at Bicol University's satellite campuses.",
                "Certainly, there will be accessible drop-off locations at Bicol University's satellite campuses.",
                "Affirmative, there will be designated drop-off areas at Bicol University's satellite campuses.",
                "Absolutely, dropboxes will be provided at the satellite campuses of Bicol University.",
                "It is confirmed that drop-off points will be accessible at Bicol University's satellite campuses.",
                "Indeed, drop-off boxes will be installed at the satellite campuses of Bicol University.",
                "Without a doubt, there will be drop-off locations at Bicol University's satellite campuses.",
                "Certainly, dropboxes will be positioned at the satellite campuses of Bicol University.",
                "It is confirmed that drop-off facilities will be available at Bicol University's satellite campuses.",
                "Indeed, dropboxes will be situated at the satellite campuses of Bicol University.",
                "Without question, there will be designated drop-off spots at Bicol University's satellite campuses.",
                "Certainly, there will be accessible drop-off points at Bicol University's satellite campuses."
            ]
        },
        {
            "tag": "form 138",
            "patterns": [
                "Do we need to submit Form 138 for both Grade 11 and Grade 12 admission requirements?",
                "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 admission procedures?",
                "Must Form 138 (Report Card) be submitted for both Grade 11 and Grade 12 admission eligibility?",
                "Is it a requirement to provide Form 138 for both Grade 11 and Grade 12 admission criteria?",
                "Do we have to pass Form 138 for both Grade 11 and Grade 12 admission qualifications?",
                "Is Form 138 (Report Card) necessary for both Grade 11 and Grade 12 admission standards?",
                "Should Form 138 be submitted for both Grade 11 and Grade 12 admission assessments?",
                "Is it mandatory to pass Form 138 for both Grade 11 and Grade 12 admission processes?",
                "Must we submit Form 138 for both Grade 11 and Grade 12 admission evaluations?",
                "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission interviews?",
                "Do we need to present Form 138 for both Grade 11 and Grade 12 admission considerations?",
                "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 admission reviews?",
                "Should Form 138 (Report Card) be submitted for both Grade 11 and Grade 12 admission decisions?",
                "Is it a necessity to provide Form 138 for both Grade 11 and Grade 12 admission notifications?",
                "Do we have to pass Form 138 for both Grade 11 and Grade 12 admission confirmations?",
                "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission verifications?",
                "Must we submit Form 138 for both Grade 11 and Grade 12 admission validations?",
                "Is it mandatory to pass Form 138 for both Grade 11 and Grade 12 admission approvals?",
                "Should Form 138 (Report Card) be presented for both Grade 11 and Grade 12 admission acceptances?",
                "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 admission rejections?",
                "Do we need to submit Form 138 for both Grade 11 and Grade 12 admission deferrals?",
                "Is Form 138 (Report Card) necessary for both Grade 11 and Grade 12 admission waitlists?",
                "Must we pass Form 138 for both Grade 11 and Grade 12 admission appeals?",
                "Is it a requirement to submit Form 138 for both Grade 11 and Grade 12 admission reconsiderations?",
                "Should Form 138 (Report Card) be provided for both Grade 11 and Grade 12 admission disputes?",
                "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 admission grievances?",
                "Do we have to submit Form 138 for both Grade 11 and Grade 12 admission challenges?",
                "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission difficulties?",
                "Must we pass Form 138 for both Grade 11 and Grade 12 admission complications?",
                "Is it a necessity to submit Form 138 for both Grade 11 and Grade 12 admission obstacles?",
                "Should Form 138 (Report Card) be presented for both Grade 11 and Grade 12 admission hurdles?",
                "Is it mandatory to pass Form 138 for both Grade 11 and Grade 12 admission setbacks?",
                "Do we need to submit Form 138 for both Grade 11 and Grade 12 admission challenges?",
                "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission dilemmas?",
                "Is it compulsory to submit Form 138 for both Grade 11 and Grade 12 admission predicaments?",
                "Should Form 138 (Report Card) be provided for both Grade 11 and Grade 12 admission uncertainties?",
                "Do we have to pass Form 138 for both Grade 11 and Grade 12 admission complications?",
                "Is Form 138 required for both Grade 11 and Grade 12 admission confusions?",
                "Must we submit Form 138 for both Grade 11 and Grade 12 admission queries?",
                "Is it mandatory to pass Form 138 for both Grade 11 and Grade 12 admission inquiries?",
                "Should Form 138 (Report Card) be presented for both Grade 11 and Grade 12 admission requests?",
                "Is it a necessity to provide Form 138 for both Grade 11 and Grade 12 admission applications?",
                "Do we need to pass Form 138 for both Grade 11 and Grade 12 admission submissions?",
                "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission forms?",
                "Must we submit Form 138 for both Grade 11 and Grade 12 admission applications?",
                "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 admission procedures?",
                "Should Form 138 (Report Card) be submitted for both Grade 11 and Grade 12 admission protocols?",
                "Do we have to provide Form 138 for both Grade 11 and Grade 12 admission processes?",
                "Is it a requirement to pass Form 138 for both Grade 11 and Grade 12 admission formalities?",
                "Must Form 138 (Report Card) be submitted for both Grade 11 and Grade 12 admission steps?",
                "Is it mandatory to pass Form 138 for both Grade 11 and Grade 12 admission stages?",
                "Should Form 138 (Report Card) be presented for both Grade 11 and Grade 12 admission phases?",
                "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 admission components?",
                "Do we need to submit Form 138 for both Grade 11 and Grade 12 admission elements?",
                "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission aspects?",
                "Must we pass Form 138 for both Grade 11 and Grade 12 admission facets?",
                "Is it a necessity to submit Form 138 for both Grade 11 and Grade 12 admission dimensions?",
                "Should Form 138 (Report Card) be provided for both Grade 11 and Grade 12 admission attributes?",
                "Do we have to pass Form 138 for both Grade 11 and Grade 12 admission features?",
                "Is Form 138 required for both Grade 11 and Grade 12 admission characteristics?",
                "Must we submit Form 138 for both Grade 11 and Grade 12 admission traits?",
                "Is it mandatory to pass Form 138 for both Grade 11 and Grade 12 admission qualities?",
                "Should Form 138 (Report Card) be presented for both Grade 11 and Grade 12 admission specifications?",
                "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 admission standards?",
                "Do we need to submit Form 138 for both Grade 11 and Grade 12 admission benchmarks?",
                "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission criteria?",
                "Must we pass Form 138 for both Grade 11 and Grade 12 admission parameters?",
                "Is it a necessity to submit Form 138 for both Grade 11 and Grade 12 admission guidelines?",
                "Should Form 138 (Report Card) be provided for both Grade 11 and Grade 12 admission policies?",
                "Do we have to pass Form 138 for both Grade 11 and Grade 12 admission regulations?",
                "Is Form 138 required for both Grade 11 and Grade 12 admission rules?",
                "Must we submit Form 138 for both Grade 11 and Grade 12 admission standards?",
                "Is it mandatory to pass Form 138 for both Grade 11 and Grade 12 admission requirements?",
                "Should Form 138 (Report Card) be presented for both Grade 11 and Grade 12 admission prerequisites?",
                "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 admission conditions?",
                "Do we need to submit Form 138 for both Grade 11 and Grade 12 admission necessities?",
                "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission essentials?",
                "Must we pass Form 138 for both Grade 11 and Grade 12 admission prerequisites?",
                "Is it a necessity to submit Form 138 for both Grade 11 and Grade 12 admission qualifications?",
                "Should Form 138 (Report Card) be provided for both Grade 11 and Grade 12 admission eligibility?",
                "Do we have to pass Form 138 for both Grade 11 and Grade 12 admission qualifications?"
            ],
            "responses": [
                "The University Registrar has made it clear that the Grade 12 Report Card is obligatory for enrollment.",
                "According to the University Registrar's instructions, your Grade 12 Report Card must be sent.",
                "The Grade 12 Report Card stands out as a fundamental requisite for university enrollment, as emphasized by the office.",
                "As per the University Registrar's guidelines, only the Grade 12 Report Card is needed.",
                "The Grade 12 Report Card is highlighted as a primary condition for enrollment at the university, as per the University Registrar.",
                "The University Registrar has specified that sending your Grade 12 Report Card suffices.",
                "In line with the University Registrar's directives, the Grade 12 Report Card is indispensable.",
                "The University Registrar underscores the necessity of providing the Grade 12 Report Card for enrollment purposes.",
                "The Grade 12 Report Card is identified by the university office as a foundational requirement for enrollment.",
                "According to the University Registrar, enrollment necessitates the submission of the Grade 12 Report Card exclusively.",
                "The University Registrar emphasizes the importance of including the Grade 12 Report Card in your submission.",
                "As per the University Registrar's communication, your Grade 12 Report Card is the primary document required.",
                "The Grade 12 Report Card is stressed as a crucial document for university enrollment, according to the University Registrar."
            ]
        },
        {
            "tag": "CS",
            "patterns": [
                "Please share details about the courses present in the College of Science.",
                "I'm curious about the course options within the College of Science.",
                "Are there specific courses that the College of Science specializes in?:",
                "Inquire about the courses one can enroll in at the College of Science.",
                "What courses does the College of Science feature in its curriculum?",
                "Tell me about the array of courses within the College of Science.",
                "Can you elaborate on the courses available at the College of Science?",
                "Share some insights into the courses one can pursue at the College of Science.",
                "Enlighten me on the various courses that the College of Science provides.",
                "I would like to know about the course offerings in the College of Science."
            ],
            "responses": [
                "College of Science Courses(CS):\n 1. Bachelor of Science in Biology\n 2. Bachelor of Science in Chemistry\n 3. Bachelor of Science in Computer Science\n 4. Bachelor of Science in Information Technology\n 5. Bachelor of Science in Meteorology",
                "Courses Available in College of Science (CS):\n 1. Bachelor of Science in Biology\n 2. Bachelor of Science in Chemistry\n 3. Bachelor of Science in Computer Science\n 4. Bachelor of Science in Information Technology\n 5. Bachelor of Science in Meteorology",
                "Here is the list of available courses in College of Science (CS):\n 1. Bachelor of Science in Biology\n 2. Bachelor of Science in Chemistry\n 3. Bachelor of Science in Computer Science\n 4. Bachelor of Science in Information Technology\n 5. Bachelor of Science in Meteorology"
            ]
        },
        {
            "tag": "CSSP",
            "patterns": [
                "I'm curious about the course options within the College of Social Sciences and Philosophy (CSSP).",
                "Are there specific courses that the College of Social Sciences and Philosophy (CSSP)specializes in?",
                "What courses does the College of Social Sciences and Philosophy (CSSP)feature in its curriculum?",
                "Tell me about the array of courses within the College of Social Sciences and Philosophy (CSSP).",
                "Can you elaborate on the courses available at the College of Social Sciences and Philosophy (CSSP)?",
                "Share some insights into the courses one can pursue at the College of Social Sciences and Philosophy (CSSP).",
                "Enlighten me on the various courses that the College of Social Sciences and Philosophy (CSSP) provides.",
                "I would like to know about the course offerings in the College of Social Sciences and Philosophy (CSSP)."
            ],
            "responses": [
                "College of Social Sciences and Philosophy (CSSP) Courses:\n 1. AB Peace Studies\n 2. AB Philosophy\n 3. AB Political Science\n 4. AB Sociology\n 5. BS Psychology\n 6. BS Social Work",
                "Courses Available in Collge of Social Sciences and Philosophy (CSSP):\n 1. AB Peace Studies\n 2. AB Philosophy\n 3. AB Political Science\n 4. AB Sociology\n 5. BS Psychology\n 6. BS Social Work",
                "List of available courses in College of Social Sciences and Philosophy (CSSP):\n 1. AB Peace Studies\n 2. AB Philosophy\n 3. AB Political Science\n 4. AB Sociology\n 5. BS Psychology\n 6. BS Social Work"
            ]
        },
        {
            "tag": "BUTC",
            "patterns": [
                "I'm curious about the course options within the BU Tabaco (BUTC.",
                "Are there specific courses that the BU Tabaco (BUTC specializes in?",
                "What courses does the BU Tabaco (BUTC feature in its curriculum?",
                "Tell me about the array of courses within the BU Tabaco (BUTC",
                "Can you elaborate on the courses available at the BU Tabaco (BUTC?",
                "Share some insights into the courses one can pursue at the BU Tabaco (BUTC",
                "Enlighten me on the various courses that the BU Tabaco (BUTC.",
                "I would like to know about the course offerings in the BU Tabaco (BUTC"
            ],
            "responses": [
                "BU Tabaco (BUTC Courses:\n 1. Secondary Education Major in Science\n 2. Secondary Education Major in Math\n 3. BS Entrepreneurship\n 4. BS Fisheries\n 5.  BS Food Technology\n 6. BS Nursing\n 7.  BS Social Work",
                "Courses Available in BU Tabaco (BUTC:\n 1. Secondary Education Major in Science\n 2. Secondary Education Major in Math\n 3. BS Entrepreneurship\n 4. BS Fisheries\n 5.  BS Food Technology\n 6. BS Nursing\n 7.  BS Social Work",
                "List of courses at BU Tabaco (BUTC:\n 1. Secondary Education Major in Science\n 2. Secondary Education Major in Math\n 3. BS Entrepreneurship\n 4. BS Fisheries\n 5.  BS Food Technology\n 6. BS Nursing\n 7.  BS Social Work"
            ]
        },
        {
            "tag": "CE",
            "patterns": [
                "Please share details about the courses present in the College of Education (CE).",
                "I'm curious about the course options within the College of Education (CE).",
                "Are there specific courses that the College of Education (CE) specializes in?",
                "What courses does the College of Education (CE) feature in its curriculum?",
                "Tell me about the array of courses within the College of Education (CE)",
                "Can you elaborate on the courses available at the College of Education (CE)?",
                "Share some insights into the courses one can pursue at the College of Education (CE)",
                "Enlighten me on the various courses that the College of Education (CE) provides.",
                "I would like to know about the course offerings in the College of Education (CE)"
            ],
            "responses": [
                "College of Education (CE) Courses:\n 1. Early Childhood Education\n 2. Elementary Education\n 3. Secondary Education\n 4. Bachelor of Culture and Arts Education",
                "Courses Available in College of Education (CE):\n 1. Early Childhood Education\n 2. Elementary Education\n 3. Secondary Education\n 4. Bachelor of Culture and Arts Education",
                "List of courses in College of Education (CE):\n 1. Early Childhood Education\n 2. Elementary Education\n 3. Secondary Education\n 4. Bachelor of Culture and Arts Education"
            ]
        },
        {
            "tag": "BUGC",
            "patterns": [
                "Please share details about the courses present in the BU Gubat Campus (BUGC.",
                "I'm curious about the course options within the BU Gubat Campus (BUGC.",
                "Are there specific courses that the BU Gubat Campus (BUGC specializes in?",
                "What courses does the BU Gubat Campus (BUGC feature in its curriculum?",
                "Tell me about the array of courses within the BU Gubat Campus (BUGC",
                "Can you elaborate on the courses available at the BU Gubat Campus (BUGC?",
                "Share some insights into the courses one can pursue at the BU Gubat Campus (BUGC",
                "Enlighten me on the various courses that the BU Gubat Campus (BUGC provides.",
                "I would like to know about the course offerings in the BU Gubat Campus (BUGC"
            ],
            "responses": [
                "BU Gubat Campus (GC Courses:\n 1. Elementary Education\n 2. Secondary Education major in Filipino\n 3. Secondary Education major in Social Studies\n 4. BS Entrepreneurship\n 5. BSBA Major in Microfinance",
                "Courses in BU Gubat Campus (GC:\n 1. Elementary Education\n 2. Secondary Education major in Filipino\n 3. Secondary Education major in Social Studies\n 4. BS Entrepreneurship\n 5. BSBA Major in Microfinance",
                "List of courses in BU Gubat Campus (GC:\n 1. Elementary Education\n 2. Secondary Education major in Filipino\n 3. Secondary Education major in Social Studies\n 4. BS Entrepreneurship\n 5. BSBA Major in Microfinance"
            ]
        },
        {
            "tag": "CAL",
            "patterns": [
                "Please share details about the courses present in the College of Arts and Letters (CAL).",
                "I'm curious about the course options within the College of Arts and Letters (CAL).",
                "Are there specific courses that the College of Arts and Letters (CAL) specializes in?",
                "What courses does the College of Arts and Letters (CAL) feature in its curriculum?",
                "Tell me about the array of courses within the College of Arts and Letters (CAL)",
                "Can you elaborate on the courses available at the College of Arts and Letters (CAL)?",
                "Share some insights into the courses one can pursue at the College of Arts and Letters (CAL)",
                "Enlighten me on the various courses that the CCollege of Arts and Letters (CAL) provides.",
                "I would like to know about the course offerings in the College of Arts and Letters (CAL)"
            ],
            "responses": [
                "College of Arts and Letters (CAL) Courses:\n 1. AB Broadcasting\n 2. AB Communication\n 3.  AB English Language\n 4. AB Journalism\n 5. AB Performing Arts (BPeA) Theater\n 6. AB Literature",
                "Courses in College of Arts and Letters (CAL):\n 1. AB Broadcasting\n 2. AB Communication\n 3.  AB English Language\n 4. AB Journalism\n 5. AB Performing Arts (BPeA) Theater\n 6. AB Literature",
                "List of courses College of Arts and Letters (CAL):\n 1. AB Broadcasting\n 2. AB Communication\n 3.  AB English Language\n 4. AB Journalism\n 5. AB Performing Arts (BPeA) Theater\n 6. AB Literature"
            ]
        },
        {
            "tag": "IDeA",
            "patterns": [
                "Please share details about the courses present in the Institute of Design and Architecture (IDeA)?",
                "I'm curious about the course options within the Institute of Design and Architecture (IDeA)?",
                "Are there specific courses that the Institute of Design and Architecture (IDeA) specializes in?",
                "Inquire about the courses one can enroll in at the Institute of Design and Architecture (IDeA)?.",
                "What courses does the Institute of Design and Architecture (IDeA) feature in its curriculum?",
                "Tell me about the array of courses within the Institute of Design and Architecture (IDeA)?",
                "Can you elaborate on the courses available at the Institute of Design and Architecture (IDeA)?",
                "Share some insights into the courses one can pursue at the Institute of Design and Architecture (IDeA)?",
                "Enlighten me on the various courses that the Institute of Design and Architecture (IDeA) provides.",
                "I would like to know about the course offerings in the Institute of Design and Architecture (IDeA)?"
            ],
            "responses": [
                "Institute of Design and Architecture (IDeA) Courses:\n 1. BS Architecture",
                "Courses in Institute of Design and Architecture (IDeA):\n 1. BS Architecture",
                "List of available courses in Institute of Design and Architecture (IDeA):\n 1. BS Architecture"
            ]
        },
        {
            "tag": "CN",
            "patterns": [
                "I'm seeking details about the courses offered within the College of Nursing (CN) encompasses?",
                "What courses can a student expect to find in the College of Nursing (CN) encompasses?",
                "Provide an overview of the courses in the  College of Nursing (CN) encompasses?",
                "List down the courses that fall under the purview of the College of Nursing (CN) encompasses?",
                "Share information about the different courses one can take up at the College of Nursing (CN) encompasses?",
                "Could you provide a comprehensive list of courses in the College of Nursing (CN) encompasses?",
                "Elaborate on the courses available for students within the College of Nursing (CN) encompasses?",
                "What academic courses are available for enrollment at the College of Nursing (CN)",
                "Enlighten me on the subject matter covered in the courses at the College of Nursing (CN)",
                "Can you brief me on the academic offerings of the College of Nursing (CN)"
            ],
            "responses": [
                "College of Nursing (CN) Courses:\n 1. BS Nursing",
                "Courses in College of Nursing (CN):\n 1. BS Nursing",
                "List of courses College of Nursing (CN):\n 1. BS Nursing"
            ]
        },
        {
            "tag": "JMRIGD",
            "patterns": [
                "Please share details about the courses present in the Jesse M. Robredo Institute of Governance and Development (JMRIGD)",
                "I'm curious about the course options within the Jesse M. Robredo Institute of Governance and Development (JMRIGD)",
                "Are there specific courses that the Jesse M. Robredo Institute of Governance and Development (JMRIGD) specializes in?",
                "What courses does the Jesse M. Robredo Institute of Governance and Development (JMRIGD) feature in its curriculum?",
                "Tell me about the array of courses within the Jesse M. Robredo Institute of Governance and Development (JMRIGD)",
                "Can you elaborate on the courses available at the Jesse M. Robredo Institute of Governance and Development (JMRIGD)",
                "Share some insights into the courses one can pursue at the Jesse M. Robredo Institute of Governance and Development (JMRIGD)",
                "Enlighten me on the various courses that the Jesse M. Robredo Institute of Governance and Development (JMRIGD) provides.",
                "I would like to know about the course offerings in the Jesse M. Robredo Institute of Governance and Development (JMRIGD)"
            ],
            "responses": [
                "Jesse M. Robredo Institute of Governance and Development (JMRIGD) Courses:\n 1. Public Administration",
                "Courses in Jesse M. Robredo Institute of Governance and Development (JMRIGD):\n 1. Public Administration",
                "List of courses in Jesse M. Robredo Institute of Governance and Development (JMRIGD):\n 1. Public Administration"
            ]
        },
        {
            "tag": "IPESR",
            "patterns": [
                "What kind of courses are available in the Institute of Physical Education, Sports and Recreation (IPESR)?",
                "Please share details about the courses present in the Institute of Physical Education, Sports and Recreation (IPESR)",
                "I'm curious about the course options within the Institute of Physical Education, Sports and Recreation (IPESR)",
                "Are there specific courses that the Institute of Physical Education, Sports and Recreation (IPESR) specializes in?",
                "What courses does the Institute of Physical Education, Sports and Recreation (IPESR) feature in its curriculum?",
                "Tell me about the array of courses within the Institute of Physical Education, Sports and Recreation (IPESR)",
                "Can you elaborate on the courses available at the Institute of Physical Education, Sports and Recreation (IPESR)",
                "Share some insights into the courses one can pursue at the Institute of Physical Education, Sports and Recreation (IPESR)",
                "Enlighten me on the various courses that the Institute of Physical Education, Sports and Recreation (IPESR) provides.",
                "I would like to know about the course offerings in the Institute of Physical Education, Sports and Recreation (IPESR)"
            ],
            "responses": [
                "Institute of Physical Education, Sports and Recreation (IPESR) Courses:\n 1. BS in Exercise & Sports Sciences\n 2. Bachelor of Physical Education",
                "Courses in Institute of Physical Education, Sports and Recreation (IPESR)?:\n 1. BS in Exercise & Sports Sciences\n 2. Bachelor of Physical Education",
                "List of courses in Institute of Physical Education, Sports and Recreation (IPESR)?:\n 1. BS in Exercise & Sports Sciences\n 2. Bachelor of Physical Education"
            ]
        },
        {
            "tag": "CBEM",
            "patterns": [
                "What kind of courses are available in the College of Business, Economics and Management (CBEM)",
                "Please share details about the courses present in the College of Business, Economics and Management (CBEM)",
                "I'm curious about the course options within the College of Business, Economics and Management (CBEM)",
                "Are there specific courses that the College of Business, Economics and Management (CBEM) specializes in?",
                "What courses does the College of Business, Economics and Management (CBEM) feature in its curriculum?",
                "Tell me about the array of courses within the College of Business, Economics and Management (CBEM)",
                "Can you elaborate on the courses available at the College of Business, Economics and Management (CBEM)",
                "Share some insights into the courses one can pursue at the College of Business, Economics and Management (CBEM)",
                "Enlighten me on the various courses that the College of Business, Economics and Management (CBEM)",
                "I would like to know about the course offerings in the College of Business, Economics and Management (CBEM)"
            ],
            "responses": [
                "College of Business, Economics and Management (CBEM) Courses:\n 1. BS Accountancy\n 2. BS Economics\n 3. BS Entrepreneurship\n 4. BSBA Major in Financial Management\n 5. BSBA Major in Human Resource Management\n 6. BS Management\n 7. BSBA Major in Marketing Management\n 8. BSBA Microfinance\n 9. BSBA Major in Operations Management",
                "Courses at College of Business, Economics and Management (CBEM):\n 1. BS Accountancy\n 2. BS Economics\n 3. BS Entrepreneurship\n 4. BSBA Major in Financial Management\n 5. BSBA Major in Human Resource Management\n 6. BS Management\n 7. BSBA Major in Marketing Management\n 8. BSBA Microfinance\n 9. BSBA Major in Operations Management",
                "List of courses in College of Business, Economics and Management (CBEM):\n 1. BS Accountancy\n 2. BS Economics\n 3. BS Entrepreneurship\n 4. BSBA Major in Financial Management\n 5. BSBA Major in Human Resource Management\n 6. BS Management\n 7. BSBA Major in Marketing Management\n 8. BSBA Microfinance\n 9. BSBA Major in Operations Management"
            ]
        },
        {
            "tag": "CIT",
            "patterns": [
                "What kind of courses are available in the College of Industrial Technology (CIT)",
                "Please share details about the courses present in the College of Industrial Technology (CIT)",
                "I'm curious about the course options within the College of Industrial Technology (CIT)",
                "Are there specific courses that the College of Industrial Technology (CIT)specializes in?",
                "What courses does the College of Industrial Technology (CIT) feature in its curriculum?",
                "Tell me about the array of courses within the College of Industrial Technology (CIT)",
                "Can you elaborate on the courses available at the College of Industrial Technology (CIT)",
                "Share some insights into the courses one can pursue at the College of Industrial Technology (CIT)",
                "Enlighten me on the various courses that the College of Industrial Technology (CIT)",
                "I would like to know about the course offerings in the College of Industrial Technology (CIT)"
            ],
            "responses": [
                "College of Industrial Technology (CIT) Courses:\n 1. BS Automotive Technology\n 2. BS Civil Technology\n 3. BS Electrical Technology\n 4. BS Electronics Technology\n 5. BS Mechanical Technology\n 6. BS Food Technology\n 7. Industrial Design\n 8. Technical - Vocational Teacher Educ. Major in Drafting Technology\n 9. Technical - Vocational Teacher Educ. Major in Electrical Technology\n 10. Technical - Vocational Teacher Educ. Major in Food Service Management\n 11. Technical - Vocational Teacher Educ. Major in Garments Fashion and Design",
                "Courses in College of Industrial Technology (CIT):\n 1. BS Automotive Technology\n 2. BS Civil Technology\n 3. BS Electrical Technology\n 4. BS Electronics Technology\n 5. BS Mechanical Technology\n 6. BS Food Technology\n 7. Industrial Design\n 8. Technical - Vocational Teacher Educ. Major in Drafting Technology\n 9. Technical - Vocational Teacher Educ. Major in Electrical Technology\n 10. Technical - Vocational Teacher Educ. Major in Food Service Management\n 11. Technical - Vocational Teacher Educ. Major in Garments Fashion and Design",
                "List of courses College of Industrial Technology (CIT):\n 1. BS Automotive Technology\n 2. BS Civil Technology\n 3. BS Electrical Technology\n 4. BS Electronics Technology\n 5. BS Mechanical Technology\n 6. BS Food Technology\n 7. Industrial Design\n 8. Technical - Vocational Teacher Educ. Major in Drafting Technology\n 9. Technical - Vocational Teacher Educ. Major in Electrical Technology\n 10. Technical - Vocational Teacher Educ. Major in Food Service Management\n 11. Technical - Vocational Teacher Educ. Major in Garments Fashion and Design"
            ]
        },
        {
            "tag": "CENG",
            "patterns": [
                "Please share details about the courses present in the College of Engineering (CENG)",
                "I'm curious about the course options within the College of Engineering (CENG)",
                "Are there specific courses that the College of Engineering (CENG) specializes in?",
                "What courses does the College of Engineering (CENG) feature in its curriculum?",
                "Tell me about the array of courses within the College of Engineering (CENG)",
                "Can you elaborate on the courses available at the College of Engineering (CENG)",
                "Share some insights into the courses one can pursue at the College of Engineering (CENG)",
                "Enlighten me on the various courses that the College of Engineering (CENG)",
                "I would like to know about the course offerings in the College of Engineering (CENG)"
            ],
            "responses": [
                "College of Engineering (CENG) Courses:\n 1. BS Chemical Engineering\n 2. BS Civil Engineering\n 3. BS Electrical Engineering\n 4. BS Geodetic Engineering\n 5. BS Mechanical Engineering\n 6. BS Mining Engineering",
                "Courses in College of Engineering (CENG):\n 1. BS Chemical Engineering\n 2. BS Civil Engineering\n 3. BS Electrical Engineering\n 4. BS Geodetic Engineering\n 5. BS Mechanical Engineering\n 6. BS Mining Engineering",
                "List of courses in College of Engineering (CENG):\n 1. BS Chemical Engineering\n 2. BS Civil Engineering\n 3. BS Electrical Engineering\n 4. BS Geodetic Engineering\n 5. BS Mechanical Engineering\n 6. BS Mining Engineering"
            ]
        },
        {
            "tag": "BUCAF",
            "patterns": [
                "Please share details about the courses present in the Bicol University Guinobatan",
                "I'm curious about the course options within the Bicol University Guinobatan",
                "Are there specific courses that the Bicol University Guinobatan specializes in?",
                "What courses does the Bicol University Guinobatan feature in its curriculum?",
                "Tell me about the array of courses within the Bicol University Guinobatan",
                "Can you elaborate on the courses available at the Bicol University Guinobatan",
                "Share some insights into the courses one can pursue at the Bicol University Guinobatan",
                "Enlighten me on the various courses that the Bicol University Guinobatan",
                "I would like to know about the course offerings in the Bicol University Guinobatan"
            ],
            "responses": [
                "Bicol University Guinobatan Courses:\n 1. BS Agribusiness\n 2. BS Agricultural & Biosystems Engineering\n 3. BS Agriculture\n 4. BS Forestry\n 5. Technical - Vocational Teacher Educ. Major in Animal Production\n 6. Technical - Vocational Teacher Educ. Major in Agricultural Crop Production\n 7. BS Food Technology\n 8. Doctor of Veterinary Medicine",
                "Courses in Bicol University Guinobatan:\n 1. BS Agribusiness\n 2. BS Agricultural & Biosystems Engineering\n 3. BS Agriculture\n 4. BS Forestry\n 5. Technical - Vocational Teacher Educ. Major in Animal Production\n 6. Technical - Vocational Teacher Educ. Major in Agricultural Crop Production\n 7. BS Food Technology\n 8. Doctor of Veterinary Medicine",
                "List of courses in Bicol University Guinobatan:\n 1. BS Agribusiness\n 2. BS Agricultural & Biosystems Engineering\n 3. BS Agriculture\n 4. BS Forestry\n 5. Technical - Vocational Teacher Educ. Major in Animal Production\n 6. Technical - Vocational Teacher Educ. Major in Agricultural Crop Production\n 7. BS Food Technology\n 8. Doctor of Veterinary Medicine"
            ]
        },
        {
            "tag": "BUPC",
            "patterns": [
                "Please share details about the courses present in the BU Polangui",
                "I'm curious about the course options within the Bicol University Polangui",
                "Are there specific courses that the Bicol University Polangui specializes in?",
                "What courses does the Bicol University Polangui feature in its curriculum?",
                "Tell me about the array of courses within the Bicol University Polangui",
                "Can you elaborate on the courses available at the Bicol University Polangui",
                "Share some insights into the courses one can pursue at the Bicol University Polangui",
                "Enlighten me on the various courses that the Bicol University Polangui",
                "I would like to know about the course offerings in the Bicol University Polangui"
            ],
            "responses": [
                "Bicol University Polangui Courses:\n 1. Elementary Education\n 2. Secondary Education Major in English\n 3. Secondary Education Major in Math\n 4. BS Automotive Technology\n 5. BS Computer Engineering\n 6. BS Computer Science\n 7. BS Electronics Engineering\n 8. BS Electronics Technology\n 9. BS Entrepreneurship\n 10. BS Information System\n 11. BS Information Technology\n 12. BS Information Technology (Animation)\n 13. BS Mechanical Technology\n 14. BS Nursing\n 15. Technology and Livelihood Education (BTLed-ICT)\n 16. Technology and Livelihood Education (BTLEd-Home Economics)",
                "Courses in Bicol University Polangui:\n 1. Elementary Education\n 2. Secondary Education Major in English\n 3. Secondary Education Major in Math\n 4. BS Automotive Technology\n 5. BS Computer Engineering\n 6. BS Computer Science\n 7. BS Electronics Engineering\n 8. BS Electronics Technology\n 9. BS Entrepreneurship\n 10. BS Information System\n 11. BS Information Technology\n 12. BS Information Technology (Animation)\n 13. BS Mechanical Technology\n 14. BS Nursing\n 15. Technology and Livelihood Education (BTLed-ICT)\n 16. Technology and Livelihood Education (BTLEd-Home Economics)",
                "List of courses in Bicol University Polangui:\n 1. Elementary Education\n 2. Secondary Education Major in English\n 3. Secondary Education Major in Math\n 4. BS Automotive Technology\n 5. BS Computer Engineering\n 6. BS Computer Science\n 7. BS Electronics Engineering\n 8. BS Electronics Technology\n 9. BS Entrepreneurship\n 10. BS Information System\n 11. BS Information Technology\n 12. BS Information Technology (Animation)\n 13. BS Mechanical Technology\n 14. BS Nursing\n 15. Technology and Livelihood Education (BTLed-ICT)\n 16. Technology and Livelihood Education (BTLEd-Home Economics)"
            ]
        },
        {
            "tag": "CDM",
            "patterns": [
                "Please share details about the courses present in the College of Dental Medicine (CDM)",
                "I'm curious about the course options within the College of Dental Medicine (CDM)",
                "Are there specific courses that the College of Dental Medicine (CDM) specializes in?",
                "Inquire about the courses one can enroll in at the College of Dental Medicine (CDM)",
                "What courses does the College of Dental Medicine (CDM) feature in its curriculum?",
                "Tell me about the array of courses within the College of Dental Medicine (CDM)",
                "Can you elaborate on the courses available at the College of Dental Medicine (CDM)",
                "Share some insights into the courses one can pursue at the College of Dental Medicine (CDM)",
                "Enlighten me on the various courses that the College of Dental Medicine (CDM)",
                "I would like to know about the course offerings in the College of Dental Medicine (CDM)"
            ],
            "responses": [
                "Courses Available at the College of Dental Medicine (CDM): 1. Doctor of Dental Medicine",
                "Courses Available at the College of Dental Medicine (CDM): 1. Doctor of Dental Medicine",
                "Courses Available at the College of Dental Medicine (CDM): 1. Doctor of Dental Medicine"
            ]
        },
        {
            "tag": "general requirements",
            "patterns": [
                "How to admit in BU",
                "How can I ensure a successful application for BUCET 202*-202*?",
                "I'm planning to apply for BUCET 202*-202*; what advice do you have?",
                "What are the key components of the BUCET 202*-202* application?",
                "Can I apply for BUCET 202*-202* if I'm an international student?",
                "Is there a deadline for submitting the BUCET 202*-202* application?",
                "I'd like to know more about the BUCET 202*-202* application requirements.",
                "Where can I find information on the BUCET 202*-202* admission process?",
                "What are the important dates for BUCET 202*-202* application?",
                "Can you provide tips for a successful BUCET 202*-202* application?",
                "Are there any specific instructions for completing the BUCET 202*-202* application form?",
                "What's the acceptance rate for applicants to BUCET 202*-202*?",
                "I'd like to know more about the BUCET 202*-202* application interview process.",
                "Can I apply for BUCET 202*-202* if I have a gap year in my education?",
                "How does the BUCET 202*-202* application process differ for transfer students?",
                "Are there any pre-requisite courses required for BUCET 202*-202* application?",
                "Can I apply for BUCET 202*-202* if I have a non-traditional educational background?",
                "What should I include in my personal statement for BUCET 202*-202*?",
                "Is there a separate application fee for BUCET 202*-202*?",
                "Can I apply for BUCET 202*-202* if I'm still completing my undergraduate degree?",
                "What steps should I take to request application fee waivers for BUCET 202*-202*?",
                "Are there any specific GPA requirements for BUCET 202*-202* applicants?",
                "Can I apply for BUCET 202*-202* if I'm a mature student?",
                "Are there any specific health requirements for BUCET 202*-202* applicants?",
                "Can I apply for BUCET 202*-202* if I have international qualifications?",
                "How are letters of recommendation handled in the BUCET 202*-202* application process?",
                "Are there any specific format requirements for submitting documents for BUCET 202*-202*?",
                "Can I apply for BUCET 202*-202* if I have work experience instead of academic qualifications?",
                "What is the application fee structure for BUCET 202*-202*?",
                "Can I apply for BUCET 202*-202* if I don't meet the minimum admission requirements?",
                "Is there a preference for certain majors or fields of study in BUCET 202*-202*?",
                "Can I apply for BUCET 202*-202* if I'm a high school student?",
                "What are the steps for reapplying to BUCET 202*-202* if my previous application was not successful?",
                "Are there any specific requirements for international students applying to BUCET 202*-202*?",
                "Can I apply for BUCET 202*-202* if I have a disability or special needs?",
                "What should I do if I encounter technical issues while submitting my BUCET 202*-202* application online?",
                "Can I apply for BUCET 202*-202* if English is not my first language?",
                "How long does it typically take to receive a decision on my BUCET 202*-202* application?",
                "Can I apply for BUCET 202*-202* if I have attended multiple colleges?",
                "Can I apply for BUCET 202*-202* if I have completed courses at another institution?",
                "Are there any specific admission interviews for BUCET 202*-202* applicants?"
            ],
            "responses": [
                "Check out the following! \n I. General Requirements:\n 1. You must be a high school senior of a DepEd-recognized high school and expecting to graduate at the end of the school year; OR\n 2. A senior high school graduate who has not taken and/or is not taking any college subjects or an ALS graduate who has not enrolled in any college course is eligible to apply.\n II. Specific Requirements:\n 1. To apply, go to https://buao.bicol-u.edu.ph/bucet_online/bucetapply.php and fill out the online application form. Make sure to use a computer/device with a good internet connection upon online registration.\n 2. Two(2) copies of 2x2 recent, unedited or unfiltered studio-taken photograph of the applicant in white background with the applicant's signature and name tag below;\n 3. Grade 9 and Grade 11 High School academic ratings affixed at the reversed side of the BUCET Application Form and duly signed by the School Principal and has a school dry seal;\n 4. Authenticated Photocopies of Grade 9-11 SF10 (Formerly Form 137) and Grade 12 SF9(Formerly Form 138) For Senior High School Graduates who have not taken any college subject. For ALS graduates, submit your ALS Certificate of Rating and Certificate of Completion. DO NOT SUBMIT the original copies unless required by the office to be presented for authentication purposes.\n 5. Photocopy of Person with Disability (PWD) ID under RA No. 7277 (if applicable only);\n 6. Photocopy of parent's Solo Parent ID under RA No. 11861 (if applicable only);\n 7. Copy of Parent's latest Income Tax Return (ITR) or Certificate of Tax Exemption from the Bureau of Internal Revenue (BIR);\n 8. Accomplished NCIP-COC Form 4 or downloadable Certificate of Membership from the National Commission on Indigenous Peoples (NCIP) Regional Office, if the applicant is a member of ethnolinguistic groups (Indigenous Peoples groups);\n 9. Certification from the Barangay if the applicant is a resident of or comes from Geographically-Isolated and Disadvantaged Areas, (GIDA) under RA No. 11148, please refer to this link GIDA List 2022;\n 10. Certification from DSWD if a member of 4P's (Pantawid Pamilyang Pilipino Program);\n 11. One long-sized window mailing envelope with Php 50.00 worth of mailing stamps from the Postal Office attached to the upper right-hand corner for mailing results;\n",
                "I hope this helps!\n I. General Requirements:\n 1. You must be a high school senior of a DepEd-recognized high school and expecting to graduate at the end of the school year; OR\n 2. A senior high school graduate who has not taken and/or is not taking any college subjects or an ALS graduate who has not enrolled in any college course is eligible to apply.\n II. Specific Requirements:\n 1. To apply, go to https://buao.bicol-u.edu.ph/bucet_online/bucetapply.php and fill out the online application form. Make sure to use a computer/device with a good internet connection upon online registration.\n 2. Two(2) copies of 2x2 recent, unedited or unfiltered studio-taken photograph of the applicant in white background with the applicant's signature and name tag below;\n 3. Grade 9 and Grade 11 High School academic ratings affixed at the reversed side of the BUCET Application Form and duly signed by the School Principal and has a school dry seal;\n 4. Authenticated Photocopies of Grade 9-11 SF10 (Formerly Form 137) and Grade 12 SF9(Formerly Form 138) For Senior High School Graduates who have not taken any college subject. For ALS graduates, submit your ALS Certificate of Rating and Certificate of Completion. DO NOT SUBMIT the original copies unless required by the office to be presented for authentication purposes.\n 5. Photocopy of Person with Disability (PWD) ID under RA No. 7277 (if applicable only);\n 6. Photocopy of parent's Solo Parent ID under RA No. 11861 (if applicable only);\n 7. Copy of Parent's latest Income Tax Return (ITR) or Certificate of Tax Exemption from the Bureau of Internal Revenue (BIR);\n 8. Accomplished NCIP-COC Form 4 or downloadable Certificate of Membership from the National Commission on Indigenous Peoples (NCIP) Regional Office, if the applicant is a member of ethnolinguistic groups (Indigenous Peoples groups);\n 9. Certification from the Barangay if the applicant is a resident of or comes from Geographically-Isolated and Disadvantaged Areas, (GIDA) under RA No. 11148, please refer to this link GIDA List 2022;\n 10. Certification from DSWD if a member of 4P's (Pantawid Pamilyang Pilipino Program);\n 11. One long-sized window mailing envelope with Php 50.00 worth of mailing stamps from the Postal Office attached to the upper right-hand corner for mailing results;\n",
                "Check this out.\n I. General Requirements:\n 1. You must be a high school senior of a DepEd-recognized high school and expecting to graduate at the end of the school year; OR\n 2. A senior high school graduate who has not taken and/or is not taking any college subjects or an ALS graduate who has not enrolled in any college course is eligible to apply.\n II. Specific Requirements:\n 1. To apply, go to https://buao.bicol-u.edu.ph/bucet_online/bucetapply.php and fill out the online application form. Make sure to use a computer/device with a good internet connection upon online registration.\n 2. Two(2) copies of 2x2 recent, unedited or unfiltered studio-taken photograph of the applicant in white background with the applicant's signature and name tag below;\n 3. Grade 9 and Grade 11 High School academic ratings affixed at the reversed side of the BUCET Application Form and duly signed by the School Principal and has a school dry seal;\n 4. Authenticated Photocopies of Grade 9-11 SF10 (Formerly Form 137) and Grade 12 SF9(Formerly Form 138) For Senior High School Graduates who have not taken any college subject. For ALS graduates, submit your ALS Certificate of Rating and Certificate of Completion. DO NOT SUBMIT the original copies unless required by the office to be presented for authentication purposes.\n 5. Photocopy of Person with Disability (PWD) ID under RA No. 7277 (if applicable only);\n 6. Photocopy of parent's Solo Parent ID under RA No. 11861 (if applicable only);\n 7. Copy of Parent's latest Income Tax Return (ITR) or Certificate of Tax Exemption from the Bureau of Internal Revenue (BIR);\n 8. Accomplished NCIP-COC Form 4 or downloadable Certificate of Membership from the National Commission on Indigenous Peoples (NCIP) Regional Office, if the applicant is a member of ethnolinguistic groups (Indigenous Peoples groups);\n 9. Certification from the Barangay if the applicant is a resident of or comes from Geographically-Isolated and Disadvantaged Areas, (GIDA) under RA No. 11148, please refer to this link GIDA List 2022;\n 10. Certification from DSWD if a member of 4P's (Pantawid Pamilyang Pilipino Program);\n 11. One long-sized window mailing envelope with Php 50.00 worth of mailing stamps from the Postal Office attached to the upper right-hand corner for mailing results;\n"
            ]
        },
        {
            "tag": "submitting requirements",
            "patterns": [
                "Break down the sequential steps for the BUCET requirements submission process.",
                "Could you offer guidance on the proper way to submit the BUCET requirements?",
                "Provide a stepwise explanation of the BUCET requirements submission process.",
                "What are the guidelines for submitting the BUCET requirements?",
                "Explain the steps to take when submitting the BUCET requirements.",
                "Can you describe the proper method for submitting the BUCET requirements?",
                "Break down the process of submitting the BUCET requirements into manageable steps.",
                "I'm seeking clarity on the steps required for BUCET requirements submission; can you help?",
                "Could you provide a detailed walkthrough of the BUCET requirements submission process?",
                "Share the specific instructions for properly submitting the BUCET requirements.",
                "What are the precise steps to follow when submitting the BUCET requirements?",
                "I'm looking for a concise guide on how to submit the BUCET requirements; can you assist?",
                "Enlighten me on the intricacies of the BUCET requirements submission process.",
                "Can you simplify the process of submitting the BUCET requirements for me?",
                "Provide a clear breakdown of the sequential process for BUCET requirements submission.",
                "What is the proper protocol for turning in the BUCET requirements?",
                "Could you walk me through the required actions for submitting the BUCET requirements?",
                "What are the specific requirements for the formal submission of BUCET documents?",
                "Clarify the necessary steps for successfully submitting the BUCET requirements.",
                "I'm looking for guidance on the correct method for submitting the BUCET requirements.",
                "Can you explain the formalities involved in the submission of BUCET requirements?",
                "Break down the process of submitting the BUCET requirements into distinct stages.",
                "What are the key components of the BUCET requirements submission process?",
                "I'm seeking clarity on the procedural steps for submitting the BUCET requirements.",
                "Can you explain the intricacies of the BUCET requirements submission procedure?",
                "Provide a step-by-step guide on how to formally submit the BUCET requirements.",
                "What specific actions are required for the proper submission of BUCET requirements?",
                "Enlighten me on the procedural details of submitting the BUCET requirements.",
                "Could you provide a comprehensive overview of the BUCET requirements submission process?",
                "Break down the steps necessary for completing the BUCET requirements submission.",
                "Clarify the protocol for turning in the BUCET requirements for evaluation.",
                "Can you guide me through the stages of submitting the BUCET requirements?",
                "What is the correct way to initiate the submission of BUCET requirements?",
                "I'm unfamiliar with the process; could you provide a detailed guide on BUCET requirements submission?",
                "Explain the required steps for submitting the BUCET requirements in detail.",
                "Can you outline the proper procedure for submitting the BUCET requirements?",
                "Provide insights into the specific actions needed for BUCET requirements submission.",
                "Break down the process of submitting the BUCET requirements step by step.",
                "What are the formalities involved in the submission of BUCET requirements?",
                "Can you explain the correct way to submit the BUCET requirements for assessment?",
                "Clarify the specific steps needed for the successful submission of BUCET requirements.",
                "I'm looking for guidance on the appropriate method for submitting the BUCET requirements.",
                "Enlighten me on the procedural intricacies of the BUCET requirements submission.",
                "What is the proper protocol for turning in the BUCET requirements for consideration?",
                "Could you walk me through the sequential steps of submitting the BUCET requirements?",
                "What are the formal requirements for initiating the submission of BUCET requirements?",
                "Explain the process of submitting the BUCET requirements in a detailed manner.",
                "Can you provide a stepwise breakdown of the BUCET requirements submission process?",
                "I'm seeking clarity on the detailed steps involved in submitting the BUCET requirements.",
                "Could you elaborate on the proper method for submitting the BUCET requirements?",
                "What specific actions are required to ensure the successful submission of BUCET requirements?",
                "Break down the procedural steps for the formal submission of the BUCET requirements.",
                "Can you guide me through the necessary stages of submitting the BUCET requirements?",
                "Clarify the steps involved in the proper submission of BUCET requirements.",
                "Provide a comprehensive guide on how to submit the BUCET requirements accurately.",
                "What are the formalities to follow when initiating the submission of BUCET requirements?",
                "I'm unfamiliar with the process; could you provide a detailed explanation of BUCET requirements submission?",
                "Explain the procedural details of submitting the BUCET requirements in a step-by-step manner.",
                "Can you outline the correct procedure for turning in the BUCET requirements?",
                "Enlighten me on the intricacies of the formal submission process for BUCET requirements.",
                "What is the proper way to initiate the submission of BUCET requirements?",
                "Break down the specific actions required for the successful submission of BUCET requirements."
            ],
            "responses": [
                "To submit your BUCET requirements, check out the steps below\n 1. Print out the PDF copy of your BUCET Application Form. Use legal size (8.5x13) bond paper for printing the form;\n 2. Give the BUCET Application Form to your High School Registrar/Principal/School Head to fill out the SECONDARY RECORD FORM on the back page of your BUCET Application Form. Make sure your School Principal/Head has signed the BUCET Application Form and has a dry seal of your school;\n 3. The following options are provided on how to submit your BUCET application documents:\n    Option 1: Submit your BUCET Application requirements to your High School Counselor or to any authorized school representative;\n    Option 2: Submit your BUCET Application requirements to the Bicol University Admissions Office (ONSITE) during your appointed submission date;\n    Option 3: Mail your BUCET Application documents through any courier service available in your locality;\n 4. Assigned BUAO personnel will check and validate your requirements;\n 5. Claim your Test Permit from your High School Counselor or authorized school representative if you chose Option 1; from BUAO if you chose Option 2. For Option 3, your temporary test permit will be emailed to you at your official email address;\n 6. Bring your Test Permit and Vaccination Card during your scheduled examination. For applicants who are not yet vaccinated, kindly present an Anti-gen test result conducted a day before your scheduled examination;\n    Only fully-vaccinated students shall be allowed to take the examination. Unvaccinated students shall be required to present a valid RT-PCR or Antigen test taken a day before the examination date for them to be allowed to take the BUCET. An examinee who feels sick or indisposed, complains of COVID-like symptoms, or registers body temperature above the normal range during examination day shall be rescheduled.",
                "How to submit BUCET requirements?\n 1. Print out the PDF copy of your BUCET Application Form. Use legal size (8.5x13) bond paper for printing the form;\n 2. Give the BUCET Application Form to your High School Registrar/Principal/School Head to fill out the SECONDARY RECORD FORM on the back page of your BUCET Application Form. Make sure your School Principal/Head has signed the BUCET Application Form and has a dry seal of your school;\n 3. The following options are provided on how to submit your BUCET application documents:\n    Option 1: Submit your BUCET Application requirements to your High School Counselor or to any authorized school representative;\n    Option 2: Submit your BUCET Application requirements to the Bicol University Admissions Office (ONSITE) during your appointed submission date;\n    Option 3: Mail your BUCET Application documents through any courier service available in your locality;\n 4. Assigned BUAO personnel will check and validate your requirements;\n 5. Claim your Test Permit from your High School Counselor or authorized school representative if you chose Option 1; from BUAO if you chose Option 2. For Option 3, your temporary test permit will be emailed to you at your official email address;\n 6. Bring your Test Permit and Vaccination Card during your scheduled examination. For applicants who are not yet vaccinated, kindly present an Anti-gen test result conducted a day before your scheduled examination;\n    Only fully-vaccinated students shall be allowed to take the examination. Unvaccinated students shall be required to present a valid RT-PCR or Antigen test taken a day before the examination date for them to be allowed to take the BUCET. An examinee who feels sick or indisposed, complains of COVID-like symptoms, or registers body temperature above the normal range during examination day shall be rescheduled.",
                "Submission steps of BUCET requirements\n 1. Print out the PDF copy of your BUCET Application Form. Use legal size (8.5x13) bond paper for printing the form;\n 2. Give the BUCET Application Form to your High School Registrar/Principal/School Head to fill out the SECONDARY RECORD FORM on the back page of your BUCET Application Form. Make sure your School Principal/Head has signed the BUCET Application Form and has a dry seal of your school;\n 3. The following options are provided on how to submit your BUCET application documents:\n    Option 1: Submit your BUCET Application requirements to your High School Counselor or to any authorized school representative;\n    Option 2: Submit your BUCET Application requirements to the Bicol University Admissions Office (ONSITE) during your appointed submission date;\n    Option 3: Mail your BUCET Application documents through any courier service available in your locality;\n 4. Assigned BUAO personnel will check and validate your requirements;\n 5. Claim your Test Permit from your High School Counselor or authorized school representative if you chose Option 1; from BUAO if you chose Option 2. For Option 3, your temporary test permit will be emailed to you at your official email address;\n 6. Bring your Test Permit and Vaccination Card during your scheduled examination. For applicants who are not yet vaccinated, kindly present an Anti-gen test result conducted a day before your scheduled examination;\n    Only fully-vaccinated students shall be allowed to take the examination. Unvaccinated students shall be required to present a valid RT-PCR or Antigen test taken a day before the examination date for them to be allowed to take the BUCET. An examinee who feels sick or indisposed, complains of COVID-like symptoms, or registers body temperature above the normal range during examination day shall be rescheduled."
            ]
        },
        {
            "tag": "announcement",
            "patterns": [
                "Any insights on the process of checking BUCET pass status?",
                "What's the official channel for confirming BUCET exam outcomes?",
                "Is there a particular portal where I can verify my BUCET results?",
                "Could you walk me through the process of confirming BUCET success?",
                "Any suggestions on how I can confirm my pass status in the BUCET?",
                "How does one typically find out if they passed the BUCET?",
                "Is there an online platform for checking BUCET pass results?",
                "What's the standard practice for confirming success in the BUCET?",
                "Can you outline the steps for checking BUCET exam results?",
                "Any recommendations on ensuring I successfully passed the BUCET?",
                "How can I be certain about the outcome of my BUCET performance?",
                "What's the procedure for verifying BUCET results officially?",
                "Are there specific instructions for checking if I passed the BUCET?",
                "How will I be notified if I've successfully cleared the BUCET?",
                "Can you guide me on checking my BUCET examination pass status?",
                "I'm curious about the protocol for confirming my BUCET results. Can you help?",
                "What steps should I take to validate whether I've passed the BUCET?",
                "Any insights on how I can confirm my success in the BUCET?",
                "Is there a specific method to check if I made it through the BUCET?",
                "Can you provide information on the steps to confirm BUCET results?",
                "Any advice on ensuring I passed the BUCET successfully?",
                "How do I go about checking my BUCET exam pass status?",
                "Is there a system in place for confirming BUCET pass results?",
                "Could you explain how one can determine their success in the BUCET?",
                "What's the official way of confirming BUCET exam pass status?",
                "Are there specific guidelines for checking if I passed the BUCET?",
                "How will I receive confirmation of my performance in the BUCET?",
                "Can you provide information on the steps to validate BUCET pass results?",
                "Any insights on the process of checking BUCET exam pass status?",
                "What's the official channel for confirming BUCET exam pass outcomes?",
                "Is there a particular portal where I can verify my BUCET pass results?",
                "Could you walk me through the process of confirming BUCET success?",
                "Any suggestions on how I can confirm my pass status in the BUCET?",
                "How does one typically find out if they passed the BUCET?",
                "Is there an online platform for checking BUCET pass outcomes?",
                "What's the standard practice for confirming success in the BUCET?",
                "Can you outline the steps for checking BUCET exam pass outcomes?",
                "Any recommendations on ensuring I successfully passed the BUCET?",
                "How can I be certain about the outcome of my BUCET pass status?",
                "What's the procedure for verifying BUCET pass results officially?",
                "Are there specific instructions for checking if I passed the BUCET?",
                "How will I be notified if I've successfully cleared the BUCET?",
                "Can you guide me on checking my BUCET examination outcomes?",
                "I'm curious about the protocol for confirming my BUCET pass results. Can you help?",
                "What steps should I take to validate whether I've passed the BUCET?",
                "Any insights on how I can confirm my success in the BUCET?",
                "Is there a specific method to check if I made it through the BUCET?",
                "Can you provide information on the steps to confirm BUCET pass results?",
                "Any advice on ensuring I passed the BUCET successfully?",
                "How do I go about checking my BUCET exam pass status?",
                "Is there a system in place for confirming BUCET pass outcomes?",
                "Could you explain how one can determine their success in the BUCET?",
                "What's the official way of confirming BUCET exam pass status?",
                "Are there specific guidelines for checking if I passed the BUCET?",
                "How will I receive confirmation of my performance in the BUCET?",
                "Can you provide information on the steps to validate BUCET pass outcomes?",
                "Any insights on the process of checking BUCET exam pass status?",
                "What's the official channel for confirming BUCET exam pass results?",
                "Is there a particular portal where I can verify my BUCET pass results?",
                "Could you walk me through the process of confirming BUCET success?",
                "Any suggestions on how I can confirm my pass status in the BUCET?",
                "How does one typically find out if they passed the BUCET?",
                "Is there an online platform for checking BUCET pass results?",
                "What's the standard practice for confirming success in the BUCET?",
                "Can you outline the steps for checking BUCET exam pass results?",
                "Any recommendations on ensuring I successfully passed the BUCET?"
            ],
            "responses": [
                "The Bicol University Admissions Office will publish the list of passers on their official webpage, and you will also receive an email notification at your official email address.",
                "Expect to see the names of those who passed on the official page of the Bicol University Admissions Office, and simultaneously, an email will be sent to your official email address.",
                "The list of successful candidates will be available on the official webpage of the Bicol University Admissions Office, and you will also receive an email notification at your official email address.",
                "On their official page, the Bicol University Admissions Office will post the roster of passers, and you will simultaneously receive an email at your official email address.",
                "Check the official webpage of the Bicol University Admissions Office for the list of successful candidates, and simultaneously, an email will be sent to your official email address.",
                "The Bicol University Admissions Office will display the list of passers on their official page, and you will concurrently receive an email at your official email address.",
                "Look for the list of individuals who passed on the official webpage of the Bicol University Admissions Office, and you will also receive an email notification at your official email address.",
                "The roster of successful candidates will be published on the official page of the Bicol University Admissions Office, and an email will be sent to your official email address simultaneously.",
                "The Bicol University Admissions Office will release the list of passers on their official webpage, and you will receive an email notification at your official email address at the same time.",
                "On the official webpage of the Bicol University Admissions Office, you will find the list of individuals who passed, and simultaneously, an email will be sent to your official email address.",
                "The list of successful candidates will be posted on the official webpage of the Bicol University Admissions Office, and you will receive an email notification at your official email address simultaneously.",
                "Check the official page of the Bicol University Admissions Office for the roster of passers, and expect to receive an email at your official email address simultaneously."
            ]
        },
        {
            "tag": "qualification",
            "patterns": [
                "Provide a checklist of requirements for AY 202*-202* Bicol University College Entrance Test eligibility.",
                "Share tips on meeting the AY 202*-202* Bicol University College Entrance Test qualification criteria.",
                "Clarify the eligibility conditions for the AY 202*-202* Bicol University College Entrance Test.",
                "Explain the documentation needed to qualify for the AY 202*-202* Bicol University College Entrance Test.",
                "Highlight the key factors for meeting the AY 202*-202* Bicol University College Entrance Test eligibility.",
                "Break down the eligibility requirements for the AY 202*-202* Bicol University College Entrance Test.",
                "Provide a step-by-step guide on how to qualify for the AY 202*-202* Bicol University College Entrance Test.",
                "What qualifications must be met to be eligible for the AY 202*-202* Bicol University College Entrance Test?",
                "Explain the necessary steps to ensure eligibility for the AY 202*-202* Bicol University College Entrance Test.",
                "Outline the criteria for eligibility in the AY 202*-202* Bicol University College Entrance Test.",
                "What are the prerequisites for taking the AY 202*-202* Bicol University College Entrance Test?",
                "Describe the eligibility conditions for the AY 202*-202* Bicol University College Entrance Test.",
                "Provide information on the qualifications required for the AY 202*-202* Bicol University College Entrance Test.",
                "What standards should one meet to qualify for the AY 202*-202* Bicol University College Entrance Test?",
                "Explain the process of meeting the AY 202*-202* Bicol University College Entrance Test eligibility.",
                "Share insights on how to qualify for the AY 202*-202* Bicol University College Entrance Test.",
                "Outline the steps necessary to be eligible for the AY 202*-202* Bicol University College Entrance Test.",
                "What are the prerequisites to qualify for the AY 202*-202* Bicol University College Entrance Test?",
                "Describe the qualifications and criteria for the AY 202*-202* Bicol University College Entrance Test.",
                "Provide a comprehensive guide on qualifying for the AY 202*-202* Bicol University College Entrance Test.",
                "Break down the eligibility requirements for the AY 202*-202* Bicol University College Entrance Test.",
                "What qualifications are needed to take the AY 202*-202* Bicol University College Entrance Test?",
                "Share details on the eligibility criteria for the AY 202*-202* Bicol University College Entrance Test.",
                "Can you explain the steps one should take to qualify for the AY 202*-202* Bicol University College Entrance Test?",
                "Describe the eligibility process for the AY 202*-202* Bicol University College Entrance Test.",
                "What documentation is required to qualify for the AY 202*-202* Bicol University College Entrance Test?",
                "Provide information on the prerequisites for the AY 202*-202* Bicol University College Entrance Test.",
                "Explain the qualifications and criteria for eligibility in the AY 202*-202* Bicol University College Entrance Test.",
                "List the steps needed to meet the eligibility conditions for the AY 202*-202* Bicol University College Entrance Test.",
                "Share tips on ensuring eligibility for the AY 202*-202* Bicol University College Entrance Test.",
                "What are the key factors in meeting the AY 202*-202* Bicol University College Entrance Test eligibility?",
                "Explain the eligibility standards for the AY 202*-202* Bicol University College Entrance Test.",
                "Provide a breakdown of the eligibility criteria for the AY 202*-202* Bicol University College Entrance Test.",
                "What qualifications should one possess to qualify for the AY 202*-202* Bicol University College Entrance Test?",
                "Clarify the documentation needed to meet the eligibility conditions for the AY 202*-202* Bicol University College Entrance Test.",
                "Describe the necessary qualifications for taking the AY 202*-202* Bicol University College Entrance Test.",
                "Outline the steps to qualify for the AY 202*-202* Bicol University College Entrance Test.",
                "Explain the prerequisites for eligibility in the AY 202*-202* Bicol University College Entrance Test.",
                "What qualifications and criteria should one meet for the AY 202*-202* Bicol University College Entrance Test?",
                "Share insights on the eligibility process for the AY 202*-202* Bicol University College Entrance Test.",
                "Enumerate the qualifications and prerequisites for the AY 202*-202* Bicol University College Entrance Test.",
                "Provide a detailed guide on how to meet the eligibility conditions for the AY 202*-202* Bicol University College Entrance Test.",
                "What steps are required to qualify for the AY 202*-202* Bicol University College Entrance Test?",
                "Explain the eligibility criteria and qualifications for the AY 202*-202* Bicol University College Entrance Test."
            ], 
            "responses": [
                "To check:\n1. You must be a high school senior of a DepEd-recognized high school and expecting to graduate at the end of the school year; OR\n 2. a senior high school graduate who has not taken and/or is not taking any college subjects or an ALS graduate who has not enrolled in any college course and is eligible to apply.",
                "Check out the pre-requisites:\n1. You must be a high school senior of a DepEd-recognized high school and expecting to graduate at the end of the school year; OR\n 2. a senior high school graduate who has not taken and/or is not taking any college subjects or an ALS graduate who has not enrolled in any college course and is eligible to apply.",
                "To confirm if your qualified:\n1. You must be a high school senior of a DepEd-recognized high school and expecting to graduate at the end of the school year; OR\n 2. a senior high school graduate who has not taken and/or is not taking any college subjects or an ALS graduate who has not enrolled in any college course and is eligible to apply."
            ]
        },
        {
            "tag": "topics",
            "patterns": [
                "What is the range of subjects in the test?",
                "List the subjects that the test encompasses.",
                "Name the academic disciplines covered by the test.",
                "Specify the subjects addressed in the test.",
                "What subjects are taken into account in the test?",
                "Enumerate the test's subject matter for me.",
                "Provide details on the subjects evaluated in the test.",
                "What topics are part of the test's assessment?",
                "Elaborate on the range of subjects in the test.",
                "Can you specify the subjects included in the test?",
                "Detail the subjects that the test covers.",
                "Clarify the academic disciplines addressed by the test.",
                "What subjects are part of the test's focus?",
                "Outline the test's subject coverage.",
                "Name the subjects touched upon in the test.",
                "What areas of study are considered in the test?",
                "List the subjects covered in the test.",
                "What subjects are incorporated into the test's evaluation?",
                "Can you elaborate on the test's subject matter?",
                "What is the range of subjects addressed in the test?",
                "Enumerate the subjects that the test examines.",
                "Provide information on the test's covered subject areas.",
                "Which academic fields are part of the test?",
                "Clarify the subjects covered by the test.",
                "What subjects are taken into consideration in the test?",
                "Name the subjects that the test encompasses.",
                "Detail the academic disciplines covered by the test.",
                "Specify the subjects addressed in the test.",
                "What subjects are part of the test's assessment?",
                "Outline the test's subject coverage.",
                "Can you identify the subjects included in the test?",
                "Elaborate on the subjects that the test covers.",
                "What is the range of subjects in the test?",
                "List the academic disciplines addressed by the test.",
                "What subjects are incorporated into the test's focus?",
                "Enumerate the test's subject matter for me.",
                "Provide details on the subjects evaluated in the test.",
                "What topics are part of the test's content?",
                "Clarify the range of subjects in the test.",
                "Can you specify the subjects covered by the test?",
                "Name the subjects that the test examines.",
                "What areas of study are considered in the test?",
                "List the subjects covered in the test."
            ],
            "responses": [
                "Within the examination, sub-tests assess proficiency in English, Mathematics, Science, and Reading Comprehension.",
                "The assessment consists of sections examining proficiency in English, Mathematics, Science, and Reading Comprehension.",
                "The examination is structured with sub-tests in English Language Proficiency, Mathematics, Science, and Reading Comprehension.",
                "Sub-tests within the exam evaluate proficiency in English Language, Mathematics, Science, and Reading Comprehension.",
                "The test comprises sections on English Language Proficiency, Mathematics, Science, and Reading Comprehension.",
                "The examination includes sub-tests assessing proficiency in English, Mathematics, Science, and Reading Comprehension.",
                "Within the exam, there are sections focused on English Language Proficiency, Mathematics, Science, and Reading Comprehension.",
                "The assessment involves sub-tests covering proficiency in English, Mathematics, Science, and Reading Comprehension.",
                "Sub-tests within the examination evaluate proficiency in English Language, Mathematics, Science, and Reading Comprehension.",
                "The test includes sections for evaluating proficiency in English, Mathematics, Science, and Reading Comprehension.",
                "Within the examination, sub-tests assess proficiency in English, Mathematics, Science, and Reading Comprehension.",
                "The assessment consists of sections examining proficiency in English, Mathematics, Science, and Reading Comprehension.",
                "The examination is structured with sub-tests in English Language Proficiency, Mathematics, Science, and Reading Comprehension."
            ]
        },
        {
            "tag": "date of release",
            "patterns": [
                "When will the BUCET results become available for viewing?",
                "Is there a set date for the release of the BUCET results?",
                "Can you give me an estimate of when the BUCET results might be declared?",
                "When is the anticipated announcement date for the BUCET results?",
                "I'm wondering when exactly the BUCET results will come out.",
                "Have they provided a timeline for the release of the BUCET results?",
                "When will we be able to access the BUCET results online?",
                "Do you know the expected timeframe for the publication of BUCET results?",
                "When will the BUCET results officially be made public?",
                "Is there a scheduled date for the release of the BUCET results?",
                "Could you let me know when the BUCET results will be unveiled?",
                "When will the results of the BUCET examination be disclosed?",
                "Can you share any information on the release schedule for BUCET results?",
                "I'm interested in knowing the anticipated release date of the BUCET results.",
                "When can we expect to receive information about the BUCET results?",
                "Is there a specific day when the BUCET results are expected to come out?",
                "Have they provided any details on when the BUCET results will be released?",
                "When will the BUCET results be available for public viewing?",
                "Can you provide insight into when the BUCET results are due to be announced?",
                "When should we anticipate the official announcement of the BUCET results?",
                "Is there a designated time for the release of the BUCET results?",
                "When will the BUCET results be officially declared by the authorities?",
                "Can you share any information on the expected release date of BUCET results?",
                "I'm curious to know when the BUCET results will be disclosed to the public.",
                "Do you have any details on when the BUCET results will be declared?",
                "Do you have any details on when the BUCET results will be declared?",
                "Could you provide me with information on when the BUCET results will be out?",
                "Is there a specific timeframe for the release of the BUCET results?",
                "When will the BUCET results be released for public access?",
                "Can you inform me about the expected timeline for the BUCET results release?",
                "I'm eagerly awaiting the announcement of the BUCET results; do you know when?",
                "When will the authorities make the BUCET results public?",
                "Do you have any updates on when the BUCET results will be officially announced?",
                "Can you share any details on the anticipated release date for BUCET results?",
                "When are we likely to receive information about the BUCET results?",
                "Is there any indication of when the BUCET results will be made available?"
            ],
            "responses": [
                "Refer to the paper that was handed to you after your examination.",
                "Look to your paper that was handed to you after your examination.",
                "You can found on the paper given to you after an examination."
            ]
        },
        {
            "tag": "test centers",
            "patterns": [
                "Could you provide me with details on the BUCET test centers' whereabouts?",
                "Can you point me to the locations of BUCET test centers?",
                "I'm looking for information about the physical locations of BUCET test centers.",
                "Where do the BUCET test centers exist?",
                "Can you tell me the addresses of the BUCET test centers?",
                "Do you know where the BUCET test centers are positioned geographically?",
                "I'm seeking information on the exact places where the BUCET test centers are situated.",
                "Where are the BUCET test centers situated across the country?",
                "Can you provide a list of the BUCET test center locations?",
                "I'm interested in finding out the specific sites of BUCET test centers.",
                "Could you give me details on the geographic distribution of BUCET test centers?",
                "Where are the designated test centers for the BUCET located?",
                "Can you share information on the precise locations of BUCET test centers?",
                "I'm curious about the whereabouts of BUCET test centers across different regions.",
                "Where should I go to locate the BUCET test centers?",
                "Can you guide me on how to find the BUCET test centers' locations?",
                "Do you have information on the regional distribution of BUCET test centers?",
                "I'm searching for the BUCET test centers' exact positions.",
                "Could you tell me the cities where the BUCET test centers are established?",
                "Where are the BUCET test centers scattered throughout the country?",
                "Can you provide a breakdown of BUCET test center locations by city?",
                "I'm looking for information about the specific towns hosting BUCET test centers.",
                "Where can I locate the BUCET test centers within the state?",
                "Can you share information about the diverse locations of BUCET test centers?",
                "I'm interested in knowing the varied locations of BUCET test centers nationwide.",
                "Where across the country can I find the BUCET test centers?",
                "Could you inform me about the states that host BUCET test centers?",
                "I'm seeking information on BUCET test center locations within each region.",
                "Can you tell me about the distribution of BUCET test centers in different areas?",
                "I'm curious about the states where the BUCET test centers are established.",
                "Where in the country are the BUCET test centers positioned?",
                "Can you provide a detailed map of BUCET test center locations?",
                "I'm interested in exploring the BUCET test centers' geographical spread.",
                "Where specifically are the BUCET test centers located in the nation?",
                "Could you share information on the nationwide locations of BUCET test centers?",
                "I'm inquiring about the regional distribution of BUCET test centers.",
                "Can you guide me on how to navigate to the BUCET test centers' locations?",
                "Do you have information on the localities hosting BUCET test centers?",
                "I'm looking for details on the cities and towns with BUCET test centers."
            ],
            "responses": [
                "To ascertain your examination venue, consult the test permit issued by BUAO.Visit the link to see the list of offered test centers: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php",
                "Bicol hosts numerous test centers for examination purposes.Visit the link to see the list of offered test centers: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php",
                "The test permit, distributed by BUAO personnel, contains details of the allocated test center.Visit the link to see the list of offered test centers: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php",
                "Across Bicol, test centers are strategically positioned.Visit the link to see the list of offered test centers: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php",
                "Identifying your exam venue in Bicol is facilitated by the test permit.Visit the link to see the list of offered test centers: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php",
                "The test permit, handed out by BUAO personnel, specifies the test center.Visit the link to see the list of offered test centers: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php",
                "Throughout Bicol, test centers are established to serve examinees.Visit the link to see the list of offered test centers: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php",
                "The test permit issued by BUAO personnel indicates the designated test center.Visit the link to see the list of offered test centers: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php",
                "Across Bicol, there are multiple locations designated as test centers.Visit the link to see the list of offered test centers: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php",
                "To locate your exam venue, refer to the test permit provided by BUAO personnel.Visit the link to see the list of offered test centers: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php",
                "Bicol University offers various test centers, with details provided in the test permit distributed by BUAO personnel."
            ]
        },
        {
            "tag": "mobile phone",
            "patterns": [
                "Can I use my cellphone to apply?",
                "Is mobile application submission an option for applying?",
                "Can I apply using my smartphone?",
                "Is it feasible to complete the application on a mobile device?",
                "Can I submit my application through my phone?",
                "Is applying via mobile phone allowed for this process?",
                "Can I use my mobile device for application submission?",
                "Is it possible to apply via smartphone?",
                "Can I utilize my phone for the application?",
                "Is mobile application supported for the application process?",
                "Can I apply using a cellphone?",
                "Is mobile application submission an acceptable method?",
                "Can the application process be done on a smartphone?",
                "Is it permissible to apply using a mobile phone?",
                "Can I complete the application using my mobile device?",
                "Is it acceptable to apply via cellphone?",
                "Can I submit my application using my smartphone?",
                "Is mobile application submission permitted for applying?",
                "Can I apply using my cellphone?",
                "Is it possible to apply through a mobile device?",
                "Can I complete the application form on my smartphone?",
                "Is applying via mobile phone supported for this process?",
                "Can I use my phone to apply?",
                "Is mobile application submission an option here?",
                "Can I apply using my smartphone?",
                "Is it feasible to complete the application on a cellphone?"
            ],
            "responses": [
                "Yes, but we advise you to use PC or Laptop in applying for a much convenient view of the website and easier access on your downloadable files.",
                "We advise you to use PC or Laptop in applying for a much convenient view of the website and easier access on your downloadable files, but yes, you can.",
                "You can, but we advise you to use PC or Laptop in applying for a much convenient view of the website and easier access on your downloadable files."
            ]
        },
        {
        "tag": "list of courses",
        "patterns":[
            "List of offered courses in Bicol University?",
            "Can you provide the undergraduate courses offered at Bicol University?",
            "What are the available courses at Bicol University?",
            "Could you list the courses offered at Bicol University?",
            "What are the courses available at Bicol University?",
            "Can you specify the courses offered by Bicol University?",
            "What are the options courses at Bicol University?",
            "Could you provide information about the courses offered at Bicol University?",
            "Can you list the available courses at Bicol University?"
        ],
        "responses":[
            "Hey there! If you're curious about the courses offered at Bicol University, I've got just the thing for you. Check out this link: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php. You'll find all the options laid out neatly for you.",
            "So, you're interested in what Bicol University has to offer? Well, lucky for you, I've got the inside scoop! Just follow this link: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php, and you'll see all the courses they've got available.",
            "Want to know what you can study at Bicol University? Easy peasy! Click on this link: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php, and you'll get the full rundown of courses they offer.",
            "Hey, friend! Thinking about studying at Bicol University? Awesome choice! Head over to this link: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php, and you'll find everything you need to know about their courses.",
            "Hey, hey! Want to explore the courses available at Bicol University? You're in luck! Just click on this link: https://buao.bicol-u.edu.ph/bucet_online/BUCESS-HOME/index.php, and you'll be on your way to discovering all the exciting options they have."
        
        ]
    }
    ]
}