[
    {
        "text": "Is there a system in place for confirming BUCET pass outcomes?",
        "label": 52
    },
    {
        "text": "Is the 40 pesos stamp necessary for mailing?",
        "label": 27
    },
    {
        "text": "Elaborate on the documents needed for online verification.",
        "label": 31
    },
    {
        "text": "I'm interested in finding out the specific sites of BUCET test centers.",
        "label": 56
    },
    {
        "text": "Elaborate on the test's topics coverage.",
        "label": 54
    },
    {
        "text": "Provide a comprehensive list of online submission documents.",
        "label": 31
    },
    {
        "text": "Should I honor the specified appointment date when selecting either option 1 or option 3?",
        "label": 16
    },
    {
        "text": "I'm interested in BUCET 202*-202*; how can I submit my application?",
        "label": 50
    },
    {
        "text": "What's the formal way to request and retrieve the BUCET application form?",
        "label": 7
    },
    {
        "text": "Can you tell me the specific places where the BUCET test centers are located?",
        "label": 56
    },
    {
        "text": "Is there a particular portal where I can verify my BUCET results?",
        "label": 52
    },
    {
        "text": "What topics does the test encompass?",
        "label": 54
    },
    {
        "text": "What documentation is required, and how should I go about submitting it for the BUCET application?",
        "label": 14
    },
    {
        "text": "Can you guide me on rescheduling my appointment?",
        "label": 6
    },
    {
        "text": "Can you provide details on the closing date for submitting all required documents?",
        "label": 9
    },
    {
        "text": "Do we have to pass Form 138 for both Grade 11 and Grade 12 entry?",
        "label": 33
    },
    {
        "text": "Can the postage stamp's value be higher than 40 pesos without any concern?",
        "label": 28
    },
    {
        "text": "Are there any specific admission interviews for BUCET 202*-202* applicants?",
        "label": 50
    },
    {
        "text": "Can you outline the steps for checking BUCET exam pass results?",
        "label": 52
    },
    {
        "text": "Could you clarify the financial requirement for the BUCET application fee?",
        "label": 10
    },
    {
        "text": "What is the cutoff date for submitting all required documents?",
        "label": 9
    },
    {
        "text": "Can you provide instructions on the proper way to submit my application requirements for BUCET?",
        "label": 14
    },
    {
        "text": "Tell me about the array of courses within the Bicol University Guinobatan",
        "label": 47
    },
    {
        "text": "Have they announced when the BUCET results will be made public?",
        "label": 55
    },
    {
        "text": "Provide information on the test's covered topics.",
        "label": 54
    },
    {
        "text": "I would like to know about the course offerings in the College of Social Sciences and Philosophy (CSSP).",
        "label": 35
    },
    {
        "text": "I'm seeking information on the exact places where the BUCET test centers are situated.",
        "label": 56
    },
    {
        "text": "Is there an online platform for checking BUCET pass results?",
        "label": 52
    },
    {
        "text": "Is it possible to apply using a mobile phone?",
        "label": 57
    },
    {
        "text": "Can the postage stamp value be lower than 40 pesos?",
        "label": 29
    },
    {
        "text": "What steps should I take to reschedule my appointment date?",
        "label": 6
    },
    {
        "text": "Can I apply using my smartphone?",
        "label": 57
    },
    {
        "text": "What documentation or information do I need to provide to claim the BUCET test permit?",
        "label": 15
    },
    {
        "text": "I'm interested in learning about the available courses in the College of Dental Medicine/(CDM)",
        "label": 49
    },
    {
        "text": "What are the courses available in the BU Gubat Campus (BUGC)?",
        "label": 38
    },
    {
        "text": "Is it a requirement to submit Form 138 for both Grade 11 and Grade 12 admission reconsiderations?",
        "label": 33
    },
    {
        "text": "Can students specifically conveniently drop off their requirements at specifically designated dropboxes specifically at the BU Main Campus?",
        "label": 32
    },
    {
        "text": "Any recommendations on ensuring I successfully passed the BUCET?",
        "label": 52
    },
    {
        "text": "What precautions should I take to avoid damaging the Php 50.00 mailing stamp during the pasting process?",
        "label": 22
    },
    {
        "text": "If the appointment date is beyond the initial deadline for the test center, do I still need to follow it?",
        "label": 17
    },
    {
        "text": "Are specifically designated drop-off options available for students to submit their requirements specifically at the BU Main Campus?",
        "label": 32
    },
    {
        "text": "Hello!",
        "label": 0
    },
    {
        "text": "Can the postage be less than 40 pesos and still be acceptable?",
        "label": 29
    },
    {
        "text": "Can the mailing stamp's value surpass 40 pesos without any issue?",
        "label": 28
    },
    {
        "text": "Do I need to follow the appointed date if I opt for either option 1 or option 3?",
        "label": 16
    },
    {
        "text": "Where can I retrieve the BUCET application form?",
        "label": 5
    },
    {
        "text": "What is the recommended technique for adhering the Php 50.00 mailing stamp to the envelope?",
        "label": 22
    },
    {
        "text": "Could you please inform me about the specific amount required for the BUCET application fee?",
        "label": 10
    },
    {
        "text": "Do you have any information on the timeline for the BUCET results release?",
        "label": 55
    },
    {
        "text": "Is it permissible to affix a mailing stamp that is valued higher than Php 50.00?",
        "label": 21
    },
    {
        "text": "In what situations would it be advisable to have a 4P's certificate?",
        "label": 24
    },
    {
        "text": "Can you walk me through the process to edit the online-submitted picture?",
        "label": 8
    },
    {
        "text": "What is the protocol for submitting a new application if errors were made in the first one?",
        "label": 12
    },
    {
        "text": "Do we need to send the Chest X-ray film, Hepa B Screening Result, and Medical Certificate by mail or courier as part of the submission?",
        "label": 30
    },
    {
        "text": "Could you list the courses that the College of Education (CE)?",
        "label": 37
    },
    {
        "text": "Is it fine if the postage doesn't reach the 40 pesos threshold?",
        "label": 29
    },
    {
        "text": "Could you provide information on the additional submissions needed for parents who are overseas Filipino workers (OFW)?",
        "label": 23
    },
    {
        "text": "Could you please provide details on the address for addressing concerns related to BUCET?",
        "label": 26
    },
    {
        "text": "How can I ensure a successful application for BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "Could you provide instructions on the precise placement of the Php 50.00 mailing stamp?",
        "label": 22
    },
    {
        "text": "Can the mailing stamp value be below 40 pesos?",
        "label": 29
    },
    {
        "text": "Is applying through a mobile phone allowed?",
        "label": 57
    },
    {
        "text": "How can I access and correct information in an application form that was wrongly filled?",
        "label": 13
    },
    {
        "text": "Is it feasible to apply using a smartphone?",
        "label": 57
    },
    {
        "text": "Is obtaining a 4P's certificate necessary for our current situation?",
        "label": 24
    },
    {
        "text": "Which documents are required for online submission?",
        "label": 31
    },
    {
        "text": "Can the postage stamp value be less than 40 pesos?",
        "label": 29
    },
    {
        "text": "Can the mailing stamp value fall short of 40 pesos?",
        "label": 29
    },
    {
        "text": "Can you direct me to the office where I can obtain the BUCET application form?",
        "label": 5
    },
    {
        "text": "Would it be alright if the postage doesn't meet the 40 pesos threshold?",
        "label": 29
    },
    {
        "text": "Enlighten me on the procedural intricacies of the BUCET requirements submission.",
        "label": 51
    },
    {
        "text": "Where is the official place to obtain the BUCET application form?",
        "label": 5
    },
    {
        "text": "Where can I find the most affordable options for buying mailing stamps?",
        "label": 20
    },
    {
        "text": "Is there flexibility regarding the mailing stamp value, and can it be higher than Php 50.00?",
        "label": 21
    },
    {
        "text": "How does one typically find out if they passed the BUCET?",
        "label": 52
    },
    {
        "text": "Mention the necessary documents for online validation.",
        "label": 31
    },
    {
        "text": "Is the process of obtaining a 4P's certificate complex, and what are the steps involved?",
        "label": 24
    },
    {
        "text": "Are there restrictions on who can submit my BUCET application requirements if I am unable to do so myself?",
        "label": 11
    },
    {
        "text": "Should I follow my appointment date, even if it is beyond the specified deadline for the test center?",
        "label": 17
    },
    {
        "text": "Can you provide details on the appropriate way to attach the Php 50.00 mailing stamp?",
        "label": 22
    },
    {
        "text": "Where is the BU admissions office located, and what is the official street address?",
        "label": 18
    },
    {
        "text": "What are the available courses at Bicol University?",
        "label": 58
    },
    {
        "text": "Where can the application form for BUCET be acquired?",
        "label": 5
    },
    {
        "text": "Can you guide me on using the online platform to edit the picture I submitted?",
        "label": 8
    },
    {
        "text": "Can you provide information on the steps to validate BUCET results?",
        "label": 52
    },
    {
        "text": "Could you walk me through the sequential steps of submitting the BUCET requirements?",
        "label": 51
    },
    {
        "text": "Thanks for your help.",
        "label": 2
    },
    {
        "text": "Could you list the courses that the College of Nursing (CN)",
        "label": 41
    },
    {
        "text": "Enumerate the online document prerequisites.",
        "label": 31
    },
    {
        "text": "Is it acceptable for the mailing stamp to surpass the 40 pesos limit?",
        "label": 28
    },
    {
        "text": "What steps do I need to take to apply for BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "I'm wondering when exactly the BUCET results will come out.",
        "label": 55
    },
    {
        "text": "Is it fine if the mailing stamp is below 40 pesos?",
        "label": 29
    },
    {
        "text": "What are the regulations concerning the mailing stamp amount, and is it acceptable to exceed Php 50.00?",
        "label": 28
    },
    {
        "text": "Do we need to send the Chest X-ray film, Hepa B Screening Result, and Medical Certificate by mail or courier as part of the submission?",
        "label": 30
    },
    {
        "text": "I’m curious to know the exact fee amount for the BUCET application process?",
        "label": 10
    },
    {
        "text": "Could you share the precise address of the BU admissions office for navigation purposes?",
        "label": 18
    },
    {
        "text": "How can I be certain about the outcome of my BUCET pass status?",
        "label": 52
    },
    {
        "text": "Are there supplementary materials or documents needed for applicants with OFW parents?",
        "label": 23
    },
    {
        "text": "Can you provide details on the test's topics areas?",
        "label": 54
    },
    {
        "text": "Is it possible to submit a new application after mistakenly filling out the previous one?",
        "label": 12
    },
    {
        "text": "Tell me about the array of courses within the Jesse M. Robredo Institute of Governance and Development (JMRIGD)",
        "label": 42
    },
    {
        "text": "Are Form 138 submissions required for both Grade 11 and Grade 12?",
        "label": 33
    },
    {
        "text": "Do you have information on the test center locations for the BUCET?",
        "label": 56
    },
    {
        "text": "When should we anticipate the official announcement of the BUCET results?",
        "label": 55
    },
    {
        "text": "How do I navigate the system to reschedule my appointment date?",
        "label": 6
    },
    {
        "text": "Is it acceptable for the mailing stamp to be more than 40 pesos?",
        "label": 28
    },
    {
        "text": "Clarify the documents expected for online procedures.",
        "label": 31
    },
    {
        "text": "What is the standard protocol for retrieving the BUCET application form?",
        "label": 7
    },
    {
        "text": "Could you guide me on the procedure for correcting a mistakenly filled-out application form?",
        "label": 13
    },
    {
        "text": "What are the steps to follow when using the online system to modify the online-submitted picture?",
        "label": 8
    },
    {
        "text": "Can I rectify mistakes by reapplying with a new and correct application form?",
        "label": 12
    },
    {
        "text": "Could you clarify whether securing a 4P's certificate is essential or discretionary for us?",
        "label": 24
    },
    {
        "text": "Is the 40 pesos stamp mandatory for mailing?",
        "label": 27
    },
    {
        "text": "Can the postage stamp value be lower than 40 pesos?",
        "label": 29
    },
    {
        "text": "To whom should I direct my grievances or concerns about BUCET?",
        "label": 26
    },
    {
        "text": "Can the postage stamp value be less than 40 pesos?",
        "label": 29
    },
    {
        "text": "Greetings!",
        "label": 0
    },
    {
        "text": "Can you provide information on the courses offered in the College of Nursing (CN)?",
        "label": 41
    },
    {
        "text": "Do I need to provide an ITR if one of my parents or guardians qualifies as a senior citizen or PWD?",
        "label": 25
    },
    {
        "text": "Can I apply for BUCET 202*-202* if I have completed courses at another institution?",
        "label": 50
    },
    {
        "text": "Name the subjects that the test examines.",
        "label": 54
    },
    {
        "text": "Can you brief me on the academic offerings of the College of Nursing (CN)",
        "label": 41
    },
    {
        "text": "Is there an online application for BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "Could you explain the procedure for turning in my BUCET application requirements?",
        "label": 14
    },
    {
        "text": "Where are the BUCET test centers situated across the country?",
        "label": 56
    },
    {
        "text": "Will there be secure drop-off locations at the satellite campuses of Bicol University?",
        "label": 32
    },
    {
        "text": "Do we have to send the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier when submitting the requirements?",
        "label": 30
    },
    {
        "text": "Detail the topics that the test addresses.",
        "label": 54
    },
    {
        "text": "Enlighten me on the various courses that the CCollege of Arts and Letters (CAL) provides.",
        "label": 39
    },
    {
        "text": "Discuss the online submission document requirements.",
        "label": 31
    },
    {
        "text": "Is the provision of dropboxes being considered for Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "What are the standards one must meet to qualify for the AY 202*-202* Bicol University College Entrance Test?",
        "label": 53
    },
    {
        "text": "Is it fine if the postage stamp is less than 40 pesos?",
        "label": 29
    },
    {
        "text": "Explain the necessary qualifications for taking the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "What supporting documents must I include if my parent is an overseas Filipino worker (OFW)?",
        "label": 23
    },
    {
        "text": "Will there be a rollout of dropbox services at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Clarify the documents expected for online transactions.",
        "label": 31
    },
    {
        "text": "What are the courses available in the College of Arts and Letters (CAL)?",
        "label": 39
    },
    {
        "text": "Would it be acceptable for the postage to be less than 40 pesos?",
        "label": 29
    },
    {
        "text": "Do we need to pass Form 138(Report Card) from both Grades 11 and 12?",
        "label": 33
    },
    {
        "text": "Are there any intentions to provide dropboxes at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Can I re-apply since I mistakenly filled out my application form?",
        "label": 12
    },
    {
        "text": "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 admission standards?",
        "label": 33
    },
    {
        "text": "Should the submission through mail/courier consist of the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
        "label": 30
    },
    {
        "text": "Could you elaborate on the mailing stamp regulations, specifically regarding values beyond Php 50.00?",
        "label": 21
    },
    {
        "text": "How do I ensure that I retrieve the correct and official BUCET application form?",
        "label": 7
    },
    {
        "text": "What is the recommendation regarding my appointment date if I decide on option 1 or option 3?",
        "label": 16
    },
    {
        "text": "Elaborate on the essential online document compilation.",
        "label": 31
    },
    {
        "text": "What steps should I take to claim my BUCET test permit?",
        "label": 15
    },
    {
        "text": "Any suggestions on how I can confirm my pass status in the BUCET?",
        "label": 52
    },
    {
        "text": "Is it within the rules for the mailing stamp to be more than 40 pesos?",
        "label": 28
    },
    {
        "text": "Outline the criteria for eligibility in the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Is the 40 pesos postage stamp mandatory for mailing?",
        "label": 27
    },
    {
        "text": "Can the postage stamp's value exceed 40 pesos without any issue?",
        "label": 28
    },
    {
        "text": "When will the BUCET results be officially declared by the authorities?",
        "label": 55
    },
    {
        "text": "What is the venue for obtaining the BUCET application form?",
        "label": 5
    },
    {
        "text": "Enlighten me on the various courses that the Jesse M. Robredo Institute of Governance and Development (JMRIGD) provides.",
        "label": 42
    },
    {
        "text": "Clarify the documents essential for online transactions.",
        "label": 31
    },
    {
        "text": "What is the process for rescheduling my appointment date?",
        "label": 6
    },
    {
        "text": " Are there any consequences if the mailing stamp used exceeds the value of Php 50.00?",
        "label": 21
    },
    {
        "text": "How will I receive confirmation of my performance in the BUCET?",
        "label": 52
    },
    {
        "text": "Goodnight.",
        "label": 1
    },
    {
        "text": "Can you outline the steps involved in the submission of my application requirements for BUCET?",
        "label": 14
    },
    {
        "text": "Can you provide information on any additional charges associated with the BUCET application fee?",
        "label": 10
    },
    {
        "text": "Can I complete the application form on my smartphone?",
        "label": 57
    },
    {
        "text": "Is it permissible for the postage to be less than 40 pesos?",
        "label": 29
    },
    {
        "text": "What specific stores in town sell mailing stamps?",
        "label": 20
    },
    {
        "text": "Detail the mandatory online submission paperwork.",
        "label": 31
    },
    {
        "text": "When is the last day for turning in all the documentary requirements?",
        "label": 9
    },
    {
        "text": "What paperwork must be submitted online?",
        "label": 31
    },
    {
        "text": "Where can I seek assistance for concerns related to BUCET?",
        "label": 26
    },
    {
        "text": "Is reapplying the proper procedure for correcting mistakes on the initial application form?",
        "label": 12
    },
    {
        "text": "What's the official office for distributing the BUCET application form?",
        "label": 5
    },
    {
        "text": "Would it be alright for the mailing stamp to be under 40 pesos?",
        "label": 29
    },
    {
        "text": "What are the courses in Bicol University?",
        "label": 58
    },
    {
        "text": "Provide information on the qualifications required for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Where can I get the BUCET application form?",
        "label": 5
    },
    {
        "text": "Is there a specific limit on the value of the mailing stamp, or can it exceed Php 50.00?",
        "label": 21
    },
    {
        "text": "Is there a requirement to include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when sending materials via mail or courier?",
        "label": 30
    },
    {
        "text": "Specify the online submission document prerequisites.",
        "label": 31
    },
    {
        "text": "Can you guide me through the process of correctly pasting the Php 50.00 mailing stamp?",
        "label": 22
    },
    {
        "text": "Can you guide me through the stages of submitting the BUCET requirements?",
        "label": 51
    },
    {
        "text": "Describe the eligibility conditions for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Can I apply for BUCET 202*-202* if I have work experience instead of academic qualifications?",
        "label": 50
    },
    {
        "text": "What kind of courses are available in the Institute of Physical Education, Sports and Recreation (IPESR)?",
        "label": 43
    },
    {
        "text": "List the documents to be submitted online.",
        "label": 31
    },
    {
        "text": "Can you inform me about the expected timeline for the BUCET results release?",
        "label": 55
    },
    {
        "text": "List the academic disciplines addressed by the test.",
        "label": 54
    },
    {
        "text": "I'm unsure where to purchase a mailing stamp; could you offer guidance?",
        "label": 20
    },
    {
        "text": "What documents are compulsory for online submission?",
        "label": 31
    },
    {
        "text": "I'm seeking details about the courses offered within the College of Nursing (CN) encompasses?",
        "label": 41
    },
    {
        "text": "Provide information on the prerequisites for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Would it be acceptable for the mailing stamp to cost more than 40 pesos?",
        "label": 28
    },
    {
        "text": "Should Form 138 (Report Card) be presented for both Grade 11 and Grade 12 admission requests?",
        "label": 33
    },
    {
        "text": "Name the academic disciplines covered by the test.",
        "label": 54
    },
    {
        "text": "How does having a 4P's certificate impact eligibility for certain assistance programs?",
        "label": 24
    },
    {
        "text": "Do we need to submit Form 138 for both Grade 11 and Grade 12 admission deferrals?",
        "label": 33
    },
    {
        "text": "Please share details about the courses present in the College of Engineering (CENG)",
        "label": 46
    },
    {
        "text": "Enlighten me on the various courses that the Bicol University Polangui",
        "label": 48
    },
    {
        "text": "Is the inclusion of Chest X-ray film, Hepa B Screening Result, and Medical Certificate required in the documents we send through mail/courier?",
        "label": 30
    },
    {
        "text": "What is the official protocol for the submission of BUCET application documents?",
        "label": 14
    },
    {
        "text": "Can I complete the application using my cellphone?",
        "label": 57
    },
    {
        "text": "Do we need to submit Form 138 for both Grade 11 and Grade 12 admission challenges?",
        "label": 33
    },
    {
        "text": "Are there specific programs or initiatives where a 4P's certificate is mandatory?",
        "label": 24
    },
    {
        "text": "Clarify the documents expected for online transactions.",
        "label": 31
    },
    {
        "text": "What is the required payment for the BUCET application fee?",
        "label": 10
    },
    {
        "text": "Could you specify the exact fee for the BUCET application?",
        "label": 10
    },
    {
        "text": "Can you provide information on the steps to confirm BUCET pass results?",
        "label": 52
    },
    {
        "text": "Are there any specific guidelines or deadlines for submitting my BUCET application documents?",
        "label": 14
    },
    {
        "text": "Describe the documents needed for online verification.",
        "label": 31
    },
    {
        "text": "I'm bored, can you tell me a joke?",
        "label": 4
    },
    {
        "text": "Can you provide a detailed map of BUCET test center locations?",
        "label": 56
    },
    {
        "text": "Where can I find a reliable source to buy postage stamps?",
        "label": 20
    },
    {
        "text": "How do I initiate the process of changing my appointment date?",
        "label": 6
    },
    {
        "text": "Is it possible to make changes to the photo I submitted online, and if so, how?",
        "label": 8
    },
    {
        "text": "Should I reconsider the timing of my initial appointment date if I go with either option 1 or option 3?",
        "label": 16
    },
    {
        "text": "Can you provide instructions on how to edit the photo after it has been submitted online?",
        "label": 8
    },
    {
        "text": "What are the eligibility criteria for the AY 202*-202* Bicol University College Entrance Test?",
        "label": 53
    },
    {
        "text": "Hello, is anyone there?",
        "label": 0
    },
    {
        "text": "Can you inform me about the timeline for submitting all the required documents?",
        "label": 9
    },
    {
        "text": "Mention the requisite documents for online procedures.",
        "label": 31
    },
    {
        "text": "Would it be acceptable if the mailing stamp exceeded the 40 pesos limit?",
        "label": 28
    },
    {
        "text": "Is the provision of dropboxes part of the development plan for Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "I'm curious about the protocol for confirming my BUCET results. Can you help?",
        "label": 52
    },
    {
        "text": "Can you provide details on the helpdesk or support system for BUCET concerns?",
        "label": 26
    },
    {
        "text": "How can I gain admission to BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "Are specifically designated dropboxes stationed specifically for requirements specifically at the BU Main Campus?",
        "label": 32
    },
    {
        "text": "What is the official protocol for addressing concerns raised during the BUCET interview process?",
        "label": 26
    },
    {
        "text": "What is the prescribed fee for submitting the BUCET application for consideration?",
        "label": 10
    },
    {
        "text": "Is there a provision for individuals with senior citizen or PWD parents or guardians to request a waiver of ITR submission?",
        "label": 25
    },
    {
        "text": "If I choose option 1 or option 3, do I still need to honor my first appointment date?",
        "label": 16
    },
    {
        "text": "Share the specific instructions for properly submitting the BUCET requirements.",
        "label": 51
    },
    {
        "text": "Are there specific hours or days when corrections to a wrongly filled application form can be processed?",
        "label": 13
    },
    {
        "text": "Can I start a new application if I mistakenly filled out the initial one?",
        "label": 12
    },
    {
        "text": "Are there specific courses that the College of Arts and Letters (CAL) specializes in?",
        "label": 39
    },
    {
        "text": "Could you explain how one can determine their success in the BUCET?",
        "label": 52
    },
    {
        "text": "Could you list the courses that the College of Arts and Letters (CAL)?",
        "label": 39
    },
    {
        "text": "What qualifications should one possess to qualify for the AY 202*-202* Bicol University College Entrance Test?",
        "label": 53
    },
    {
        "text": "Can you provide tips on preventing the Php 50.00 mailing stamp from peeling off?",
        "label": 22
    },
    {
        "text": "Will Bicol University implement a system of dropboxes in its satellite campuses?",
        "label": 32
    },
    {
        "text": "What is the final deadline for the submission of all documentary requirements?",
        "label": 9
    },
    {
        "text": "Could you please specify the deadline for submitting all required documents?",
        "label": 9
    },
    {
        "text": "Is it permissible for the postage stamp to be less than 40 pesos?",
        "label": 29
    },
    {
        "text": "How do I go about obtaining and claiming my BUCET test permit?",
        "label": 15
    },
    {
        "text": "Do you know where the BUCET test centers are positioned geographically?",
        "label": 56
    },
    {
        "text": "How does the choice between option 1 or option 3 impact my obligation to the scheduled appointment date?",
        "label": 16
    },
    {
        "text": "Enumerate the online document requirements.",
        "label": 31
    },
    {
        "text": "Could you outline the steps for claiming the BUCET test permit?",
        "label": 15
    },
    {
        "text": "Can you tell me about the distribution of BUCET test centers in different areas?",
        "label": 56
    },
    {
        "text": "What's the specific office for acquiring the BUCET application form?",
        "label": 5
    },
    {
        "text": "What specific details or proofs should I include in my application if my parent is currently working abroad as an OFW?",
        "label": 23
    },
    {
        "text": "Outline the test's subject coverage.",
        "label": 54
    },
    {
        "text": "Will dropbox services be extended to Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Thanks a lot!",
        "label": 2
    },
    {
        "text": "What options do I have if my appointment date is already beyond the test center's scheduled deadline?",
        "label": 17
    },
    {
        "text": "When is the last day I can submit all the required documents for consideration?",
        "label": 9
    },
    {
        "text": "Is it anticipated that there will be dropboxes at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Can you provide information on whether the mailing stamp value is flexible and can exceed Php 50.00?",
        "label": 21
    },
    {
        "text": "Will there be designated areas for dropboxes in the satellite campuses of Bicol University?",
        "label": 32
    },
    {
        "text": "Could you share the address for sending documents to the BU admissions office?",
        "label": 18
    },
    {
        "text": "How cab I admit in BU?",
        "label": 50
    },
    {
        "text": "How do I navigate the system to claim my BUCET test permit?",
        "label": 15
    },
    {
        "text": "Specify the online submission document prerequisites.",
        "label": 31
    },
    {
        "text": "Is it okay if the postage doesn't reach 40 pesos?",
        "label": 29
    },
    {
        "text": "Break down the steps required to qualify for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "How does the 40-peso mailing stamp help with submitting requirements?",
        "label": 27
    },
    {
        "text": "How do I reschedule my appointment date?",
        "label": 6
    },
    {
        "text": "Is there a specific timeframe within which I should paste the Php 50.00 mailing stamp before sending the mail?",
        "label": 22
    },
    {
        "text": "How to admit in BU?",
        "label": 50
    },
    {
        "text": "Any advice on ensuring I passed the BUCET successfully?",
        "label": 52
    },
    {
        "text": "I'm inquiring about the specific geographic locations of BUCET test centers.",
        "label": 56
    },
    {
        "text": "What's the recommended method for rescheduling my appointment date?",
        "label": 6
    },
    {
        "text": "Provide a step-by-step guide on how to formally submit the BUCET requirements.",
        "label": 51
    },
    {
        "text": "Should the package sent through mail/courier encompass the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
        "label": 30
    },
    {
        "text": "Can you explain the official policy for amending an application form that was filled out incorrectly?",
        "label": 13
    },
    {
        "text": "How can I access and edit the picture I uploaded online?",
        "label": 8
    },
    {
        "text": "How should I go about sending in my BUCET application requirements?",
        "label": 14
    },
    {
        "text": "Are there any alternative documents or proofs that can be used in lieu of a 4P's certificate?",
        "label": 24
    },
    {
        "text": "Share some insights into the courses one can pursue at the Bicol University Guinobatan",
        "label": 47
    },
    {
        "text": "Can you guide me on how to make changes to the picture I uploaded online?",
        "label": 8
    },
    {
        "text": "Are there any specific GPA requirements for BUCET 202*-202* applicants?",
        "label": 50
    },
    {
        "text": "How do I go about fixing errors in an application form that was inaccurately completed?",
        "label": 13
    },
    {
        "text": "What topics are part of the test's evaluation?",
        "label": 54
    },
    {
        "text": "Is there any restriction on the postage stamp costing more than 40 pesos?",
        "label": 28
    },
    {
        "text": "What is the protocol for addressing concerns related to BUCET accommodations?",
        "label": 26
    },
    {
        "text": "Must the documents sent through mail/courier include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
        "label": 30
    },
    {
        "text": "Does selecting either option 1 or option 3 imply a modification of my initially assigned appointment date?",
        "label": 16
    },
    {
        "text": "Is the submission of an ITR compulsory for individuals with senior citizen or PWD parents or guardians?",
        "label": 25
    },
    {
        "text": "Could you inform me of the proper channels to go through for claiming my BUCET test permit?",
        "label": 15
    },
    {
        "text": "How can I verify that the Php 50.00 mailing stamp is affixed securely and meets postal requirements?",
        "label": 22
    },
    {
        "text": "Is the 40 pesos mailing stamp compulsory?",
        "label": 27
    },
    {
        "text": "Can you share the physical address where I can find the BU admissions office?",
        "label": 18
    },
    {
        "text": "Share the necessary online documentation details.",
        "label": 31
    },
    {
        "text": "Are there plans to incorporate drop-off points in Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Can I apply using my cellphone?",
        "label": 57
    },
    {
        "text": "Are there plans to set up dropboxes in Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Could you guide me on where to access the BUCET application form?",
        "label": 7
    },
    {
        "text": "Detail the documents to be submitted online.",
        "label": 31
    },
    {
        "text": "What should I do if I encounter technical issues while submitting my BUCET 202*-202* application online?",
        "label": 50
    },
    {
        "text": "Enlighten me on the various courses that the BU Tabaco (BUTC.",
        "label": 36
    },
    {
        "text": "At which post offices or postal outlets can I buy mailing stamps?",
        "label": 20
    },
    {
        "text": "Is there a formal process for appointing a proxy to submit my BUCET application documents?",
        "label": 11
    },
    {
        "text": "Share the necessary online submission paperwork.",
        "label": 31
    },
    {
        "text": "How should I handle the application process if one or both of my parents are overseas Filipino workers (OFWs)?",
        "label": 23
    },
    {
        "text": "Is the 40 pesos postage stamp required?",
        "label": 27
    },
    {
        "text": "Where is the nearest place to buy mailing stamps?",
        "label": 20
    },
    {
        "text": "Where can i get or retrieve my BUCET application form?",
        "label": 7
    },
    {
        "text": "I'm curious about the course options within the College of Business, Economics and Management (CBEM)",
        "label": 44
    },
    {
        "text": "Should Form 138 (Report Card) be provided for both Grade 11 and Grade 12 admission policies?",
        "label": 33
    },
    {
        "text": "Can an agent or proxy submit my BUCET application requirements for me?",
        "label": 11
    },
    {
        "text": "What convenience stores or gas stations sell postage stamps?",
        "label": 20
    },
    {
        "text": "How do I ensure the secure and proper attachment of the Php 50.00 mailing stamp?",
        "label": 22
    },
    {
        "text": "What are the specific documents needed when at least one of my parents is an overseas Filipino worker (OFW)?",
        "label": 23
    },
    {
        "text": "I'm interested in knowing the anticipated release date of the BUCET results.",
        "label": 55
    },
    {
        "text": "How can I officially request a reschedule for my appointment date?",
        "label": 6
    },
    {
        "text": "Would it be alright for the mailing stamp to be below 40 pesos?",
        "label": 29
    },
    {
        "text": "What do I need to do to edit the picture I submitted online?",
        "label": 8
    },
    {
        "text": "I'm interested in knowing the exact locations of the BUCET test centers.",
        "label": 56
    },
    {
        "text": "Is there a penalty or issue associated with using a mailing stamp that exceeds Php 50.00 in value?",
        "label": 21
    },
    {
        "text": "Which topics are part of the test?",
        "label": 54
    },
    {
        "text": "Can you give me an estimate of when the BUCET results might be declared?",
        "label": 55
    },
    {
        "text": "Clarify the documents expected for online validation.",
        "label": 31
    },
    {
        "text": "Where can I go within the university to acquire the BUCET application form?",
        "label": 5
    },
    {
        "text": "How can I utilize the online portal to obtain and retrieve the BUCET application form?",
        "label": 7
    },
    {
        "text": "Can a classmate or peer be designated to submit my BUCET application requirements?",
        "label": 11
    },
    {
        "text": "Can I apply using a smartphone?",
        "label": 57
    },
    {
        "text": "Where should I send my application materials, and what is the address of the BU admissions office?",
        "label": 18
    },
    {
        "text": "Who has the authority to submit my BUCET application requirements on my behalf?",
        "label": 11
    },
    {
        "text": "Can you inform me about the protocol for retrieving the BUCET application form?",
        "label": 7
    },
    {
        "text": "Would it be alright for the postage stamp to be under 40 pesos?",
        "label": 29
    },
    {
        "text": "Can a school official or counselor be authorized to submit my BUCET application requirements?",
        "label": 11
    },
    {
        "text": "Is there a procedure for reapplying after mistakenly completing the application form?",
        "label": 12
    },
    {
        "text": "Should the package sent through mail/courier encompass the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
        "label": 30
    },
    {
        "text": "What paperwork is required for online submission?",
        "label": 31
    },
    {
        "text": "Share some insights into the courses one can pursue at the College of Business, Economics and Management (CBEM)",
        "label": 44
    },
    {
        "text": "Can I use my cellphone to apply?",
        "label": 57
    },
    {
        "text": "Is the requirement to submit an ITR applicable when a parent or guardian is a senior citizen or PWD?",
        "label": 25
    },
    {
        "text": "Where should I go to express my concerns or questions about BUCET?",
        "label": 26
    },
    {
        "text": "Could you let me know when the BUCET results will be unveiled?",
        "label": 55
    },
    {
        "text": "Would it be alright for the mailing stamp to be less than 40 pesos?",
        "label": 29
    },
    {
        "text": "I would like to know about the course offerings in the BU Gubat Campus (BUGC",
        "label": 38
    },
    {
        "text": "Is including the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the mailed/couriered documents a prerequisite?",
        "label": 30
    },
    {
        "text": "Tell me about the array of courses within the College of Science.",
        "label": 34
    },
    {
        "text": "Hey!",
        "label": 0
    },
    {
        "text": "Enlighten me on the various courses that the Institute of Physical Education, Sports and Recreation (IPESR) provides.",
        "label": 43
    },
    {
        "text": "Can you inform me about the total amount for the BUCET application fee?",
        "label": 10
    },
    {
        "text": "How should I address the application process considering my parent is an overseas Filipino worker (OFW)?",
        "label": 23
    },
    {
        "text": "What steps should I take to validate whether I've passed the BUCET?",
        "label": 52
    },
    {
        "text": "To which department should I address my concerns about BUCET?",
        "label": 26
    },
    {
        "text": "Hi!",
        "label": 0
    },
    {
        "text": "Should Form 138 (Report Card) be presented for both Grade 11 and Grade 12 admission applications?",
        "label": 33
    },
    {
        "text": "Can we expect dropboxes at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "What is the procedure for appointing a representative to submit my BUCET application documents?",
        "label": 11
    },
    {
        "text": "Is it permissible for the postage stamp to be under 40 pesos?",
        "label": 29
    },
    {
        "text": "Is it permissible for the mailing stamp to be under 40 pesos?",
        "label": 29
    },
    {
        "text": "Is including the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the mailed/couriered documents mandatory?",
        "label": 30
    },
    {
        "text": "What is the correct way to initiate the submission of BUCET requirements?",
        "label": 51
    },
    {
        "text": "How does the correction process for an incorrectly filled application form differ for international applicants?",
        "label": 13
    },
    {
        "text": "Can someone else submit my BUCET application requirements on my behalf?",
        "label": 11
    },
    {
        "text": "Where can I find the official documentation outlining the procedure for addressing BUCET concerns?",
        "label": 26
    },
    {
        "text": "Should I maintain my initially scheduled appointment date if I opt for either option 1 or option 3?",
        "label": 16
    },
    {
        "text": "Could you provide instructions on how to make necessary corrections to a wrongly completed application form?",
        "label": 13
    },
    {
        "text": "Is the 40 pesos stamp needed for mailing?",
        "label": 27
    },
    {
        "text": "How do I edit my online submitted picture?",
        "label": 8
    },
    {
        "text": "Is it within the acceptable range if the postage is under 40 pesos?",
        "label": 29
    },
    {
        "text": "Break down the process of submitting the BUCET requirements into distinct stages.",
        "label": 51
    },
    {
        "text": "Can the postage stamp exceed 40 pesos in value without any trouble?",
        "label": 28
    },
    {
        "text": "What is the official procedure for editing the picture submitted online?",
        "label": 8
    },
    {
        "text": "Can we use a mailing stamp with a denomination exceeding Php 50.00?",
        "label": 21
    },
    {
        "text": "Break down the process of submitting the BUCET requirements step by step.",
        "label": 51
    },
    {
        "text": "I'm curious about the course options within the Institute of Physical Education, Sports and Recreation (IPESR)",
        "label": 43
    },
    {
        "text": "Will there be designated areas for dropboxes in Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "I would like to know about the course offerings in the BU Tabaco (BUTC",
        "label": 36
    },
    {
        "text": "What subjects are incorporated into the test's evaluation?",
        "label": 54
    },
    {
        "text": "Do you know where I can get my hands on the BUCET application form?",
        "label": 5
    },
    {
        "text": "Where should I go to obtain the BUCET application form?",
        "label": 5
    },
    {
        "text": "Could you specify the fee structure and payment details for the BUCET application?",
        "label": 10
    },
    {
        "text": "Could you provide information on the proper address for expressing concerns about BUCET?",
        "label": 26
    },
    {
        "text": "Is it necessary to include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the package sent via mail or courier?",
        "label": 30
    },
    {
        "text": "Can a family member or friend take responsibility for submitting my BUCET application documents?",
        "label": 11
    },
    {
        "text": "What proof or verification is needed if my parent is an overseas Filipino worker (OFW)?",
        "label": 23
    },
    {
        "text": "Detail the subjects that the test covers.",
        "label": 54
    },
    {
        "text": "What is the physical address of the office where I can address BUCET concerns?",
        "label": 26
    },
    {
        "text": "Enlighten me on the various courses that the Institute of Design and Architecture (IDeA) provides.",
        "label": 40
    },
    {
        "text": "Is the 40 pesos stamp essential?",
        "label": 27
    },
    {
        "text": "What steps should one take to meet the eligibility criteria for the AY 202*-202* Bicol University College Entrance Test?",
        "label": 53
    },
    {
        "text": "Must we incorporate the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the mailed/couriered materials?",
        "label": 30
    },
    {
        "text": "Can I authorize a third party to submit my BUCET application materials?",
        "label": 11
    },
    {
        "text": "What educational topics are encompassed by the test?",
        "label": 54
    },
    {
        "text": "Could you direct me to the BU admissions office and provide the address for reference?",
        "label": 18
    },
    {
        "text": "Can I apply for BUCET 202*-202* if I have a gap year in my education?",
        "label": 50
    },
    {
        "text": "Can you confirm if the Php 50.00 limit for mailing stamps is a strict requirement or subject to change?",
        "label": 28
    },
    {
        "text": "Any advice on ensuring I passed the BUCET successfully?",
        "label": 52
    },
    {
        "text": "Do I need to include the 40 pesos postage stamp?",
        "label": 27
    },
    {
        "text": "Share the prerequisites for qualifying for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Is there a grace period for individuals with appointment dates that exceed the test center's deadline?",
        "label": 17
    },
    {
        "text": "Can you advise on the appropriate channels or contacts to notify regarding corrections to an application form?",
        "label": 13
    },
    {
        "text": "What is the specific amount that needs to be paid as the BUCET application fee?",
        "label": 10
    },
    {
        "text": "Do I need to affix the 40 pesos mailing stamp?",
        "label": 27
    },
    {
        "text": "What topics are involved in the test?",
        "label": 54
    },
    {
        "text": "I'm curious about the protocol for confirming my BUCET pass results. Can you help?",
        "label": 52
    },
    {
        "text": "Can you provide information on any recent changes in policies related to the 4P's certificate?",
        "label": 24
    },
    {
        "text": "Is it fine if the mailing stamp is below 40 pesos?",
        "label": 29
    },
    {
        "text": "Is there a concern with the postage stamp being priced at more than 40 pesos?",
        "label": 28
    },
    {
        "text": "Would it be acceptable for the postage to be under 40 pesos?",
        "label": 29
    },
    {
        "text": "Outline the topics that the test encompasses.",
        "label": 54
    },
    {
        "text": "Do you know any good jokes?",
        "label": 4
    },
    {
        "text": "How can I go about obtaining and claiming my BUCET test permit?",
        "label": 15
    },
    {
        "text": "Can we use a mailing stamp that costs more than Php 50.00, or is it against the guidelines?",
        "label": 21
    },
    {
        "text": "Would it be alright for the mailing stamp to be under 40 pesos?",
        "label": 29
    },
    {
        "text": "Can I submit a revised application if I made errors on the initial form?",
        "label": 12
    },
    {
        "text": "I would like to know the proper protocol for rescheduling my appointment, could you please advise?",
        "label": 6
    },
    {
        "text": "I would like to know about the course offerings in the College of Science.",
        "label": 34
    },
    {
        "text": "Can you share any information on the expected release date of BUCET results?",
        "label": 55
    },
    {
        "text": "Where do I need to go to buy stamps for sending letters?",
        "label": 20
    },
    {
        "text": "Can you guide me on the appropriate way to attach the Php 50.00 mailing stamp?",
        "label": 22
    },
    {
        "text": "Would it be alright for the postage stamp to surpass the 40 pesos threshold?",
        "label": 28
    },
    {
        "text": "Can you provide guidance on the proper way to amend a wrongly completed application form?",
        "label": 13
    },
    {
        "text": "What is the final date by which I need to complete the submission of all necessary documents?",
        "label": 9
    },
    {
        "text": "Is the submission of an ITR obligatory when my parent or guardian qualifies as a senior citizen or PWD?",
        "label": 25
    },
    {
        "text": "Share the requisite online documentation details.",
        "label": 31
    },
    {
        "text": "Is the 40 pesos postage stamp mandatory?",
        "label": 27
    },
    {
        "text": "What courses does the BU Gubat Campus (BUGC feature in its curriculum?",
        "label": 38
    },
    {
        "text": "Are there any specific scenarios where using a mailing stamp exceeding Php 50.00 is allowed?",
        "label": 21
    },
    {
        "text": "Thanks!",
        "label": 2
    },
    {
        "text": "What are the courses in BU?",
        "label": 58
    },
    {
        "text": "To whom should I address concerns if I encounter technical issues with the BUCET application?",
        "label": 26
    },
    {
        "text": "I'm looking for information about the physical locations of BUCET test centers.",
        "label": 56
    },
    {
        "text": "What courses does the Bicol University Polangui feature in its curriculum?",
        "label": 48
    },
    {
        "text": "Is the 40 pesos mailing stamp indispensable?",
        "label": 27
    },
    {
        "text": "What should I include in my personal statement for BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "Can you provide information on any fees associated with correcting errors in an application form?",
        "label": 13
    },
    {
        "text": "Could you list the courses that the BU Tabaco (BUTC)?",
        "label": 36
    },
    {
        "text": "Do we need to submit Form 138 for both Grade 11 and Grade 12 admission requirements?",
        "label": 33
    },
    {
        "text": "Can you provide information on the BUCET student support services available for addressing concerns?",
        "label": 26
    },
    {
        "text": "I'm curious about the course options within the BU Gubat Campus (BUGC.",
        "label": 38
    },
    {
        "text": "Could you explain the steps involved in retrieving the BUCET application form?",
        "label": 7
    },
    {
        "text": "I need to know the deadline for submitting all the documentary information.",
        "label": 9
    },
    {
        "text": "Can you outline the proper procedure for submitting the BUCET requirements?",
        "label": 51
    },
    {
        "text": "Mention the requisite documents for online validation.",
        "label": 31
    },
    {
        "text": "List the documents necessary for online verification.",
        "label": 31
    },
    {
        "text": "What considerations should I keep in mind while pasting the Php 50.00 mailing stamp?",
        "label": 22
    },
    {
        "text": "Can the postage stamp value be lower than 40 pesos?",
        "label": 29
    },
    {
        "text": "To whom should I report concerns about the conduct of BUCET examinations?",
        "label": 26
    },
    {
        "text": "Where can I find a facility or store to buy the necessary mailing stamp?",
        "label": 20
    },
    {
        "text": "Could you let me know the location where I can get the BUCET application form?",
        "label": 5
    },
    {
        "text": "Is there a procedure in place for individuals whose appointment dates fall after the test center's deadline?",
        "label": 17
    },
    {
        "text": "Share some insights into the courses one can pursue at the College of Arts and Letters (CAL)",
        "label": 39
    },
    {
        "text": "Is there a specific timeframe for the release of the BUCET results?",
        "label": 55
    },
    {
        "text": "What are the consequences of submitting an application form with incorrect information, and how can I rectify it?",
        "label": 13
    },
    {
        "text": "How can I address the situation if my appointment date exceeds the test center's scheduled deadline?",
        "label": 17
    },
    {
        "text": "Please explain the steps required for the submission of BUCET requirements.",
        "label": 51
    },
    {
        "text": "Is it permissible for the postage stamp to be priced at more than 40 pesos?",
        "label": 28
    },
    {
        "text": "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 admission rejections?",
        "label": 33
    },
    {
        "text": "How will I be notified if I've successfully cleared the BUCET?",
        "label": 52
    },
    {
        "text": "What are the prerequisites for taking the AY 202*-202* Bicol University College Entrance Test?",
        "label": 53
    },
    {
        "text": "Break down the process for submitting the BUCET requirements.",
        "label": 51
    },
    {
        "text": "Could you explain the steps involved in claiming my BUCET test permit?",
        "label": 15
    },
    {
        "text": "Do I need to follow standard tax filing procedures if my parent or guardian is a senior citizen or PWD?",
        "label": 25
    },
    {
        "text": "Can a school official or administrator submit my BUCET application requirements for me?",
        "label": 11
    },
    {
        "text": "Is there a problem if the mailing stamp used is more than Php 50.00 in value?",
        "label": 28
    },
    {
        "text": "Enumerate the documents to be uploaded online.",
        "label": 31
    },
    {
        "text": "What are the available courses at BU?",
        "label": 58
    },
    {
        "text": "Could you walk me through the process of confirming BUCET success?",
        "label": 52
    },
    {
        "text": "What specific actions are required to ensure the successful submission of BUCET requirements?",
        "label": 51
    },
    {
        "text": "Is it permissible for the mailing stamp to surpass the 40 pesos limit?",
        "label": 28
    },
    {
        "text": "What topics are part of the test's content?",
        "label": 54
    },
    {
        "text": "How do I inform the relevant authorities about my intention to change my appointment date?",
        "label": 6
    },
    {
        "text": "Provide insights into the specific actions needed for BUCET requirements submission.",
        "label": 51
    },
    {
        "text": "Will there be a provision for dropboxes in Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Could you guide me on the steps to follow when submitting my BUCET application documents?",
        "label": 14
    },
    {
        "text": "Clarify the steps for proper BUCET requirements submission.",
        "label": 51
    },
    {
        "text": "List the documents to be submitted online.",
        "label": 31
    },
    {
        "text": "Where can I find the resources for self-resolution of minor BUCET concerns?",
        "label": 26
    },
    {
        "text": "Could you inform me about the timeline and requirements for correcting errors in my application form?",
        "label": 13
    },
    {
        "text": "What additional documentation may be required to support the correction of errors in my wrongly completed application form?",
        "label": 13
    },
    {
        "text": "Where should I go to locate the BUCET test centers?",
        "label": 56
    },
    {
        "text": "What is the cost of the BUCET application fee?",
        "label": 10
    },
    {
        "text": "What are the details of the BU admissions office address, and is there any additional contact information?",
        "label": 18
    },
    {
        "text": "How can one formally submit the BUCET requirements?",
        "label": 51
    },
    {
        "text": "I'm curious about the states where the BUCET test centers are established.",
        "label": 56
    },
    {
        "text": "Could you direct me to the BU admissions office and provide the address?",
        "label": 18
    },
    {
        "text": "Can you guide me on the proper communication channels for downloading and retrieving the BUCET application form?",
        "label": 7
    },
    {
        "text": "Are there any specific locations where I can drop off my BUCET application requirements?",
        "label": 14
    },
    {
        "text": "Is it within the acceptable limit if the postage falls short of 40 pesos?",
        "label": 29
    },
    {
        "text": "What is the last day for submitting all the necessary documentary requirements?",
        "label": 9
    },
    {
        "text": "Could you list the courses that the BU Gubat Campus (BUGC)?",
        "label": 38
    },
    {
        "text": "Can you guide me on how to find the BUCET test centers' locations?",
        "label": 56
    },
    {
        "text": "Share some insights into the courses one can pursue at the College of Education (CE)",
        "label": 37
    },
    {
        "text": "Where can I find the application form for BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "Have they provided a timeline for the release of the BUCET results?",
        "label": 55
    },
    {
        "text": "Tell me about the array of courses within the Institute of Design and Architecture (IDeA)?",
        "label": 40
    },
    {
        "text": "Could you provide me with the street address of the BU admissions office?",
        "label": 18
    },
    {
        "text": "Is there a set date for the release of the BUCET results?",
        "label": 55
    },
    {
        "text": "Is reapplying an option if I filled out my application form incorrectly?",
        "label": 12
    },
    {
        "text": "Can you clarify the correct picture format for the required submission?",
        "label": 19
    },
    {
        "text": "Is there an online platform for checking BUCET pass outcomes?",
        "label": 52
    },
    {
        "text": "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission essentials?",
        "label": 33
    },
    {
        "text": "How does the test center manage cases where appointment dates extend beyond the deadline?",
        "label": 17
    },
    {
        "text": "I need a laugh, can you help?",
        "label": 4
    },
    {
        "text": "Describe the online document prerequisites.",
        "label": 31
    },
    {
        "text": "Are there specific courses that the Institute of Physical Education, Sports and Recreation (IPESR) specializes in?",
        "label": 43
    },
    {
        "text": "Can you provide information on the final date for completing the submission of required documents?",
        "label": 9
    },
    {
        "text": "What's the official way of confirming BUCET exam pass status?",
        "label": 52
    },
    {
        "text": "Are there specific courses that the Bicol University Polangui specializes in?",
        "label": 48
    },
    {
        "text": "In which establishments can I find and purchase mailing stamps?",
        "label": 20
    },
    {
        "text": "I'm interested in learning about the available courses in the BU Tabaco (BUTC)",
        "label": 36
    },
    {
        "text": "Must we submit Form 138 for both Grade 11 and Grade 12?",
        "label": 33
    },
    {
        "text": "I would like to know about the course offerings in the Institute of Physical Education, Sports and Recreation (IPESR)",
        "label": 43
    },
    {
        "text": "Would there be any issue with the postage stamp being valued over 40 pesos?",
        "label": 28
    },
    {
        "text": "Could you enlighten me on the geographical locations of BUCET test centers?",
        "label": 56
    },
    {
        "text": "Will dropbox services be extended to Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Is it mandatory to reschedule my appointment if it surpasses the test center's deadline?",
        "label": 17
    },
    {
        "text": "Who else, besides the applicant, is authorized to deliver the BUCET application documents?",
        "label": 11
    },
    {
        "text": "Could you outline the steps for rescheduling my appointment date?",
        "label": 6
    },
    {
        "text": "Is it permissible to apply using a mobile phone?",
        "label": 57
    },
    {
        "text": "Is it acceptable for the mailing stamp to surpass the 40 pesos limit?",
        "label": 28
    },
    {
        "text": "Enumerate the online document requirements.",
        "label": 31
    },
    {
        "text": "Outline the documents essential for online processing.",
        "label": 31
    },
    {
        "text": "Could you direct me to where I can pick up the BUCET application form?",
        "label": 5
    },
    {
        "text": "Can I submit a corrected application form after making mistakes in the first one?",
        "label": 12
    },
    {
        "text": "Can you specify the address for mailing or dropping off my BUCET application documents?",
        "label": 14
    },
    {
        "text": "How does the decision between option 1 or option 3 affect my commitment to the initially scheduled appointment date?",
        "label": 16
    },
    {
        "text": "How will I receive confirmation of my performance in the BUCET?",
        "label": 52
    },
    {
        "text": "Clarify the online submission document prerequisites.",
        "label": 31
    },
    {
        "text": "How can I officially request to edit the picture I submitted online?",
        "label": 8
    },
    {
        "text": "How do I officially notify the organization about my desire to obtain and retrieve the BUCET application form?",
        "label": 7
    },
    {
        "text": "Would it be alright for the postage stamp to be over 40 pesos in value?",
        "label": 28
    },
    {
        "text": "Can I apply for BUCET 202*-202* if I have international qualifications?",
        "label": 50
    },
    {
        "text": "Can the postage stamp value be lower than 40 pesos?",
        "label": 29
    },
    {
        "text": "Can I complete the application using my mobile device?",
        "label": 57
    },
    {
        "text": "Why is it necessary for us to obtain a 4P's certificate?",
        "label": 24
    },
    {
        "text": "What are the courses available in the Institute of Physical Education, Sports and Recreation (IPESR)?",
        "label": 43
    },
    {
        "text": "What courses does the College of Dental Medicine (CDM) feature in its curriculum?",
        "label": 49
    },
    {
        "text": "Is Form 138 required for both Grade 11 and Grade 12 admission characteristics?",
        "label": 33
    },
    {
        "text": "Is there a mandatory need for us to possess a 4P's certificate?",
        "label": 24
    },
    {
        "text": "Can you provide details on the closing date for submitting all required documents?",
        "label": 9
    },
    {
        "text": "Enumerate the test's subject matter for me.",
        "label": 54
    },
    {
        "text": "What courses does the BU Tabaco (BUTC feature in its curriculum?",
        "label": 36
    },
    {
        "text": "What is the focus topics of the test?",
        "label": 54
    },
    {
        "text": "What courses does the Institute of Physical Education, Sports and Recreation (IPESR) feature in its curriculum?",
        "label": 43
    },
    {
        "text": "Are there any specific formats or guidelines for submitting my BUCET application documents?",
        "label": 14
    },
    {
        "text": "What implications does choosing option 1 or option 3 have on my adherence to the scheduled appointment date?",
        "label": 16
    },
    {
        "text": "Are there specific courses that the College of Education (CE) specializes in?",
        "label": 37
    },
    {
        "text": "Could you let me know the final date by which I need to submit all required documents?",
        "label": 9
    },
    {
        "text": "Is there flexibility regarding the mailing stamp value, and can it be higher than Php 50.00?",
        "label": 28
    },
    {
        "text": "Are there plans to introduce dropbox systems at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "I'd like to know more about the BUCET 202*-202* application requirements.",
        "label": 50
    },
    {
        "text": "Any insights on the process of checking BUCET exam pass status?",
        "label": 52
    },
    {
        "text": "Given that the test center's deadline has passed, do I still need to adhere to my appointment date?",
        "label": 17
    },
    {
        "text": "Break down the procedural steps for the formal submission of the BUCET requirements.",
        "label": 51
    },
    {
        "text": "What documentation or information do I need to provide to edit the online-submitted picture?",
        "label": 8
    },
    {
        "text": "Can you help me understand the steps in changing my appointment date?",
        "label": 6
    },
    {
        "text": "I'm interested in learning about the available courses in the College of Science.",
        "label": 34
    },
    {
        "text": "Is it okay if the mailing stamp amount is less than 40 pesos?",
        "label": 29
    },
    {
        "text": "Elaborate on the conditions for eligibility for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Will there be designated drop-off points at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "What is the preferred method for modifying the picture after online submission?",
        "label": 8
    },
    {
        "text": "How should I complete my application if my parents are both overseas Filipino workers (OFWs)?",
        "label": 23
    },
    {
        "text": "Can you guide me on how to request a meeting to discuss specific concerns about BUCET?",
        "label": 26
    },
    {
        "text": "Can you provide information on the amount for the BUCET application fee?",
        "label": 10
    },
    {
        "text": "Is there a specific location on the document where I should paste the Php 50.00 mailing stamp?",
        "label": 22
    },
    {
        "text": "Share the requisite online documentation criteria.",
        "label": 31
    },
    {
        "text": "Would it be acceptable if the mailing stamp is less than 40 pesos?",
        "label": 29
    },
    {
        "text": "Where can I get the necessary forms for BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "I would like to know about the course offerings in the College of Education (CE)",
        "label": 37
    },
    {
        "text": "Enlighten me on the correct procedure for submitting the BUCET requirements.",
        "label": 51
    },
    {
        "text": "Could you let me know if there are any installment options for the BUCET application fee?",
        "label": 10
    },
    {
        "text": "Is the acquisition of a 4P's certificate time-sensitive, and if so, what is the timeframe?",
        "label": 24
    },
    {
        "text": "Please share details about the courses present in the Bicol University Guinobatan",
        "label": 47
    },
    {
        "text": "Can I submit a new application form if there are errors in the one I initially filled out?",
        "label": 12
    },
    {
        "text": "Share the necessary online documentation details.",
        "label": 31
    },
    {
        "text": "Is there a special provision for individuals with senior citizen or PWD parents or guardians regarding ITR submission?",
        "label": 25
    },
    {
        "text": "Is there a formal process for delegating someone to submit my BUCET application documents?",
        "label": 11
    },
    {
        "text": "Outline the online submission document prerequisites.",
        "label": 31
    },
    {
        "text": "What does a 40-peso stamp do when passing requirements?",
        "label": 27
    },
    {
        "text": "When can we expect the BUCET results to be announced?",
        "label": 55
    },
    {
        "text": "Where is the designated location to address concerns regarding the BUCET examination?",
        "label": 26
    },
    {
        "text": "When is the last day for turning in all the documentary requirements?",
        "label": 9
    },
    {
        "text": "Specify the documents expected for online procedures.",
        "label": 31
    },
    {
        "text": "Enlighten me on the various courses that the College of Education (CE) provides.",
        "label": 37
    },
    {
        "text": "Should the submission through mail/courier consist of the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
        "label": 30
    },
    {
        "text": "I'm seeking information on BUCET test center locations within each region.",
        "label": 56
    },
    {
        "text": "Is the submission of an ITR mandatory even if my parent or guardian is a senior citizen or PWD?",
        "label": 25
    },
    {
        "text": "Should Form 138 be submitted for both Grade 11 and Grade 12 students?",
        "label": 33
    },
    {
        "text": "What office is responsible for handling concerns related to BUCET?",
        "label": 26
    },
    {
        "text": "Would it be alright for the postage stamp to be over 40 pesos in value?",
        "label": 28
    },
    {
        "text": "I'm interested in learning about the available courses in the College of Industrial Technology/(CIT)",
        "label": 45
    },
    {
        "text": "How do I find out the current BUCET application fee?",
        "label": 10
    },
    {
        "text": "Provide details on the subjects evaluated in the test.",
        "label": 54
    },
    {
        "text": "Can you share any information on the release schedule for BUCET results?",
        "label": 55
    },
    {
        "text": "Provide a comprehensive guide on qualifying for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "What is the protocol for addressing concerns related to the BUCET admission process?",
        "label": 26
    },
    {
        "text": "What is the protocol for individuals whose appointment date has exceeded the test center's deadline?",
        "label": 17
    },
    {
        "text": "Is it within the acceptable range if the postage is under 40 pesos?",
        "label": 29
    },
    {
        "text": "What's the formal way to request a change in my appointment date?",
        "label": 6
    },
    {
        "text": "Could you direct me to the source for the BUCET application form?",
        "label": 5
    },
    {
        "text": "If I go with either option 1 or option 3, do I need to reschedule my initially set appointment date?",
        "label": 16
    },
    {
        "text": "Outline the online submission document prerequisites.",
        "label": 31
    },
    {
        "text": "Is it fine if the stamp costs more than 40 pesos?",
        "label": 28
    },
    {
        "text": "Is there a specific rule regarding the submission of ITR for individuals with senior citizen or PWD parents or guardians?",
        "label": 25
    },
    {
        "text": "What are the operating hours of the post office where I can buy mailing stamps?",
        "label": 20
    },
    {
        "text": "Can you provide information on qualifying for the AY 202*-202* Bicol University College Entrance Test?",
        "label": 53
    },
    {
        "text": "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 evaluations?",
        "label": 33
    },
    {
        "text": "What is the process for applying to BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "Where can I find the test centers for the BUCET?",
        "label": 56
    },
    {
        "text": "To whom do I reach out for resolving BUCET concerns?",
        "label": 26
    },
    {
        "text": "Outline the test's subject coverage.",
        "label": 54
    },
    {
        "text": "Must we pass Form 138 for both Grade 11 and Grade 12 admission prerequisites?",
        "label": 33
    },
    {
        "text": "Enlighten me on the various courses that the Bicol University Guinobatan",
        "label": 47
    },
    {
        "text": "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission dilemmas?",
        "label": 33
    },
    {
        "text": "How do I formally request and edit the picture I submitted online?",
        "label": 8
    },
    {
        "text": "Is there a specific form or process for altering my appointment date?",
        "label": 6
    },
    {
        "text": "Must we incorporate the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the mailed/couriered materials?",
        "label": 30
    },
    {
        "text": "Could you provide instructions on rescheduling my appointment date?",
        "label": 6
    },
    {
        "text": "What is the application fee structure for BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "I'm curious about the process of sending in the BUCET requirements; could you help?",
        "label": 51
    },
    {
        "text": "Where should I head to acquire the BUCET application form?",
        "label": 5
    },
    {
        "text": "Should Form 138 (Report Card) be submitted for both Grade 11 and Grade 12 enrollment?",
        "label": 33
    },
    {
        "text": "Explain the process of meeting the AY 202*-202* Bicol University College Entrance Test eligibility.",
        "label": 53
    },
    {
        "text": "Could you please provide me with the address of the BU admissions office?",
        "label": 18
    },
    {
        "text": "When is the deadline for turning in all the necessary documents?",
        "label": 9
    },
    {
        "text": "What's the appropriate way to inform the concerned parties about my need to obtain and retrieve the BUCET application form?",
        "label": 7
    },
    {
        "text": "Can you guide me on checking my BUCET examination outcomes?",
        "label": 52
    },
    {
        "text": "How do I handle the Php 50.00 mailing stamp to ensure it stays securely attached?",
        "label": 22
    },
    {
        "text": "Do I need the 40 pesos mailing stamp for this?",
        "label": 27
    },
    {
        "text": "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission interviews?",
        "label": 33
    },
    {
        "text": "What are the courses available in the College of Dental Medicine/(CDM)?",
        "label": 49
    },
    {
        "text": "Can you elaborate on the courses available at the College of Arts and Letters (CAL)?",
        "label": 39
    },
    {
        "text": "Can the postage stamp's value be higher than 40 pesos without any concern?",
        "label": 28
    },
    {
        "text": "Can you list the available courses at BU?",
        "label": 58
    },
    {
        "text": "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 admission procedures?",
        "label": 33
    },
    {
        "text": "Outline the online documentation requirements.",
        "label": 31
    },
    {
        "text": "What stores or vendors sell postage stamps for mailing purposes?",
        "label": 20
    },
    {
        "text": "Must we pass Form 138 for both Grade 11 and Grade 12 admission facets?",
        "label": 33
    },
    {
        "text": "What options are available for me to download and retrieve the BUCET application form?",
        "label": 7
    },
    {
        "text": "Can the postage stamp be more than 40 pesos?",
        "label": 28
    },
    {
        "text": "Do I need to submit an ITR, considering that my parent or guardian is classified as a senior citizen or PWD?",
        "label": 25
    },
    {
        "text": "How do I officially notify the organization about my desire to change my appointment date?",
        "label": 6
    },
    {
        "text": "How can I officially request to retrieve the BUCET application form?",
        "label": 7
    },
    {
        "text": "Enlighten me on the various courses that the BU Gubat Campus (BUGC provides.",
        "label": 38
    },
    {
        "text": "Is it permissible to affix a mailing stamp that is valued higher than Php 50.00?",
        "label": 28
    },
    {
        "text": "How do I initiate the process of claiming my BUCET test permit?",
        "label": 15
    },
    {
        "text": "Do we have to provide Form 138 for both Grade 11 and Grade 12 reporting periods?",
        "label": 33
    },
    {
        "text": "Is it permissible for the mailing stamp to be less than 40 pesos?",
        "label": 29
    },
    {
        "text": "How can I apply in Bicol University",
        "label": 50
    },
    {
        "text": "Will drop-off facilities be included in the infrastructure of Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Can you provide me with the deadline for providing all the documentary needs?",
        "label": 9
    },
    {
        "text": "Please share details about the courses present in the Jesse M. Robredo Institute of Governance and Development (JMRIGD)",
        "label": 42
    },
    {
        "text": "Is there a requirement to attach the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when sending documents by mail or courier?",
        "label": 30
    },
    {
        "text": "Enlighten me on the subject matter covered in the courses at the College of Nursing (CN)",
        "label": 41
    },
    {
        "text": "I'm curious about the course options within the College of Social Sciences and Philosophy (CSSP).",
        "label": 35
    },
    {
        "text": "I'm curious about the course options within the College of Dental Medicine (CDM)",
        "label": 49
    },
    {
        "text": "What steps should I take to request application fee waivers for BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "Is it compulsory to submit Form 138 for both Grade 11 and Grade 12 admission predicaments?",
        "label": 33
    },
    {
        "text": "When will the BUCET results become available for viewing?",
        "label": 55
    },
    {
        "text": "Where can I attend in-person appointments to discuss BUCET concerns?",
        "label": 26
    },
    {
        "text": "Should the package sent by mail/courier contain the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
        "label": 30
    },
    {
        "text": "Are there any specific requirements for international students applying to BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "Is it okay if our mailing stamp is more than Php 50.00?",
        "label": 28
    },
    {
        "text": "Where can I go to pick up the BUCET application form?",
        "label": 5
    },
    {
        "text": "Can you provide details on the cost of the BUCET application fee?",
        "label": 10
    },
    {
        "text": "Where do I need to go to fetch the BUCET application form?",
        "label": 5
    },
    {
        "text": "Is it permissible to have someone submit my requirements on my behalf?",
        "label": 11
    },
    {
        "text": "Are drop-off points under consideration for Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "How do I handle the Php 50.00 mailing stamp to avoid smudging or damage during the pasting process?",
        "label": 22
    },
    {
        "text": "When is the closing date for turning in all necessary documents?",
        "label": 9
    },
    {
        "text": "Is there a proposal to introduce dropboxes at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Can you clarify the eligibility conditions that necessitate obtaining a 4P's certificate?",
        "label": 24
    },
    {
        "text": "Is it within the rules for the mailing stamp to be valued over 40 pesos?",
        "label": 28
    },
    {
        "text": "Is it permissible for the mailing stamp to be priced at more than 40 pesos?",
        "label": 28
    },
    {
        "text": "Could you list the courses that the College of Science has to offer?",
        "label": 34
    },
    {
        "text": "Clarify the documents essential for online procedures.",
        "label": 31
    },
    {
        "text": "What's the recommended method for editing the picture after online submission?",
        "label": 8
    },
    {
        "text": "Discuss the online submission document lineup.",
        "label": 31
    },
    {
        "text": "Clarify the online submission document prerequisites.",
        "label": 31
    },
    {
        "text": "Is there a specific department or contact I should reach out to for rescheduling my appointment date?",
        "label": 6
    },
    {
        "text": "Can you guide me on where to address specific BUCET-related concerns?",
        "label": 26
    },
    {
        "text": "What is this?",
        "label": 3
    },
    {
        "text": "Should I notify the test center if my appointment date is already past their scheduled deadline?",
        "label": 17
    },
    {
        "text": "Is it within the rules to have a mailing stamp costing more than Php 50.00, or are there restrictions?",
        "label": 21
    },
    {
        "text": "In which sections of the supermarket can I find and purchase postage stamps?",
        "label": 20
    },
    {
        "text": "Elaborate on the courses available for students within the College of Nursing (CN) encompasses?",
        "label": 41
    },
    {
        "text": "Enumerate the topics that the test covers.",
        "label": 54
    },
    {
        "text": "Is there a specific authorization process for someone else to submit my BUCET application requirements?",
        "label": 11
    },
    {
        "text": "Can you provide information on the courses offered in the College of Education (CE)?",
        "label": 37
    },
    {
        "text": "What is the official website or platform for addressing BUCET concerns?",
        "label": 26
    },
    {
        "text": "What steps do I need to follow to claim my BUCET test permit?",
        "label": 15
    },
    {
        "text": "To whom should I direct my concerns regarding BUCET, and where is the appropriate address?",
        "label": 26
    },
    {
        "text": "Is there an option to reapply if there are errors in my initial application form?",
        "label": 12
    },
    {
        "text": "What is the range of topics in the test?",
        "label": 54
    },
    {
        "text": "Could you detail the additional submissions required if my parent/s is/are overseas Filipino workers (OFW)?",
        "label": 23
    },
    {
        "text": "Will Bicol University extend dropbox services to its satellite campuses?",
        "label": 32
    },
    {
        "text": "Will there be secure dropboxes available at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "What's the process for retrieving the BUCET application form?",
        "label": 7
    },
    {
        "text": "Can you share any details on the anticipated release date for BUCET results?",
        "label": 55
    },
    {
        "text": "What's the official channel for confirming BUCET exam pass outcomes?",
        "label": 52
    },
    {
        "text": "Tell me about the array of courses within the BU Gubat Campus (BUGC",
        "label": 38
    },
    {
        "text": "Are there any considerations for implementing dropboxes in Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Is mobile application submission an acceptable method?",
        "label": 57
    },
    {
        "text": "Could you provide instructions on the proper method for affixing the Php 50.00 mailing stamp?",
        "label": 22
    },
    {
        "text": "What paperwork should be submitted online?",
        "label": 31
    },
    {
        "text": "Can a legal guardian or relative submit my BUCET application requirements on my behalf?",
        "label": 11
    },
    {
        "text": "Provide a checklist for online application documents.",
        "label": 31
    },
    {
        "text": "How do I navigate the system to retrieve the BUCET application form?",
        "label": 7
    },
    {
        "text": "Provide a detailed overview of the BUCET requirements submission process.",
        "label": 51
    },
    {
        "text": "Can the mailing stamp value be below 40 pesos?",
        "label": 29
    },
    {
        "text": "What documents should be uploaded online?",
        "label": 31
    },
    {
        "text": "Share tips on ensuring eligibility for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "How can I admit in Bicol University",
        "label": 50
    },
    {
        "text": "Is it acceptable if our mailing stamp exceeds the value of Php 50.00?",
        "label": 28
    },
    {
        "text": "Is mobile application supported for the application process?",
        "label": 57
    },
    {
        "text": "Is it advisable to honor the appointment date, even if it surpasses the originally set deadline for the test center?",
        "label": 17
    },
    {
        "text": "How can I utilize the online portal to edit the picture I submitted?",
        "label": 8
    },
    {
        "text": "Can I submit my application using my mobile device?",
        "label": 57
    },
    {
        "text": "Can I start the application process again if I mistakenly filled out the form?",
        "label": 12
    },
    {
        "text": "I'm curious about the course options within the BU Tabaco (BUTC.",
        "label": 36
    },
    {
        "text": "What is the recommended timeframe for submitting my BUCET application requirements?",
        "label": 14
    },
    {
        "text": "Should I still follow my appointment date even if it surpasses the test center's deadline?",
        "label": 17
    },
    {
        "text": "What do I need to do to retrieve the BUCET application form?",
        "label": 7
    },
    {
        "text": "Could you inform me about where I can access the BUCET application form?",
        "label": 5
    },
    {
        "text": "Where do I go in the city center to purchase stamps for mailing purposes?",
        "label": 20
    },
    {
        "text": "Can you make me laugh?",
        "label": 4
    },
    {
        "text": "How does one typically find out if they passed the BUCET?",
        "label": 52
    },
    {
        "text": "Please share details about the courses present in the Institute of Design and Architecture (IDeA)?",
        "label": 40
    },
    {
        "text": "Will Bicol University extend dropbox services to its satellite campuses?",
        "label": 32
    },
    {
        "text": "Share information about the different courses one can take up at the College of Nursing (CN) encompasses?",
        "label": 41
    },
    {
        "text": "Is it permissible for the mailing stamp to surpass the 40 pesos limit?",
        "label": 28
    },
    {
        "text": "What kind of courses are available in the College of Industrial Technology (CIT)",
        "label": 45
    },
    {
        "text": "Can the postage stamp's value be higher than 40 pesos without any concern?",
        "label": 28
    },
    {
        "text": "Where can I purchase postage stamps for mailing?",
        "label": 20
    },
    {
        "text": "Can we use a mailing stamp with a denomination exceeding Php 50.00?",
        "label": 28
    },
    {
        "text": "How do I initiate the process of correcting a wrongly completed application form?",
        "label": 13
    },
    {
        "text": "What are the regulations concerning the mailing stamp amount, and is it acceptable to exceed Php 50.00?",
        "label": 21
    },
    {
        "text": "Could you point me in the right direction to get the BUCET application form?",
        "label": 5
    },
    {
        "text": "How do I formally request a change in my appointment date?",
        "label": 6
    },
    {
        "text": "Outline the qualifications and prerequisites for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Is there an online platform for checking BUCET pass results?",
        "label": 52
    },
    {
        "text": "What's the significance of the 40-peso stamp in passing requirements?",
        "label": 27
    },
    {
        "text": "Does the tax department provide any concessions for individuals with senior citizen or PWD parents or guardians regarding ITR?",
        "label": 25
    },
    {
        "text": "What documents are mandatory for submission with my BUCET application?",
        "label": 14
    },
    {
        "text": "What documents are needed for online submission?",
        "label": 31
    },
    {
        "text": "State the mandatory online document lineup.",
        "label": 31
    },
    {
        "text": "Can we expect to find dropboxes at the satellite campuses of Bicol University?",
        "label": 32
    },
    {
        "text": "Does the senior citizen or PWD status of my parent or guardian affect my obligation to submit an ITR?",
        "label": 25
    },
    {
        "text": "Can you recommend the best practices for pasting the Php 50.00 mailing stamp on different types of envelopes?",
        "label": 22
    },
    {
        "text": "How does ha`ving a 4P's certificate contribute to community development and welfare initiatives?",
        "label": 24
    },
    {
        "text": "Could you walk me through the process of confirming BUCET success?",
        "label": 52
    },
    {
        "text": "Can I correct my application by reapplying if I made mistakes?",
        "label": 12
    },
    {
        "text": "What courses does the Jesse M. Robredo Institute of Governance and Development (JMRIGD) feature in its curriculum?",
        "label": 42
    },
    {
        "text": "Are there specific courses that the College of Business, Economics and Management (CBEM) specializes in?",
        "label": 44
    },
    {
        "text": "How do I formally request to correct information in an application form that was filled out incorrectly?",
        "label": 13
    },
    {
        "text": "Are there specific criteria for authorizing someone to submit my BUCET application documents?",
        "label": 11
    },
    {
        "text": "What are the formalities involved in the submission of BUCET requirements?",
        "label": 51
    },
    {
        "text": "Is there a specific protocol for applicants who need to reapply due to errors on the form?",
        "label": 12
    },
    {
        "text": "Is it mandatory to pass Form 138 for both Grade 11 and Grade 12 admission inquiries?",
        "label": 33
    },
    {
        "text": "Can the postage stamp exceed 40 pesos in value without any trouble?",
        "label": 28
    },
    {
        "text": "Can you provide information on the courses offered in the College of Science?",
        "label": 34
    },
    {
        "text": "Mention the requisite documents for online validation.",
        "label": 31
    },
    {
        "text": "I would like to know about the course offerings in the College of Engineering (CENG)",
        "label": 46
    },
    {
        "text": "Should the 40 pesos postage stamp be used?",
        "label": 27
    },
    {
        "text": "Will Bicol University have dropboxes at its satellite campuses?",
        "label": 32
    },
    {
        "text": "Can I use my mobile device for application submission?",
        "label": 57
    },
    {
        "text": "Do we have to send the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier when submitting the requirements?",
        "label": 30
    },
    {
        "text": "Could you provide information on when the BUCET results will come out?",
        "label": 55
    },
    {
        "text": "If I make errors in my application form, can I reapply with the correct information?",
        "label": 12
    },
    {
        "text": "Are there plans to incorporate drop-off points in Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "I'm looking for the BUCET application form, do you know where I can find it?",
        "label": 5
    },
    {
        "text": "Could you list the courses that the Bicol University Polangui/(BUPC)?",
        "label": 48
    },
    {
        "text": "Are there any restrictions on who can physically submit my BUCET application requirements to the admissions office?",
        "label": 11
    },
    {
        "text": "Is it mandatory to submit an Income Tax Return (ITR) if my parent or guardian is a senior citizen or person with a disability (PWD)?",
        "label": 25
    },
    {
        "text": "Do you have information on the regional distribution of BUCET test centers?",
        "label": 56
    },
    {
        "text": "Can you explain the official policy for obtaining and retrieving the BUCET application form?",
        "label": 7
    },
    {
        "text": "Can I use a stamp that's higher than 40 pesos?",
        "label": 28
    },
    {
        "text": "Describe the online document prerequisites.",
        "label": 31
    },
    {
        "text": "Do we need to dispatch the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier along with other requirements?",
        "label": 30
    },
    {
        "text": "Can you inform me about the last day for submitting all required documents?",
        "label": 9
    },
    {
        "text": "Could you specify the topics included in the test?",
        "label": 54
    },
    {
        "text": "Where should I visit to purchase stamps for mailing?",
        "label": 20
    },
    {
        "text": "Must the 40 pesos mailing stamp be used?",
        "label": 27
    },
    {
        "text": "Should Form 138 (Report Card) be provided for both Grade 11 and Grade 12 admission uncertainties?",
        "label": 33
    },
    {
        "text": "I would like to know about the course offerings in the Institute of Design and Architecture (IDeA)?",
        "label": 40
    },
    {
        "text": "Clarify the necessary steps for successfully submitting the BUCET requirements.",
        "label": 51
    },
    {
        "text": "What steps should I take to validate whether I've passed the BUCET?",
        "label": 52
    },
    {
        "text": "What is the address of the BU admissions office?",
        "label": 18
    },
    {
        "text": "Are there any forms or documentation required to accompany the correction of an application form?",
        "label": 13
    },
    {
        "text": "What steps need to be followed to successfully submit the BUCET requirements?",
        "label": 51
    },
    {
        "text": "Does the necessity for a 4P's certificate vary based on the demographic or household composition?",
        "label": 24
    },
    {
        "text": "What purpose does a 4P's certificate serve, and is it mandatory?",
        "label": 24
    },
    {
        "text": "Is there a specific form or letter required to authorize someone to submit my BUCET application documents?",
        "label": 11
    },
    {
        "text": "Tell me about the array of courses within the College of Social Sciences and Philosophy (CSSP).",
        "label": 35
    },
    {
        "text": "What kind of courses are available in the College of Industrial Technology/(CIT)?",
        "label": 45
    },
    {
        "text": "When selecting option 1 or option 3, is following the appointment date a requirement?",
        "label": 16
    },
    {
        "text": "Can you elaborate on the courses available at the College of Business, Economics and Management (CBEM)",
        "label": 44
    },
    {
        "text": "I'm eager to find out when the BUCET results will be released.",
        "label": 55
    },
    {
        "text": "Is there a system in place for confirming BUCET pass results?",
        "label": 52
    },
    {
        "text": "Should I anticipate any complications if I adhere to my appointment date beyond the test center's deadline?",
        "label": 17
    },
    {
        "text": "Can you provide information on the courses offered in the BU Gubat Campus (BUGC)?",
        "label": 38
    },
    {
        "text": "Are there any extra forms or papers required if my parent/s is/are overseas Filipino workers (OFW)?",
        "label": 23
    },
    {
        "text": "Is it within the rules for the mailing stamp to be valued at more than 40 pesos?",
        "label": 28
    },
    {
        "text": "Is it within the rules for the mailing stamp to be more than 40 pesos?",
        "label": 28
    },
    {
        "text": "Should Form 138 (Report Card) be submitted for both Grade 11 and Grade 12 admission decisions?",
        "label": 33
    },
    {
        "text": "What are the formal requirements for initiating the submission of BUCET requirements?",
        "label": 51
    },
    {
        "text": "What is the recommended action for individuals with appointment dates that surpass the test center's deadline?",
        "label": 17
    },
    {
        "text": "Should the mailed/couriered documents include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
        "label": 30
    },
    {
        "text": "Can you elaborate on the courses available at the College of Dental Medicine (CDM)",
        "label": 49
    },
    {
        "text": "Share details on the eligibility criteria for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "I'm planning to apply for BUCET 202*-202*; what advice do you have?",
        "label": 50
    },
    {
        "text": "Clarify the eligibility conditions for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "I need to know the deadline for submitting all the necessary documentary materials.",
        "label": 9
    },
    {
        "text": "Is the 40 pesos mailing stamp a necessity?",
        "label": 27
    },
    {
        "text": "Can you provide information on the courses offered in the College of Engineering (CENG)?",
        "label": 47
    },
    {
        "text": "I'm looking to apply for BUCET 202*-202*; what are the steps involved?",
        "label": 50
    },
    {
        "text": "Is there a requirement to attach the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when sending documents by mail or courier?",
        "label": 30
    },
    {
        "text": "Explain the eligibility standards for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Do we need to present Form 138 for both Grade 11 and Grade 12 official records?",
        "label": 33
    },
    {
        "text": "Is it necessary to submit Form 138, which is the Report Card, for both Grade 11 and Grade 12?",
        "label": 33
    },
    {
        "text": "Should I stick to the appointment date, even if it is already beyond the test center's initial deadline?",
        "label": 17
    },
    {
        "text": "Will dropboxes be available at the satellite campuses of Bicol University?",
        "label": 32
    },
    {
        "text": "Share some insights into the courses one can pursue at the College of Industrial Technology (CIT)",
        "label": 45
    },
    {
        "text": "Is it feasible to complete the application on a mobile device?",
        "label": 57
    },
    {
        "text": "If I select option 1 or option 3, should I adhere to the scheduled appointment date?",
        "label": 16
    },
    {
        "text": "Can a designated agent or representative submit my BUCET application requirements if I am unable to do so?",
        "label": 11
    },
    {
        "text": "What should I do if my appointment date has passed the designated deadline for the test center?",
        "label": 17
    },
    {
        "text": "Must the 40 pesos mailing stamp be used?",
        "label": 27
    },
    {
        "text": "If my parent or guardian is a senior citizen or PWD, does that exempt me from the requirement to submit an ITR?",
        "label": 25
    },
    {
        "text": "What is the proper procedure for editing the online-submitted picture?",
        "label": 8
    },
    {
        "text": "Is there a specific link or section for claiming the BUCET test permit?",
        "label": 15
    },
    {
        "text": "Is there a difference in the requirements for obtaining a 4P's certificate for individuals and families?",
        "label": 24
    },
    {
        "text": "Does the choice between option 1 or option 3 necessitate a change in my originally assigned appointment date?",
        "label": 16
    },
    {
        "text": "How early should I start preparing for BUCET 202*-202* application?",
        "label": 50
    },
    {
        "text": "Should the package sent by mail/courier contain the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
        "label": 30
    },
    {
        "text": "What topics are part of the test?",
        "label": 54
    },
    {
        "text": "Could you clarify whether using a mailing stamp over Php 50.00 is allowed?",
        "label": 21
    },
    {
        "text": "What documents are essential to submit if my parent is an overseas Filipino worker (OFW)?",
        "label": 23
    },
    {
        "text": "Can I be exempted from submitting an ITR if my parent or guardian is classified as a senior citizen or PWD?",
        "label": 25
    },
    {
        "text": "Are there any specific guidelines for individuals with senior citizen or PWD parents or guardians regarding ITR submission?",
        "label": 25
    },
    {
        "text": "What documentation is required when one or both of my parents work as overseas Filipino workers (OFWs)?",
        "label": 23
    },
    {
        "text": "Can you share the official mailing address for the BU admissions office?",
        "label": 18
    },
    {
        "text": "What are the criteria for designating a representative to submit my BUCET application materials?",
        "label": 11
    },
    {
        "text": "Tell me about the array of courses within the BU Tabaco (BUTC",
        "label": 36
    },
    {
        "text": "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission aspects?",
        "label": 33
    },
    {
        "text": "Can I use a stamp that's valued above 40 pesos?",
        "label": 28
    },
    {
        "text": "In the event of errors on my application form, am I allowed to submit a corrected re-application?",
        "label": 12
    },
    {
        "text": "Should I contact the test center's support for guidance if my appointment date falls beyond their deadline?",
        "label": 17
    },
    {
        "text": "Specify the documents required for online procedures.",
        "label": 31
    },
    {
        "text": "Must we submit Form 138 for both Grade 11 and Grade 12 admission traits?",
        "label": 33
    },
    {
        "text": "How soon can I expect a confirmation after submitting a request to correct a wrongly completed application form?",
        "label": 13
    },
    {
        "text": "Is there a specific department or contact I should reach out to for editing the online-submitted picture?",
        "label": 8
    },
    {
        "text": "Are dropboxes expected to be present in Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Are there plans to set up dropboxes in Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Tell me about the array of courses within the College of Dental Medicine (CDM)",
        "label": 49
    },
    {
        "text": "Do we need to present Form 138 for both Grade 11 and Grade 12?",
        "label": 33
    },
    {
        "text": "Could you inform me of the standard picture format that is acceptable?",
        "label": 19
    },
    {
        "text": "Where do I buy mailing stamp?",
        "label": 20
    },
    {
        "text": "Any insights on how I can confirm my success in the BUCET?",
        "label": 52
    },
    {
        "text": "What is the exact street address of the BU admissions office?",
        "label": 18
    },
    {
        "text": "Must Form 138 be submitted for both Grade 11 and Grade 12 semesters?",
        "label": 33
    },
    {
        "text": "Have they provided any details on when the BUCET results will be released?",
        "label": 55
    },
    {
        "text": "Are there any specific guidelines or requirements for applicants with parents who are currently working overseas as OFWs?",
        "label": 23
    },
    {
        "text": "State the mandatory online document criteria.",
        "label": 31
    },
    {
        "text": "Share the necessary online documentation details.",
        "label": 31
    },
    {
        "text": "I'm hanging up now.",
        "label": 1
    },
    {
        "text": "Break down the sequential steps for the BUCET requirements submission process.",
        "label": 51
    },
    {
        "text": "Where are the BUCET test centers scattered throughout the country?",
        "label": 56
    },
    {
        "text": "Is there a designated time for the release of the BUCET results?",
        "label": 55
    },
    {
        "text": "What locations offer mailing stamps for sale?",
        "label": 20
    },
    {
        "text": "How do I go about checking my BUCET exam pass status?",
        "label": 52
    },
    {
        "text": "Share some insights into the courses one can pursue at the Institute of Design and Architecture (IDeA)?",
        "label": 40
    },
    {
        "text": "Should Form 138 (Report Card) be provided for both Grade 11 and Grade 12 admission attributes?",
        "label": 33
    },
    {
        "text": "What documents are needed for online submission?",
        "label": 31
    },
    {
        "text": "Elaborate on the essential online document compilation.",
        "label": 31
    },
    {
        "text": "What's the appropriate way to inform the concerned parties about my need to change my appointment date?",
        "label": 6
    },
    {
        "text": "What is the policy regarding the BUCET application fee for transfer students?",
        "label": 10
    },
    {
        "text": "How to admit in Bicol University?",
        "label": 50
    },
    {
        "text": "What kind of courses are available in the College of Business, Economics and Management/(CBEM)?",
        "label": 44
    },
    {
        "text": "Is it mandatory to submit the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier service?",
        "label": 30
    },
    {
        "text": "Would it be acceptable for the postage stamp to be less than 40 pesos?",
        "label": 29
    },
    {
        "text": "I'm unfamiliar with the process; could you provide a detailed explanation of BUCET requirements submission?",
        "label": 51
    },
    {
        "text": "How do I initiate the submission of my BUCET application requirements?",
        "label": 14
    },
    {
        "text": "Can you provide a stepwise breakdown of the BUCET requirements submission process?",
        "label": 51
    },
    {
        "text": "Is there a process for reapplying if errors were made in the initial application form?",
        "label": 12
    },
    {
        "text": "Could you elaborate on the steps involved in submitting the BUCET requirements?",
        "label": 51
    },
    {
        "text": "Will Bicol University establish drop-off locations at its satellite campuses?",
        "label": 32
    },
    {
        "text": "Please explain the application steps for BUCET 202*-202*.",
        "label": 50
    },
    {
        "text": "What steps do I need to take to obtain the BUCET application form?",
        "label": 7
    },
    {
        "text": "What's the designated place to get the BUCET application form?",
        "label": 5
    },
    {
        "text": "Do I need to follow the standard ITR submission procedure if my parent or guardian is a senior citizen or PWD?",
        "label": 25
    },
    {
        "text": "Can you guide me on how to utilize the online chat support for addressing BUCET concerns?",
        "label": 26
    },
    {
        "text": "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission difficulties?",
        "label": 33
    },
    {
        "text": "Enumerate the test's topics matter for me.",
        "label": 54
    },
    {
        "text": "What are the courses available in the College of Industrial Technology/(CIT)?",
        "label": 45
    },
    {
        "text": "What is the mailing address for official documents to be sent to the BU admissions office?",
        "label": 18
    },
    {
        "text": "Is there a specific link or download page for retrieving the BUCET application form?",
        "label": 7
    },
    {
        "text": "That's helpful.",
        "label": 2
    },
    {
        "text": "What is the standard fee amount for the BUCET application?",
        "label": 10
    },
    {
        "text": "How do I retrieve the BUCET application form?",
        "label": 7
    },
    {
        "text": "Is the 40 pesos postage stamp indispensable?",
        "label": 27
    },
    {
        "text": "How will I receive confirmation of my performance in the BUCET?",
        "label": 52
    },
    {
        "text": "Where can I find the BUCET test centers on the map?",
        "label": 56
    },
    {
        "text": "What is the procedure for turning in the BUCET requirements?",
        "label": 51
    },
    {
        "text": "Break down the eligibility requirements for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Which topics are examined in the test?",
        "label": 54
    },
    {
        "text": "Where in the neighborhood can I go to purchase stamps for mailing?",
        "label": 20
    },
    {
        "text": "Is it okay if the mailing stamp doesn't reach 40 pesos?",
        "label": 29
    },
    {
        "text": "Can the postage be below 40 pesos and still be acceptable?",
        "label": 29
    },
    {
        "text": "Is reapplying allowed if I made mistakes on my initial application form?",
        "label": 12
    },
    {
        "text": "Tell me about the array of courses within the College of Industrial Technology (CIT)",
        "label": 45
    },
    {
        "text": "Tell me about the array of courses within the College of Education (CE)",
        "label": 37
    },
    {
        "text": "Are there specific guidelines for checking if I passed the BUCET?",
        "label": 52
    },
    {
        "text": "Must the 40 pesos mailing stamp be attached?",
        "label": 27
    },
    {
        "text": "Is the provision of an ITR a necessary component when a parent or guardian is a senior citizen or PWD?",
        "label": 25
    },
    {
        "text": "Is it mandatory for me to submit an ITR if my parent or guardian is a senior citizen or PWD?",
        "label": 25
    },
    {
        "text": "Please share details about the courses present in the College of Business, Economics and Management (CBEM)",
        "label": 44
    },
    {
        "text": "Can students specifically use drop-off bins specifically for requirements submission specifically at the BU Main Campus?",
        "label": 32
    },
    {
        "text": "Can you identify the subjects included in the test?",
        "label": 54
    },
    {
        "text": "Enlighten me on the intricacies of the BUCET requirements submission process.",
        "label": 51
    },
    {
        "text": "Will there be designated drop-off points at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Are there specific courses that the College of Science specializes in?:",
        "label": 34
    },
    {
        "text": "Could you explain how one can determine their success in the BUCET?",
        "label": 52
    },
    {
        "text": "What are the courses available in the College of Science?",
        "label": 34
    },
    {
        "text": "Should Form 138 (Report Card) be presented for both Grade 11 and Grade 12 admission specifications?",
        "label": 33
    },
    {
        "text": "What is the specific location or street address of the BU admissions office?",
        "label": 18
    },
    {
        "text": "What is the proper protocol for turning in the BUCET requirements?",
        "label": 51
    },
    {
        "text": "If my parent/s is/are overseas Filipino workers (OFW), what supplementary documents must I include in my submission?",
        "label": 23
    },
    {
        "text": "Can you provide guidance on the angle and alignment when pasting the Php 50.00 mailing stamp?",
        "label": 22
    },
    {
        "text": "What kind of courses are available in the College of Social Sciences and Philosophy (CSSP)?",
        "label": 35
    },
    {
        "text": "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12?",
        "label": 33
    },
    {
        "text": "What is the cutoff date for the submission of the necessary documentation?",
        "label": 9
    },
    {
        "text": "If I opt for either option 1 or option 3, does that mean I have to keep my first appointment date?",
        "label": 16
    },
    {
        "text": "Describe the qualifications and criteria for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Will specifically designated dropboxes specifically be specifically accessible specifically for students submitting requirements specifically at the BU Main Campus?",
        "label": 32
    },
    {
        "text": "Are there additional documents necessary when one or both of my parents are overseas Filipino workers (OFW)?",
        "label": 23
    },
    {
        "text": "Inquire about the courses one can enroll in at the College of Dental Medicine (CDM)",
        "label": 49
    },
    {
        "text": "Are there any restrictions on who can submit my BUCET application requirements for me?",
        "label": 11
    },
    {
        "text": "That was really helpful, thank you.",
        "label": 2
    },
    {
        "text": "What options do I have for shifting my appointment to a different date?",
        "label": 6
    },
    {
        "text": "Will there be a provision for dropboxes in Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "What nearby locations provide mailing stamps for sale?",
        "label": 20
    },
    {
        "text": "Provide a comprehensive list of online submission requirements.",
        "label": 31
    },
    {
        "text": "What paperwork is required for online submission?",
        "label": 31
    },
    {
        "text": "What are the recommended techniques for pasting the Php 50.00 mailing stamp effectively?",
        "label": 22
    },
    {
        "text": "What courses does the Bicol University Guinobatan feature in its curriculum?",
        "label": 47
    },
    {
        "text": "Please share details about the courses present in the BU Polangui",
        "label": 48
    },
    {
        "text": "What is the expected response time for addressing concerns raised about BUCET?",
        "label": 26
    },
    {
        "text": "Is it within the acceptable range if the postage falls short of 40 pesos?",
        "label": 29
    },
    {
        "text": "What steps can I take to correct my application form and submit a fresh application?",
        "label": 12
    },
    {
        "text": "Could you specify the appropriate picture format for submission?",
        "label": 19
    },
    {
        "text": "Is it permissible for the mailing stamp to be less than 40 pesos?",
        "label": 29
    },
    {
        "text": "Must we submit Form 138 for both Grade 11 and Grade 12 transcripts?",
        "label": 33
    },
    {
        "text": "Where can I find the official address of the BU admissions office online?",
        "label": 18
    },
    {
        "text": "Could you let me know the precise amount of the BUCET application fee?",
        "label": 10
    },
    {
        "text": "Do I need to provide extra information or documentation if my parents are OFWs?",
        "label": 23
    },
    {
        "text": "Can the mailing stamp's value surpass 40 pesos without consequences?",
        "label": 28
    },
    {
        "text": "What is the official helpline or hotline for addressing urgent BUCET concerns?",
        "label": 26
    },
    {
        "text": "Would it be acceptable for the postage to be under 40 pesos?",
        "label": 29
    },
    {
        "text": "What are the specific requirements for the formal submission of BUCET documents?",
        "label": 51
    },
    {
        "text": "Describe the range of topics in the test.",
        "label": 54
    },
    {
        "text": "Is Form 138 required for both Grade 11 and Grade 12 admission confusions?",
        "label": 33
    },
    {
        "text": "Could you specify the final deadline for the submission of all documentary requirements?",
        "label": 9
    },
    {
        "text": "Do we need to secure a certificate from 4P's for any specific purpose?",
        "label": 24
    },
    {
        "text": "Inquire about the courses one can enroll in at the College of Science.",
        "label": 34
    },
    {
        "text": "Do we need to attach the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when submitting documents via mail or courier service?",
        "label": 30
    },
    {
        "text": "What is the official avenue for addressing concerns related to BUCET eligibility criteria?",
        "label": 26
    },
    {
        "text": "Is it permissible for the postage stamp to go over the 40 pesos limit?",
        "label": 28
    },
    {
        "text": "Must I use the 40 pesos postage stamp?",
        "label": 27
    },
    {
        "text": "Explain the documentation needed to qualify for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Can you explain the official policy for rescheduling appointment dates?",
        "label": 6
    },
    {
        "text": "How can I apply for BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "Provide information on the test's covered subject areas.",
        "label": 54
    },
    {
        "text": "I would appreciate guidance on the location or store where I can buy a mailing stamp?",
        "label": 20
    },
    {
        "text": "Could you provide instructions on how to replace or update the image I previously submitted online?",
        "label": 8
    },
    {
        "text": "When are they planning to unveil the results of the BUCET?",
        "label": 55
    },
    {
        "text": "Is it mandatory to pass Form 138 for both Grade 11 and Grade 12 admission stages?",
        "label": 33
    },
    {
        "text": "Is there a designated person who can handle the submission of my BUCET application documents?",
        "label": 11
    },
    {
        "text": "Specify the documents essential for online verification.",
        "label": 31
    },
    {
        "text": "Can you provide the official address for contacting the BU admissions office?",
        "label": 18
    },
    {
        "text": "Is there flexibility for individuals whose appointment dates extend beyond the test center's deadline?",
        "label": 17
    },
    {
        "text": "Can you tell me the steps involved in obtaining and retrieving the BUCET application form?",
        "label": 7
    },
    {
        "text": "Must we incorporate the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the materials sent via mail or courier?",
        "label": 30
    },
    {
        "text": "Is there an exemption from submitting an ITR for individuals with senior citizen or PWD parents or guardians?",
        "label": 25
    },
    {
        "text": "Should the 40 pesos postage stamp be attached?",
        "label": 27
    },
    {
        "text": "Is it mandatory to submit the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier?",
        "label": 30
    },
    {
        "text": "What steps should I take to rectify errors in a wrongly completed application form?",
        "label": 13
    },
    {
        "text": "Is the 40 pesos mailing stamp important/required?",
        "label": 27
    },
    {
        "text": "Can the mailing stamp value fall short of 40 pesos?",
        "label": 29
    },
    {
        "text": "Can you provide the physical address for the BU admissions office for any in-person visits?",
        "label": 18
    },
    {
        "text": "Could you inform me of the proper channels to go through for rescheduling my appointment date?",
        "label": 6
    },
    {
        "text": "Share some insights into the courses one can pursue at the College of Engineering (CENG)",
        "label": 46
    },
    {
        "text": "Provide a checklist of online application documents.",
        "label": 31
    },
    {
        "text": "What are the steps for reapplying to BUCET 202*-202* if my previous application was not successful?",
        "label": 50
    },
    {
        "text": "Can you clarify the cost of the BUCET application and any processing fees?",
        "label": 10
    },
    {
        "text": "Explain the eligibility criteria and qualifications for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Should I keep my original appointment date if I choose either option 1 or option 3?",
        "label": 16
    },
    {
        "text": "Can you elaborate on the courses available at the Institute of Design and Architecture (IDeA)?",
        "label": 40
    },
    {
        "text": "How do I access the retrieval feature for the BUCET application form?",
        "label": 7
    },
    {
        "text": "Will Bicol University include dropbox facilities in its satellite campuses?",
        "label": 32
    },
    {
        "text": "What's the proper procedure for changing my appointment date?",
        "label": 6
    },
    {
        "text": "Must we pass Form 138 for both Grade 11 and Grade 12 admission complications?",
        "label": 33
    },
    {
        "text": "Can you provide guidance on the proper procedure if the mailing stamp needed exceeds Php 50.00?",
        "label": 21
    },
    {
        "text": "How do I handle the Php 50.00 mailing stamp to prevent it from getting damaged or torn?",
        "label": 22
    },
    {
        "text": "Where is the distribution point for the BUCET application form?",
        "label": 5
    },
    {
        "text": "Are there plans to introduce dropbox systems at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Enlighten me on the various courses that the College of Social Sciences and Philosophy (CSSP) provides.",
        "label": 35
    },
    {
        "text": "Is it within the rules to have a mailing stamp costing more than Php 50.00, or are there restrictions?",
        "label": 28
    },
    {
        "text": "Do we have to send the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier when submitting the requirements?",
        "label": 30
    },
    {
        "text": "What is the street address for the BU admissions office, and where is it situated on campus?",
        "label": 18
    },
    {
        "text": "Is it compulsory to affix the 40 pesos mailing stamp?",
        "label": 27
    },
    {
        "text": "Any recommendations on ensuring I successfully passed the BUCET?",
        "label": 52
    },
    {
        "text": "Should the mailed/couriered documents include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
        "label": 30
    },
    {
        "text": "Will there be drop-off services available at the satellite campuses of Bicol University?",
        "label": 32
    },
    {
        "text": "Can you elaborate on the courses available at the Jesse M. Robredo Institute of Governance and Development (JMRIGD)",
        "label": 42
    },
    {
        "text": "What are the courses available in the College of Business, Economics and Management/(CBEM)?",
        "label": 44
    },
    {
        "text": "Is it mandatory to pass Form 138 for both Grade 11 and Grade 12 admission setbacks?",
        "label": 33
    },
    {
        "text": "What kind of courses are available in the Jesse M. Robredo Institute of Governance and Development (JMRIGD)?",
        "label": 42
    },
    {
        "text": "What adhesive should I use when affixing the Php 50.00 mailing stamp to the envelope?",
        "label": 22
    },
    {
        "text": "Would it be acceptable if the postage stamp exceeded 40 pesos?",
        "label": 28
    },
    {
        "text": "What is the process for changing my appointment date?",
        "label": 6
    },
    {
        "text": "Share some insights into the courses one can pursue at the BU Tabaco (BUTC",
        "label": 36
    },
    {
        "text": "Can you walk me through the steps to correct a mistakenly filled application form?",
        "label": 13
    },
    {
        "text": "I'm looking for guidance on the appropriate method for submitting the BUCET requirements.",
        "label": 51
    },
    {
        "text": "Enumerate the documents to be submitted online.",
        "label": 31
    },
    {
        "text": "Would it be alright for the postage stamp to exceed the 40 pesos limit?",
        "label": 28
    },
    {
        "text": "Where should I direct mail or correspondence for the BU admissions office, and what is the address?",
        "label": 18
    },
    {
        "text": "Is there any provision for using a mailing stamp worth more than Php 50.00 in your guidelines?",
        "label": 21
    },
    {
        "text": "Is Form 138 (Report Card) necessary for both Grade 11 and Grade 12 admission waitlists?",
        "label": 33
    },
    {
        "text": "Outline the online submission document criteria.",
        "label": 31
    },
    {
        "text": "Is the submission of an ITR necessary when a parent or guardian is classified as a senior citizen or PWD?",
        "label": 25
    },
    {
        "text": "Could you outline the steps for retrieving the BUCET application form?",
        "label": 7
    },
    {
        "text": "What's the formal way to request and edit the online-submitted picture?",
        "label": 8
    },
    {
        "text": "Can you elaborate on the role of a 4P's certificate in the context of social welfare programs?",
        "label": 24
    },
    {
        "text": "What's the acceptance rate for applicants to BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "What are the courses available at BU?",
        "label": 58
    },
    {
        "text": "Can you simplify the process of submitting the BUCET requirements for me?",
        "label": 51
    },
    {
        "text": "Are there any guidelines on the orientation or placement when pasting the Php 50.00 mailing stamp?",
        "label": 22
    },
    {
        "text": "Are there plans to establish drop-off locations in Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Can you guide me on checking my BUCET examination pass status?",
        "label": 52
    },
    {
        "text": "Will specifically designated dropboxes specifically feature drop-off areas specifically for the ease of requirements submission at the BU Main Campus?",
        "label": 32
    },
    {
        "text": "What kind of courses are available in the Institute of Physical Education, Sports and Recreation (IPESR)?",
        "label": 43
    },
    {
        "text": "Am I eligible to reapply if I made inadvertent mistakes on my initial application form?",
        "label": 12
    },
    {
        "text": "Share some insights into the courses one can pursue at the College of Social Sciences and Philosophy (CSSP).",
        "label": 35
    },
    {
        "text": "Outline the required steps for successfully submitting the BUCET requirements.",
        "label": 51
    },
    {
        "text": "Provide a checklist of online application documents.",
        "label": 31
    },
    {
        "text": "Where should I go or what website should I visit to get the BUCET application form?",
        "label": 7
    },
    {
        "text": "When is the last possible date for submitting all required documents?",
        "label": 9
    },
    {
        "text": "Is there a specific method to check if I made it through the BUCET?",
        "label": 52
    },
    {
        "text": "Is there a designated mechanism for applicants to amend errors on their completed application forms?",
        "label": 13
    },
    {
        "text": "I'm seeking clarity on the steps required for BUCET requirements submission; can you help?",
        "label": 51
    },
    {
        "text": "Is there a formal process for correcting an application form that was filled out incorrectly?",
        "label": 13
    },
    {
        "text": "Is there a proposal to introduce dropboxes at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "What is the range of subjects addressed in the test?",
        "label": 54
    },
    {
        "text": "Share some insights into the courses one can pursue at the College of Dental Medicine (CDM)",
        "label": 49
    },
    {
        "text": "I'm curious about when the BUCET results are scheduled to come out.",
        "label": 55
    },
    {
        "text": "Can you explain the formalities involved in the submission of BUCET requirements?",
        "label": 51
    },
    {
        "text": "Are there specific courses that the College of Industrial Technology (CIT)specializes in?",
        "label": 45
    },
    {
        "text": "Will there be designated areas for dropboxes in Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Must Form 138 (Report Card) be submitted for both Grade 11 and Grade 12 admission steps?",
        "label": 33
    },
    {
        "text": "Could you outline the steps for editing the online-submitted picture?",
        "label": 8
    },
    {
        "text": "Where can I find the appropriate contact information or address to voice my BUCET concerns?",
        "label": 26
    },
    {
        "text": "Is it acceptable to use a stamp that exceeds 40 pesos?",
        "label": 28
    },
    {
        "text": "I need to find out where I can pick up the BUCET application form?",
        "label": 5
    },
    {
        "text": "Could you provide information on applying for BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "Can you explain the correct way to submit the BUCET requirements for assessment?",
        "label": 51
    },
    {
        "text": "Can you explain the steps one should take to qualify for the AY 202*-202* Bicol University College Entrance Test?",
        "label": 53
    },
    {
        "text": "Can I correct mistakes and resubmit my application, or do I need to start a new application altogether?",
        "label": 12
    },
    {
        "text": "Please share details about the courses present in the Institute of Physical Education, Sports and Recreation (IPESR)",
        "label": 43
    },
    {
        "text": "What actions are required for the formal submission of BUCET requirements?",
        "label": 51
    },
    {
        "text": "Inquire about the courses one can enroll in at the Institute of Design and Architecture (IDeA)?.",
        "label": 40
    },
    {
        "text": "How do I confirm that the corrections I made to my application form have been successfully processed?",
        "label": 13
    },
    {
        "text": "What are the courses available in the Jesse M. Robredo Institute of Governance and Development (JMRIGD)?",
        "label": 42
    },
    {
        "text": "Discuss the online submission document requirements.",
        "label": 31
    },
    {
        "text": "Is there a problem if the mailing stamp used is more than Php 50.00 in value?",
        "label": 21
    },
    {
        "text": "Could you list the courses that the College of Engineering (CENG)?",
        "label": 47
    },
    {
        "text": "Is it fine if the postage doesn't reach 40 pesos?",
        "label": 29
    },
    {
        "text": "Can you elaborate on the courses available at the Institute of Physical Education, Sports and Recreation (IPESR)",
        "label": 43
    },
    {
        "text": "Does either option 1 or option 3 influence the requirement to follow the original appointment date?",
        "label": 16
    },
    {
        "text": "What's the official way of confirming BUCET exam results?",
        "label": 52
    },
    {
        "text": "Is it okay if the mailing stamp value is less than 40 pesos?",
        "label": 29
    },
    {
        "text": "Is there a particular portal where I can verify my BUCET pass results?",
        "label": 52
    },
    {
        "text": "What is the correct method for affixing the Php 50.00 mailing stamp?",
        "label": 22
    },
    {
        "text": "I'm curious about the course options within the Bicol University Guinobatan",
        "label": 47
    },
    {
        "text": "Can the postage be below 40 pesos and still be acceptable?",
        "label": 29
    },
    {
        "text": "What is the range of subjects in the test?",
        "label": 54
    },
    {
        "text": "Is including the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the mailed/couriered documents a prerequisite?",
        "label": 30
    },
    {
        "text": "Must we submit Form 138 for both Grade 11 and Grade 12 acceptance?",
        "label": 33
    },
    {
        "text": "Is it compulsory to enclose the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the submitted documents via mail or courier?",
        "label": 30
    },
    {
        "text": "Are there any restrictions if our mailing stamp has a value exceeding Php 50.00?",
        "label": 21
    },
    {
        "text": "Can you share details about the BUCET test centers' locations?",
        "label": 56
    },
    {
        "text": "I would appreciate clarification on the correct picture format for this requirement.",
        "label": 19
    },
    {
        "text": "Can you elaborate on the courses available at the College of Engineering (CENG)",
        "label": 46
    },
    {
        "text": "What documentation do I need to prepare before submitting my BUCET application?",
        "label": 14
    },
    {
        "text": "Can you tell me the steps involved in claiming the BUCET test permit?",
        "label": 15
    },
    {
        "text": "Could you walk me through the required actions for submitting the BUCET requirements?",
        "label": 51
    },
    {
        "text": "What subjects are part of the test's focus?",
        "label": 54
    },
    {
        "text": "What's the point of paying 40 pesos for a mailing stamp?",
        "label": 27
    },
    {
        "text": "How does my decision between option 1 or option 3 impact the adherence to the initial appointment date?",
        "label": 16
    },
    {
        "text": "Can I reapply if I made errors in filling out my initial application form?",
        "label": 12
    },
    {
        "text": "Can I use my phone to apply?",
        "label": 57
    },
    {
        "text": "Is it a requirement to provide Form 138 for both Grade 11 and Grade 12 admission criteria?",
        "label": 33
    },
    {
        "text": "Can the postage stamp go beyond 40 pesos in value without any trouble?",
        "label": 28
    },
    {
        "text": "Provide a checklist of requirements for AY 202*-202* Bicol University College Entrance Test eligibility.",
        "label": 53
    },
    {
        "text": "Will there be dropboxes in satellite campuses of Bicol University?",
        "label": 32
    },
    {
        "text": "Can you provide information on where I can procure the BUCET application form?",
        "label": 5
    },
    {
        "text": "Is the 40 pesos stamp essential for mailing?",
        "label": 27
    },
    {
        "text": "Are there any pre-requisite courses required for BUCET 202*-202* application?",
        "label": 50
    },
    {
        "text": "Is it okay if our mailing stamp is more than Php 50.00?",
        "label": 21
    },
    {
        "text": "Is the 40 pesos stamp mandatory for mailing?",
        "label": 27
    },
    {
        "text": "Can I submit my application using my smartphone?",
        "label": 57
    },
    {
        "text": "What's the procedure for confirming BUCET exam outcomes?",
        "label": 52
    },
    {
        "text": "Do we need to submit Form 138 for both Grade 11 and Grade 12 assessments?",
        "label": 33
    },
    {
        "text": "Provide information on the test's included topics.",
        "label": 54
    },
    {
        "text": "Is there a process for obtaining approval to use a mailing stamp valued above Php 50.00?",
        "label": 21
    },
    {
        "text": "Share some insights into the courses one can pursue at the Bicol University Polangui",
        "label": 48
    },
    {
        "text": "Can you advise me on where to process my application form retrieval request?",
        "label": 7
    },
    {
        "text": "How does the test center handle appointment dates that go beyond the scheduled deadline?",
        "label": 17
    },
    {
        "text": "Is the 40 pesos stamp crucial for mailing?",
        "label": 27
    },
    {
        "text": "Tell me about the array of courses within the College of Engineering (CENG)",
        "label": 46
    },
    {
        "text": "Can the postage stamp value fall short of 40 pesos?",
        "label": 29
    },
    {
        "text": "How does the decision between option 1 or option 3 influence my commitment to the initially assigned appointment date?",
        "label": 16
    },
    {
        "text": "Where can I find the BUCET application form on campus?",
        "label": 5
    },
    {
        "text": "Can you specify the subjects included in the test?",
        "label": 54
    },
    {
        "text": "Can you tell me the addresses of the BUCET test centers?",
        "label": 56
    },
    {
        "text": "How can I make adjustments to my scheduled appointment date?",
        "label": 6
    },
    {
        "text": "Do we need to send the Chest X-ray film, Hepa B Screening Result, and Medical Certificate by mail or courier as part of the submission?",
        "label": 30
    },
    {
        "text": "Is there an edit option available for the uploaded picture in my online profile?",
        "label": 8
    },
    {
        "text": "Can you provide information on the deadline for the submission of all documentary requirements?",
        "label": 9
    },
    {
        "text": "Can you provide the undergraduate courses offered at Bicol University?",
        "label": 58
    },
    {
        "text": "Could you explain how one can determine their success in the BUCET?",
        "label": 52
    },
    {
        "text": "Is there a specific date for the BUCET results to be disclosed?",
        "label": 55
    },
    {
        "text": "Share insights on the AY 202*-202* Bicol University College Entrance Test eligibility.",
        "label": 53
    },
    {
        "text": "Are there any specific forms or documentation required for ITR submission if my parent or guardian is a senior citizen or PWD?",
        "label": 25
    },
    {
        "text": "Is it okay if the mailing stamp is more than 40 pesos?",
        "label": 28
    },
    {
        "text": "Could you list the courses that the College of Engineering (CENG)?",
        "label": 46
    },
    {
        "text": "Where do I need to visit within the mall to purchase mailing stamps?",
        "label": 20
    },
    {
        "text": "Can you provide information on the courses offered in the Institute of Design and Architecture (IDeA)?",
        "label": 40
    },
    {
        "text": "Would it pose a concern if the mailing stamp exceeded the 40 pesos threshold?",
        "label": 28
    },
    {
        "text": "Can you inform me about the protocol for rescheduling my appointment date?",
        "label": 6
    },
    {
        "text": "Could you inform me about the states that host BUCET test centers?",
        "label": 56
    },
    {
        "text": "Can you outline the steps for checking BUCET exam pass outcomes?",
        "label": 52
    },
    {
        "text": "How long does it typically take to receive a decision on my BUCET 202*-202* application?",
        "label": 50
    },
    {
        "text": "Should Form 138 (Report Card) be presented for both Grade 11 and Grade 12 admission hurdles?",
        "label": 33
    },
    {
        "text": "Should I affix the 40 pesos postage stamp?",
        "label": 27
    },
    {
        "text": "I'm curious about the whereabouts of the BUCET test centers.",
        "label": 56
    },
    {
        "text": "Should I submit an ITR if my parent or guardian qualifies as a senior citizen or PWD?",
        "label": 25
    },
    {
        "text": "Is there a specific method to check if I made it through the BUCET?",
        "label": 52
    },
    {
        "text": "How can I officially request to claim my BUCET test permit?",
        "label": 15
    },
    {
        "text": "Can the postage stamp be priced at more than 40 pesos without any problem?",
        "label": 28
    },
    {
        "text": "Should Form 138 (Report Card) be submitted for both Grade 11 and Grade 12 admission protocols?",
        "label": 33
    },
    {
        "text": "Is applying via mobile phone allowed for this process?",
        "label": 57
    },
    {
        "text": "When should we expect to see the BUCET results?",
        "label": 55
    },
    {
        "text": "Can you inform me about the appeal process in case my request to correct a wrongly completed application form is denied?",
        "label": 13
    },
    {
        "text": "Is it necessary to dispatch the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier along with the other requirements?",
        "label": 30
    },
    {
        "text": "Can students anticipate having dropboxes at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Is there a review process or waiver for situations where using a mailing stamp over Php 50.00 is necessary?",
        "label": 21
    },
    {
        "text": "Could you outline the specific steps or documents required for applicants with OFW parents?",
        "label": 23
    },
    {
        "text": "What academic courses are available for enrollment at the College of Nursing (CN)",
        "label": 41
    },
    {
        "text": "Could you guide me on where to address my concerns related to BUCET?",
        "label": 26
    },
    {
        "text": "Share insights on the eligibility process for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Is it permissible for the mailing stamp to surpass the 40 pesos limit?",
        "label": 28
    },
    {
        "text": "Should Form 138 (Report Card) be submitted for both Grade 11 and Grade 12 academic years?",
        "label": 33
    },
    {
        "text": "What is the specific location where I should go to purchase a mailing stamp?",
        "label": 20
    },
    {
        "text": "When will the BUCET results be available for public viewing?",
        "label": 55
    },
    {
        "text": "Could you share information on the nationwide locations of BUCET test centers?",
        "label": 56
    },
    {
        "text": "Could the mailing stamp surpass the 40 pesos limit without issue?",
        "label": 28
    },
    {
        "text": "Is the 40 pesos stamp required for mailing?",
        "label": 27
    },
    {
        "text": "Is it permissible for the mailing stamp to go over the 40 pesos limit?",
        "label": 28
    },
    {
        "text": "Can I apply for BUCET 202*-202* if English is not my first language?",
        "label": 50
    },
    {
        "text": "What are the steps to follow when pasting the Php 50.00 mailing stamp?",
        "label": 22
    },
    {
        "text": "What qualifications must be met to be eligible for the AY 202*-202* Bicol University College Entrance Test?",
        "label": 53
    },
    {
        "text": "To whom should I direct my questions about BUCET?",
        "label": 26
    },
    {
        "text": "List the qualifications needed to be eligible for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 admission procedures?",
        "label": 33
    },
    {
        "text": "Will Bicol University include dropbox facilities in its satellite campuses?",
        "label": 32
    },
    {
        "text": "Could you inform me of the proper channels to go through for editing the online-submitted picture?",
        "label": 8
    },
    {
        "text": "What documents are compulsory for online submission?",
        "label": 31
    },
    {
        "text": "Please share details about the courses present in the College of Arts and Letters (CAL).",
        "label": 39
    },
    {
        "text": "Is a 4P's certificate required, or is it optional for our situation?",
        "label": 24
    },
    {
        "text": "Is it within the rules for the mailing stamp to be valued at more than 40 pesos?",
        "label": 28
    },
    {
        "text": "Where should I go to secure the application form for BUCET?",
        "label": 5
    },
    {
        "text": "Enumerate the essential online document lineup.",
        "label": 31
    },
    {
        "text": "Break down the specific actions required for the successful submission of BUCET requirements.",
        "label": 51
    },
    {
        "text": "I'm interested in learning about the available courses in the BU Gubat Campus (BUGC)",
        "label": 38
    },
    {
        "text": "Would it be alright for the mailing stamp to be under 40 pesos?",
        "label": 29
    },
    {
        "text": "Can you tell me when the BUCET results will be published?",
        "label": 55
    },
    {
        "text": "Where can I find the BUCET ombudsman's contact information for addressing concerns?",
        "label": 26
    },
    {
        "text": "Can the postage stamp go beyond 40 pesos in value without any trouble?",
        "label": 28
    },
    {
        "text": "How should I proceed if my appointment date is after the specified deadline for the test center?",
        "label": 17
    },
    {
        "text": "Do we have to pass Form 138 for both Grade 11 and Grade 12 admission qualifications?",
        "label": 33
    },
    {
        "text": "I'll be in touch.",
        "label": 1
    },
    {
        "text": "Does the need for a 4P's certificate change based on changes in financial circumstances?",
        "label": 24
    },
    {
        "text": "Can you provide information on the courses offered in the College of Social Sciences and Philosophy (CSSP)?",
        "label": 35
    },
    {
        "text": "Can the postage stamp amount be less than 40 pesos?",
        "label": 29
    },
    {
        "text": "What courses does the College of Industrial Technology (CIT) feature in its curriculum?",
        "label": 45
    },
    {
        "text": "Can you specify the courses offered by BU?",
        "label": 58
    },
    {
        "text": "Outline the steps necessary to be eligible for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Is there a specific method to check if I made it through the BUCET?",
        "label": 52
    },
    {
        "text": "How does the senior citizen or PWD status of my parent or guardian impact my responsibility to submit an ITR?",
        "label": 25
    },
    {
        "text": "How cab I apply in BU?",
        "label": 50
    },
    {
        "text": "Enumerate the subjects that the test examines.",
        "label": 54
    },
    {
        "text": "What's the specific location to collect the BUCET application form?",
        "label": 5
    },
    {
        "text": "Can students specifically use dropboxes specifically at the BU Main Campus to turn in their requirements conveniently?",
        "label": 32
    },
    {
        "text": "How do I submit my BUCET application requirements?",
        "label": 14
    },
    {
        "text": "Where are the designated test centers for the BUCET located?",
        "label": 56
    },
    {
        "text": "Can you share information on the precise locations of BUCET test centers?",
        "label": 56
    },
    {
        "text": "Should Form 138 be submitted for both Grade 11 and Grade 12 admission assessments?",
        "label": 33
    },
    {
        "text": "Do you know when the results of the BUCET will be available?",
        "label": 55
    },
    {
        "text": "I'm curious about the whereabouts of BUCET test centers across different regions.",
        "label": 56
    },
    {
        "text": "Is it acceptable to apply via cellphone?",
        "label": 57
    },
    {
        "text": "What courses does the College of Business, Economics and Management (CBEM) feature in its curriculum?",
        "label": 44
    },
    {
        "text": "Should I maintain my original appointment date if I choose either option 1 or option 3?",
        "label": 16
    },
    {
        "text": "Can you guide me on how to access and retrieve the BUCET application form?",
        "label": 7
    },
    {
        "text": "Is the 40 pesos postage stamp a requirement for mailing?",
        "label": 27
    },
    {
        "text": "Are there specific instructions for checking if I passed the BUCET?",
        "label": 52
    },
    {
        "text": "What areas of study are considered in the test?",
        "label": 54
    },
    {
        "text": "Can the postage stamp's value be higher than 40 pesos without any trouble?",
        "label": 28
    },
    {
        "text": "Could you list the courses offered at Bicol University?",
        "label": 58
    },
    {
        "text": "Tell me about the array of courses within the Bicol University Polangui",
        "label": 48
    },
    {
        "text": "Could you provide a comprehensive overview of the BUCET requirements submission process?",
        "label": 51
    },
    {
        "text": "I would like to know about the course offerings in the College of Dental Medicine (CDM)",
        "label": 49
    },
    {
        "text": "Can the postage stamp value be lower than 40 pesos?",
        "label": 29
    },
    {
        "text": "Is it possible to apply through a mobile device?",
        "label": 57
    },
    {
        "text": "Should I follow the appointment date even if it extends past the initially scheduled deadline for the test center?",
        "label": 17
    },
    {
        "text": "Do we have to submit Form 138 for both Grade 11 and Grade 12 admission challenges?",
        "label": 33
    },
    {
        "text": "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission forms?",
        "label": 33
    },
    {
        "text": "Is it required to enclose the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when sending documents via mail or courier?",
        "label": 30
    },
    {
        "text": "What should I do if I accidentally place the Php 50.00 mailing stamp in the wrong position on the envelope?",
        "label": 22
    },
    {
        "text": "What's the process for making edits to the picture I already submitted online?",
        "label": 8
    },
    {
        "text": "Are we required to send the Chest X-ray film, Hepa B Screening Result, and Medical Certificate along with the submission through mail or courier?",
        "label": 30
    },
    {
        "text": "Is there a designated location or online portal for claiming my BUCET test permit?",
        "label": 15
    },
    {
        "text": "Do you know the place where I can obtain the BUCET application form?",
        "label": 5
    },
    {
        "text": "Is it fine if the postage doesn't reach 40 pesos?",
        "label": 29
    },
    {
        "text": "Do we need to dispatch the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier along with other requirements?",
        "label": 30
    },
    {
        "text": "Where should I go to visit the BU admissions office, and what is the address?",
        "label": 18
    },
    {
        "text": "What kind of courses are available in the College of Engineering (CENG)?",
        "label": 46
    },
    {
        "text": "When will we be able to access the BUCET results online?",
        "label": 55
    },
    {
        "text": "If I opt for either option 1 or option 3, do I still need to adhere to the appointment date?",
        "label": 16
    },
    {
        "text": "Any insights on how I can confirm my success in the BUCET?",
        "label": 52
    },
    {
        "text": "Is the 40 pesos postage stamp compulsory?",
        "label": 27
    },
    {
        "text": "Can you outline the preferred picture format for the intended purpose?",
        "label": 19
    },
    {
        "text": "Elaborate on the subjects that the test covers.",
        "label": 54
    },
    {
        "text": "Which topics are considered in the test?",
        "label": 54
    },
    {
        "text": "Enumerate the steps one should follow to be eligible for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "What topics are part of the test's assessment?",
        "label": 54
    },
    {
        "text": "Should I seek assistance from the test center if my appointment date falls after their deadline?",
        "label": 17
    },
    {
        "text": "Are there any specific forms or paperwork designed for applicants with OFW parents?",
        "label": 23
    },
    {
        "text": "Do I have to abide by the appointment date if I go for option 1 or option 3?",
        "label": 16
    },
    {
        "text": "Will Bicol University include dropbox facilities in its satellite campus planning?",
        "label": 32
    },
    {
        "text": "Could you advise me on the location to obtain the BUCET application form?",
        "label": 5
    },
    {
        "text": "Do we need to dispatch the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier along with other requirements?",
        "label": 30
    },
    {
        "text": "Do we have to pass Form 138 for both Grade 11 and Grade 12 admission features?",
        "label": 33
    },
    {
        "text": "What is the process for claiming my BUCET test permit?",
        "label": 15
    },
    {
        "text": "What kind of courses are available in the College of Engineering (CENG)?",
        "label": 47
    },
    {
        "text": "See you later.",
        "label": 1
    },
    {
        "text": "Is it permissible for the mailing stamp to go over the 40 pesos limit?",
        "label": 28
    },
    {
        "text": "Could you list the courses that the College of Dental Medicine/(CDM)?",
        "label": 49
    },
    {
        "text": "Could you elaborate on the proper method for submitting the BUCET requirements?",
        "label": 51
    },
    {
        "text": "Do I have to attach the 40 pesos mailing stamp?",
        "label": 27
    },
    {
        "text": "Could you explain the rationale behind the Php 50.00 limit for mailing stamps and any potential exceptions?",
        "label": 21
    },
    {
        "text": "Enumerate the necessary paperwork for online transactions.",
        "label": 31
    },
    {
        "text": "Do I need to follow through with my scheduled appointment date when selecting option 1 or option 3?",
        "label": 16
    },
    {
        "text": "Could you provide instructions on adjusting my appointment date?",
        "label": 6
    },
    {
        "text": "Is it mandatory to pass Form 138 for both Grade 11 and Grade 12 enrollment processes?",
        "label": 33
    },
    {
        "text": "Is the provision of dropboxes part of the development plan for Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 admission grievances?",
        "label": 33
    },
    {
        "text": "What paperwork needs to be uploaded online?",
        "label": 31
    },
    {
        "text": "Must we pass Form 138 for both Grade 11 and Grade 12 admission parameters?",
        "label": 33
    },
    {
        "text": "Is it a requirement to submit Form 138 for both Grade 11 and Grade 12 levels?",
        "label": 33
    },
    {
        "text": "Clarify the range of subjects in the test.",
        "label": 54
    },
    {
        "text": "What documentation or information do I need to provide to retrieve the BUCET application form?",
        "label": 7
    },
    {
        "text": "Can you provide instructions on the proper way to submit my BUCET application requirements?",
        "label": 14
    },
    {
        "text": "Is it okay if the mailing stamp doesn't meet the 40 pesos threshold?",
        "label": 29
    },
    {
        "text": "I'm interested in exploring the BUCET test centers' geographical spread.",
        "label": 56
    },
    {
        "text": "Must I use the 40 pesos mailing stamp?",
        "label": 27
    },
    {
        "text": "Discuss the online submission document prerequisites.",
        "label": 31
    },
    {
        "text": "Is there a plan to implement dropboxes for Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Can you list the available courses at Bicol University?",
        "label": 58
    },
    {
        "text": "Is it fine if the mailing stamp is below 40 pesos?",
        "label": 29
    },
    {
        "text": "What courses can a student expect to find in the College of Nursing (CN) encompasses?",
        "label": 41
    },
    {
        "text": "What courses does the Institute of Design and Architecture (IDeA) feature in its curriculum?",
        "label": 40
    },
    {
        "text": "Would it be alright for the mailing stamp to be below 40 pesos?",
        "label": 29
    },
    {
        "text": "What is the official stance on using a mailing stamp with a value greater than Php 50.00?",
        "label": 21
    },
    {
        "text": "State the mandatory online document criteria.",
        "label": 31
    },
    {
        "text": "Enumerate the documents to be forwarded online.",
        "label": 31
    },
    {
        "text": "Must we submit Form 138 for both Grade 11 and Grade 12 admission evaluations?",
        "label": 33
    },
    {
        "text": "Where can I find the contact information, including the address, for the BU admissions office?",
        "label": 18
    },
    {
        "text": "I can't thank you enough",
        "label": 2
    },
    {
        "text": "In the context of having an OFW parent, what specific paperwork should be included in my submission?",
        "label": 23
    },
    {
        "text": "Enlighten me on the various courses that the College of Business, Economics and Management (CBEM)",
        "label": 44
    },
    {
        "text": "Where in the country are the BUCET test centers positioned?",
        "label": 56
    },
    {
        "text": "How does the submission process differ when parents are overseas Filipino workers (OFWs)?",
        "label": 23
    },
    {
        "text": "How to apply in BU?",
        "label": 50
    },
    {
        "text": "Can you provide information on the turnaround time for addressing submitted BUCET concerns?",
        "label": 26
    },
    {
        "text": "What is the correct channel for me to address my BUCET-related concerns, and where is it located?",
        "label": 26
    },
    {
        "text": "Is it necessary to dispatch the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier along with the other requirements?",
        "label": 30
    },
    {
        "text": "Can the postage stamp's value be higher than 40 pesos without any issue?",
        "label": 28
    },
    {
        "text": "I'm interested in learning about the available courses in the Jesse M. Robredo Institute of Governance and Development (JMRIGD)",
        "label": 42
    },
    {
        "text": "Describe the eligibility process for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Where can I find the official BUCET grievance policy for addressing concerns?",
        "label": 26
    },
    {
        "text": "Is it permissible to use a mailing stamp with a value greater than Php 50.00?",
        "label": 28
    },
    {
        "text": "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 educational records?",
        "label": 33
    },
    {
        "text": "What is the proper protocol for turning in the BUCET requirements for consideration?",
        "label": 51
    },
    {
        "text": "Is it acceptable to keep my appointment date even if it is beyond the test center's designated deadline?",
        "label": 17
    },
    {
        "text": "I'm interested in learning about the available courses in the Institute of Design and Architecture (IDeA)",
        "label": 40
    },
    {
        "text": "I would like to know about the course offerings in the College of Arts and Letters (CAL)",
        "label": 39
    },
    {
        "text": "I'm inquiring about the regional distribution of BUCET test centers.",
        "label": 56
    },
    {
        "text": "What qualifications and criteria should one meet for the AY 202*-202* Bicol University College Entrance Test?",
        "label": 53
    },
    {
        "text": "Must the documents sent through mail/courier include the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
        "label": 30
    },
    {
        "text": "Specify the documents required for online procedures.",
        "label": 31
    },
    {
        "text": "Should I adhere to the appointment date if I choose either option 1 or option 3?",
        "label": 16
    },
    {
        "text": "Do we need to present Form 138 for both Grade 11 and Grade 12 admission considerations?",
        "label": 33
    },
    {
        "text": "What office handles queries and concerns regarding BUCET?",
        "label": 26
    },
    {
        "text": "Can the postage stamp amount be less than 40 pesos?",
        "label": 29
    },
    {
        "text": "What's the recommended method for claiming my BUCET test permit?",
        "label": 15
    },
    {
        "text": "Name the topics that the test evaluates.",
        "label": 54
    },
    {
        "text": "Is there a specific website or platform for retrieving the BUCET application form?",
        "label": 7
    },
    {
        "text": "Is mobile application submission an option for applying?",
        "label": 57
    },
    {
        "text": "Could you guide me through the process of submitting the BUCET requirements?",
        "label": 51
    },
    {
        "text": "Please share details about the courses present in the College of Industrial Technology (CIT)",
        "label": 45
    },
    {
        "text": "What do I need to do to claim my BUCET test permit?",
        "label": 15
    },
    {
        "text": "Are there any specific health requirements for BUCET 202*-202* applicants?",
        "label": 50
    },
    {
        "text": "Can I apply for BUCET 202*-202* if I'm an international student?",
        "label": 50
    },
    {
        "text": "What options are available for me to reschedule my appointment date?",
        "label": 6
    },
    {
        "text": "Do we have to secure a certificate from 4P's for compliance or verification purposes?",
        "label": 24
    },
    {
        "text": "Is there any issue if the mailing stamp's value surpasses 40 pesos?",
        "label": 28
    },
    {
        "text": "Must we submit Form 138 for both Grade 11 and Grade 12 admission standards?",
        "label": 33
    },
    {
        "text": "Is there a specific link or section for editing the picture after online submission?",
        "label": 8
    },
    {
        "text": "Do we need to pass Form 138 for both Grade 11 and Grade 12 admission submissions?",
        "label": 33
    },
    {
        "text": "Enumerate the test's subject matter for me.",
        "label": 54
    },
    {
        "text": "Will drop-off services be part of the amenities at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Would it be alright for the mailing stamp to be less than 40 pesos?",
        "label": 29
    },
    {
        "text": "Can you explain the procedures involved in claiming my BUCET test permit?",
        "label": 15
    },
    {
        "text": "Could you offer details on the exact address of the BU admissions office for in-person visits?",
        "label": 18
    },
    {
        "text": "Could you guide me through the process of editing the picture I uploaded for my online submission?",
        "label": 8
    },
    {
        "text": "How will I be notified if I've successfully passed the BUCET?",
        "label": 52
    },
    {
        "text": "Specify the test's topics coverage, please.",
        "label": 54
    },
    {
        "text": "I want to apply for BUCET 202*-202*; what's the application procedure?",
        "label": 50
    },
    {
        "text": "At which stores or outlets can I buy postage stamps?",
        "label": 20
    },
    {
        "text": "If my parent/s is an/are overseas Filipino workers (OFW), what supplemental materials should I submit?",
        "label": 23
    },
    {
        "text": "Are there any specific eligibility criteria for BUCET 202*-202* application?",
        "label": 50
    },
    {
        "text": "What are the guidelines for submitting the BUCET requirements?",
        "label": 51
    },
    {
        "text": "I'm interested in learning about the available courses in the College of Education (CE)",
        "label": 37
    },
    {
        "text": "How to apply in Bicol University?",
        "label": 50
    },
    {
        "text": "What steps do I need to follow to confirm my BUCET success?",
        "label": 52
    },
    {
        "text": "Can a school official, such as a teacher or counselor, submit my BUCET application requirements?",
        "label": 11
    },
    {
        "text": "How can I go back and edit the image I attached during the online submission?",
        "label": 8
    },
    {
        "text": "What are the prerequisites to qualify for the AY 202*-202* Bicol University College Entrance Test?",
        "label": 53
    },
    {
        "text": "Explain how to initiate the submission of BUCET requirements.",
        "label": 51
    },
    {
        "text": "What steps should I take if I want to reapply due to errors in my application form?",
        "label": 12
    },
    {
        "text": "Is it permissible for the mailing stamp to be priced at more than 40 pesos?",
        "label": 28
    },
    {
        "text": "What is the proper procedure for correcting a mistakenly filled application form?",
        "label": 13
    },
    {
        "text": "Do I need to provide any specific information regarding my parent's overseas employment in my application?",
        "label": 23
    },
    {
        "text": "Where can I locate the BUCET test centers within the state?",
        "label": 56
    },
    {
        "text": "Can you guide me through the necessary stages of submitting the BUCET requirements?",
        "label": 51
    },
    {
        "text": "Is there any problem with the postage stamp costing more than 40 pesos?",
        "label": 28
    },
    {
        "text": "Is it mandatory to pass Form 138 for both Grade 11 and Grade 12 school years?",
        "label": 33
    },
    {
        "text": "Is there a deadline for submitting the BUCET 202*-202* application?",
        "label": 50
    },
    {
        "text": "Could you elaborate on the topics covered in the test?",
        "label": 54
    },
    {
        "text": "Where specifically are the BUCET test centers located in the nation?",
        "label": 56
    },
    {
        "text": "How can I make sure that the Php 50.00 mailing stamp is securely attached and won't fall off during transit?",
        "label": 22
    },
    {
        "text": "Can you inform me about any changes in the BUCET application fee for the upcoming academic year?",
        "label": 10
    },
    {
        "text": "Please share details about the courses present in the College of Education (CE).",
        "label": 37
    },
    {
        "text": "Is there a specific website to visit in order to get the BUCET application form?",
        "label": 7
    },
    {
        "text": "Is Form 138 (Report Card) required for both Grade 11 and Grade 12 admission verifications?",
        "label": 33
    },
    {
        "text": "Is there a requirement to attach the Chest X-ray film, Hepa B Screening Result, and Medical Certificate when sending documents by mail or courier?",
        "label": 30
    },
    {
        "text": "Could you clarify the submission procedure for the BUCET application requirements?",
        "label": 14
    },
    {
        "text": "Are there specific courses that the College of Social Sciences and Philosophy (CSSP)specializes in?",
        "label": 35
    },
    {
        "text": "Any suggestions on how I can confirm my pass status in the BUCET?",
        "label": 52
    },
    {
        "text": "Are there additional steps or requirements for individuals with at least one parent working abroad as an OFW?",
        "label": 23
    },
    {
        "text": "Do we need to submit Form 138 for both Grade 11 and Grade 12 admission necessities?",
        "label": 33
    },
    {
        "text": "List the subjects that the test encompasses.",
        "label": 54
    },
    {
        "text": "When will the results of the BUCET examination be disclosed?",
        "label": 55
    },
    {
        "text": "Enlighten me on the intricacies of the formal submission process for BUCET requirements.",
        "label": 51
    },
    {
        "text": "Should the 40 pesos postage stamp be attached?",
        "label": 27
    },
    {
        "text": "When is the deadline for submission of all documentary requirements?",
        "label": 9
    },
    {
        "text": "Could you clarify the timeline for when and how I can claim my BUCET test permit?",
        "label": 15
    },
    {
        "text": "Can you tell me when all the documentary requirements must be met?",
        "label": 9
    },
    {
        "text": "Can you provide a breakdown of the steps to submit the BUCET requirements?",
        "label": 51
    },
    {
        "text": "Is it permissible for the postage stamp to surpass the 40 pesos limit?",
        "label": 28
    },
    {
        "text": "Could you list the courses that the College of Business, Economics and Management/(CBEM)?",
        "label": 44
    },
    {
        "text": "Enlighten me on the various courses that the College of Engineering (CENG)",
        "label": 46
    },
    {
        "text": "What steps should I take to ascertain whether I've passed the BUCET?",
        "label": 52
    },
    {
        "text": "Enumerate the essential online document compilation.",
        "label": 31
    },
    {
        "text": "What is the email address for submitting concerns about BUCET?",
        "label": 26
    },
    {
        "text": "Can you walk me through the process to claim my BUCET test permit?",
        "label": 15
    },
    {
        "text": "What additional information is necessary for applicants with parents currently working overseas as OFWs?",
        "label": 23
    },
    {
        "text": "Must we submit Form 138 for both Grade 11 and Grade 12 admission validations?",
        "label": 33
    },
    {
        "text": "Any advice on ensuring I passed the BUCET successfully?",
        "label": 52
    },
    {
        "text": "Is there a specific tool or feature for editing the picture after online submission?",
        "label": 8
    },
    {
        "text": "Clarify the specific steps needed for the successful submission of BUCET requirements.",
        "label": 51
    },
    {
        "text": "Elaborate on the range of subjects in the test.",
        "label": 54
    },
    {
        "text": "When will we get to know the outcome of the BUCET?",
        "label": 55
    },
    {
        "text": "Mention the requisite documents for online validation.",
        "label": 31
    },
    {
        "text": "To whom should I send an email regarding my BUCET-related questions?",
        "label": 26
    },
    {
        "text": "What's the recommended method for fixing errors in an application form that was inaccurately filled?",
        "label": 13
    },
    {
        "text": "Is the 40 pesos stamp necessary for mailing?",
        "label": 27
    },
    {
        "text": "Please share details about the courses present in the College of Science.",
        "label": 34
    },
    {
        "text": "Are there any specific labels or identifiers needed when submitting my BUCET application requirements?",
        "label": 14
    },
    {
        "text": "How does one typically find out if they passed the BUCET?",
        "label": 52
    },
    {
        "text": "Will specifically designated dropboxes be provided specifically for students submitting requirements at the BU Main Campus?",
        "label": 32
    },
    {
        "text": "Is there a specific department or contact I should reach out to for claiming my BUCET test permit?",
        "label": 15
    },
    {
        "text": "Are there any implications if we choose a mailing stamp that surpasses the Php 50.00 limit?",
        "label": 21
    },
    {
        "text": "Is there an online platform or system where I can digitally correct a wrongly filled application form?",
        "label": 13
    },
    {
        "text": "Can you explain the intricacies of the BUCET requirements submission procedure?",
        "label": 51
    },
    {
        "text": "Can you guide me on how to apply for BUCET 202*-202*?",
        "label": 50
    },
    {
        "text": "Can you guide me on how to reschedule my appointment date?",
        "label": 6
    },
    {
        "text": "Can you tell me a joke?",
        "label": 4
    },
    {
        "text": "Are there plans to establish drop-off locations in Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "What are the courses available in the Bicol University Polangui/(BUPC)?",
        "label": 48
    },
    {
        "text": "Specify the documents required for online processing.",
        "label": 31
    },
    {
        "text": "What is the standard protocol for editing the picture submitted online?",
        "label": 8
    },
    {
        "text": "Is applying via mobile phone an option?",
        "label": 57
    },
    {
        "text": "Can I submit a new application since I mistakenly completed my initial application form?",
        "label": 12
    },
    {
        "text": "Is there a specific set of requirements for applicants with parents who are overseas Filipino workers (OFWs)?",
        "label": 23
    },
    {
        "text": "Where are the test centers for the BUCET located?",
        "label": 56
    },
    {
        "text": "Where is the BU admissions office located, and what is its mailing address?",
        "label": 18
    },
    {
        "text": "What's the formal way to request and claim the BUCET test permit?",
        "label": 15
    },
    {
        "text": "Is mobile application submission supported?",
        "label": 57
    },
    {
        "text": "Is it compulsory to pass Form 138 for both Grade 11 and Grade 12 admission reviews?",
        "label": 33
    },
    {
        "text": "List the documents needed for online processing.",
        "label": 31
    },
    {
        "text": "What options are available for mailing or couriering my BUCET application documents?",
        "label": 14
    },
    {
        "text": "Should I expect any issues if I stick to my appointment date after the test center's deadline?",
        "label": 17
    },
    {
        "text": "Hi, I'm talking to you!",
        "label": 0
    },
    {
        "text": "What is the protocol regarding my appointment date if I opt for either option 1 or option 3?",
        "label": 16
    },
    {
        "text": "How does the absence of a 4P's certificate affect access to social services or government programs?",
        "label": 24
    },
    {
        "text": "Will specifically designated drop-off locations specifically be established specifically for requirements submission specifically at the BU Main Campus?",
        "label": 32
    },
    {
        "text": "Any insights on how I can confirm my success in the BUCET?",
        "label": 52
    },
    {
        "text": "Is there a specific area on the envelope where I should paste the Php 50.00 mailing stamp?",
        "label": 22
    },
    {
        "text": "Would it be acceptable for the postage stamp to be less than 40 pesos?",
        "label": 29
    },
    {
        "text": "Could you inform me of the proper channels to go through for retrieving the BUCET application form?",
        "label": 7
    },
    {
        "text": "Is including the Chest X-ray film, Hepa B Screening Result, and Medical Certificate in the mailed/couriered documents a prerequisite?",
        "label": 30
    },
    {
        "text": "Detail the mandatory online submission paperwork.",
        "label": 31
    },
    {
        "text": "Are specifically designated drop-off zones specifically designated specifically for requirements specifically at the BU Main Campus?",
        "label": 32
    },
    {
        "text": "tell me about this app",
        "label": 3
    },
    {
        "text": "Is the acquisition of a 4P's certificate a requirement for specific programs or services?",
        "label": 24
    },
    {
        "text": "I'm looking for a concise guide on how to submit the BUCET requirements; can you assist?",
        "label": 51
    },
    {
        "text": "What's the standard practice for confirming success in the BUCET?",
        "label": 52
    },
    {
        "text": "Is the 40 pesos postage stamp indispensable?",
        "label": 27
    },
    {
        "text": "I'm unfamiliar with the process; could you provide a detailed guide on BUCET requirements submission?",
        "label": 51
    },
    {
        "text": "How much money should I prepare for the BUCET application fee?",
        "label": 10
    },
    {
        "text": "Which topics are addressed in the test?",
        "label": 54
    },
    {
        "text": "I'm searching for the BUCET test centers' exact positions.",
        "label": 56
    },
    {
        "text": "Where can I find detailed information on the submission process for my BUCET application requirements?",
        "label": 14
    },
    {
        "text": "Will there be dropbox amenities at the satellite campuses of Bicol University?",
        "label": 32
    },
    {
        "text": "When is the anticipated announcement date for the BUCET results?",
        "label": 55
    },
    {
        "text": "Does choosing option 1 or option 3 alter my commitment to the initially assigned appointment date?",
        "label": 16
    },
    {
        "text": "Can you guide me on how to reach the BUCET support team for concerns?",
        "label": 26
    },
    {
        "text": "Specify the online submission document criteria.",
        "label": 31
    },
    {
        "text": "I'm curious about the course options within the College of Industrial Technology (CIT)",
        "label": 45
    },
    {
        "text": "I'm unfamiliar with the process; could you provide insights into submitting the BUCET requirements?",
        "label": 51
    },
    {
        "text": "What's the best place to buy international mailing stamps?",
        "label": 20
    },
    {
        "text": "Is the 40 pesos mailing stamp compulsory?",
        "label": 27
    },
    {
        "text": "Can students specifically take advantage of specifically designated dropboxes specifically for submitting their requirements specifically at the BU Main Campus?",
        "label": 32
    },
    {
        "text": "Can you provide instructions on editing the online-submitted picture through the website?",
        "label": 8
    },
    {
        "text": "Are there plans to implement dropboxes in Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Can you clarify the documentation or qualifications necessary to secure a 4P's certificate?",
        "label": 24
    },
    {
        "text": "List the subjects covered in the test.",
        "label": 54
    },
    {
        "text": "What subjects are part of the test's assessment?",
        "label": 54
    },
    {
        "text": "Would it be acceptable if the postage stamp falls below 40 pesos?",
        "label": 29
    },
    {
        "text": "What criteria determine whether an individual or household needs a 4P's certificate?",
        "label": 24
    },
    {
        "text": "Do we need to dispatch the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier along with other requirements?",
        "label": 30
    },
    {
        "text": "Where can I find the official address for the BU admissions office for correspondence?",
        "label": 18
    },
    {
        "text": "Do you have a joke to share?",
        "label": 4
    },
    {
        "text": "Will there be a rollout of dropbox services at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Could you specify the last date by which I need to submit all required documents?",
        "label": 9
    },
    {
        "text": "State the mandatory online document criteria.",
        "label": 31
    },
    {
        "text": "Provide a step-by-step guide on how to qualify for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Are specifically designated dropboxes strategically located specifically at the BU Main Campus for the submission of requirements?",
        "label": 32
    },
    {
        "text": "Should I reschedule my appointment if it falls beyond the scheduled deadline for the test center?",
        "label": 17
    },
    {
        "text": "Could you provide a detailed walkthrough of the BUCET requirements submission process?",
        "label": 51
    },
    {
        "text": "What are the steps to retrieve the BUCET application form?",
        "label": 7
    },
    {
        "text": "Are there any exceptions or allowances for using a mailing stamp worth more than Php 50.00?",
        "label": 21
    },
    {
        "text": "What's the location for picking up the BUCET application form?",
        "label": 5
    },
    {
        "text": "Can the mailing stamp value fall short of 40 pesos?",
        "label": 29
    },
    {
        "text": "Will Bicol University establish drop-off locations at its satellite campuses?",
        "label": 32
    },
    {
        "text": "Tell me about the array of courses within the College of Arts and Letters (CAL)",
        "label": 39
    },
    {
        "text": "List the documents necessary for online verification.",
        "label": 31
    },
    {
        "text": "What is the recommended method for applicants to officially claim their BUCET test permits?",
        "label": 15
    },
    {
        "text": "Provide a detailed guide on how to meet the eligibility conditions for the AY 202*-202* Bicol University College Entrance Test.",
        "label": 53
    },
    {
        "text": "Can I claim any tax benefits or exemptions based on the senior citizen or PWD status of my parent or guardian?",
        "label": 25
    },
    {
        "text": "Can the mailing stamp's value surpass 40 pesos without any issue?",
        "label": 28
    },
    {
        "text": "Will drop-off facilities be included in the infrastructure of Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "What is the official procedure for claiming the BUCET test permit?",
        "label": 15
    },
    {
        "text": "What are the steps for submitting my BUCET application requirements?",
        "label": 14
    },
    {
        "text": "Would there be any issue with the postage stamp being over 40 pesos?",
        "label": 28
    },
    {
        "text": "Can you inform me about the protocol for claiming the BUCET test permit?",
        "label": 15
    },
    {
        "text": "Can the postage stamp's value be higher than 40 pesos without any trouble?",
        "label": 28
    },
    {
        "text": "What are the key factors in meeting the AY 202*-202* Bicol University College Entrance Test eligibility?",
        "label": 53
    },
    {
        "text": "Is it within the acceptable range if the postage is under 40 pesos?",
        "label": 29
    },
    {
        "text": "Can you provide information on the courses offered in the Bicol University Polangui/(BUPC)?",
        "label": 48
    },
    {
        "text": "What are the courses available at Bicol University?",
        "label": 58
    },
    {
        "text": "Can you describe the proper method for submitting the BUCET requirements?",
        "label": 51
    },
    {
        "text": "What's the procedure for verifying BUCET results officially?",
        "label": 52
    },
    {
        "text": "Will there be secure dropboxes available at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "What is the official procedure for rescheduling an appointment date?",
        "label": 6
    },
    {
        "text": "What courses does the College of Science feature in its curriculum?",
        "label": 34
    },
    {
        "text": "Do we have to provide Form 138 for both Grade 11 and Grade 12 students?",
        "label": 33
    },
    {
        "text": "Should Form 138 (Report Card) be presented for both Grade 11 and Grade 12 admission acceptances?",
        "label": 33
    },
    {
        "text": "Must we submit Form 138 for both Grade 11 and Grade 12 admission queries?",
        "label": 33
    },
    {
        "text": "Thank you!",
        "label": 2
    },
    {
        "text": "Outline the documents essential for online processing.",
        "label": 31
    },
    {
        "text": "Should the package sent by mail/courier contain the Chest X-ray film, Hepa B Screening Result, and Medical Certificate?",
        "label": 30
    },
    {
        "text": "I'm curious about the course options within the College of Engineering (CENG)",
        "label": 46
    },
    {
        "text": "How frequently is it required to renew a 4P's certificate, and what is the renewal process?",
        "label": 24
    },
    {
        "text": "Are there any proposals to set up dropboxes in Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "What is the correct picture format?",
        "label": 19
    },
    {
        "text": "What are you?",
        "label": 3
    },
    {
        "text": "Any recommendations on confirming my BUCET pass status?",
        "label": 52
    },
    {
        "text": "What areas of study are considered in the test?",
        "label": 54
    },
    {
        "text": "Are there any intentions to provide dropboxes at Bicol University's satellite campuses?",
        "label": 32
    },
    {
        "text": "Can I enlist someone to submit my BUCET application requirements in my absence?",
        "label": 11
    },
    {
        "text": "Can I apply using a cellphone?",
        "label": 57
    },
    {
        "text": "Is it acceptable if our mailing stamp exceeds the value of Php 50.00?",
        "label": 21
    },
    {
        "text": "Time to go.",
        "label": 1
    },
    {
        "text": "What is the street address and zip code for the BU admissions office?",
        "label": 18
    },
    {
        "text": "If I filled out my application form incorrectly, can I initiate a new application process?",
        "label": 12
    },
    {
        "text": "How do I formally request and retrieve the BUCET application form?",
        "label": 7
    },
    {
        "text": "Can I use my mobile device to apply?",
        "label": 57
    },
    {
        "text": "I'm curious about the course options within the Jesse M. Robredo Institute of Governance and Development (JMRIGD)",
        "label": 42
    },
    {
        "text": "What qualifications are needed to take the AY 202*-202* Bicol University College Entrance Test?",
        "label": 53
    },
    {
        "text": "Is there a way for me to find out if I successfully cleared the BUCET?",
        "label": 52
    },
    {
        "text": "Is it fine if the postage stamp is less than 40 pesos?",
        "label": 29
    },
    {
        "text": "What topics fall under the test's examination?",
        "label": 54
    },
    {
        "text": "How does the senior citizen or PWD status of my parent or guardian affect my tax filing requirements?",
        "label": 25
    },
    {
        "text": "When are we likely to receive information about the BUCET results?",
        "label": 55
    },
    {
        "text": "What documentation or authorization is required if someone else is to submit my BUCET application requirements?",
        "label": 11
    },
    {
        "text": "Clarify the subjects covered by the test.",
        "label": 54
    },
    {
        "text": "Could you provide a comprehensive list of courses in the College of Nursing (CN) encompasses?",
        "label": 41
    },
    {
        "text": "Is it necessary to dispatch the Chest X-ray film, Hepa B Screening Result, and Medical Certificate through mail or courier along with the other requirements?",
        "label": 30
    },
    {
        "text": "Goodbye!",
        "label": 1
    },
    {
        "text": "Is the 40 pesos mailing stamp a necessity?",
        "label": 27
    },
    {
        "text": "Where can I find detailed information on claiming my BUCET test permit and any associated deadlines?",
        "label": 15
    },
    {
        "text": "Are there specific guidelines for checking if I passed the BUCET?",
        "label": 52
    },
    {
        "text": "Where do I locate stamp vending machines for purchasing postage stamps?",
        "label": 20
    },
    {
        "text": "Clarify the documents essential for online transactions.",
        "label": 31
    },
    {
        "text": "What is the preferred method for downloading and retrieving the BUCET application form?",
        "label": 7
    },
    {
        "text": "Is it a necessity to submit Form 138 for both Grade 11 and Grade 12 admission dimensions?",
        "label": 33
    },
    {
        "text": "What's the process for making edits to the picture I uploaded on the online platform?",
        "label": 8
    },
    {
        "text": "Can you inform me about the protocol for making changes to the online-submitted picture?",
        "label": 8
    }
]